[
  {
    "author": "@nshashank9975",
    "comment": "Thanks for taking the risk. DO NOT build for India, build for the world. We have such rich mythology, finally some one is using it in a practical way to reshape the global perception of our country.",
    "super_thanks_amount": "₹1,799.00"
  },
  {
    "author": "@SabyaIRL",
    "comment": "Finally, there is someone who just doesn't complain about India's gaming scene but is trying to fix it on his own at his own level!",
    "super_thanks_amount": ""
  },
  {
    "author": "@higher658",
    "comment": "Inspirational work coming from an Indian-American. But please, for India's sake, create some positive-looking environments of India as well. The narrative that India is all slums and filth is pushed now more than ever before. Capture the beauty of India as well.\n\nWith that being said, keep up the great work and push forward. I cannot wait to buy and play UTA",
    "super_thanks_amount": "$100.00"
  },
  {
    "author": "@rakshith-ravi",
    "comment": "Do like the game? No. But I would rather give this money to people who take risks and try something new than anybody else",
    "super_thanks_amount": "₹2,000.00"
  },
  {
    "author": "@thevaidik_",
    "comment": "As a student i cant do much for now, but this ignites the gaming development i was waiting to happen in India since years. In most extreme case even those 3d scans will we worth it. Best wishes everyone",
    "super_thanks_amount": "₹179.00"
  },
  {
    "author": "@AdityaAgarwalftw",
    "comment": "This is exactly what India needs, Capital in risky innovative areas and a dedication towards quality. Your team is doing the entire country a huge service.\nThis already feels like you might be aiming to make it better than Wukong. Hope the country supports you and let's make it happen.",
    "super_thanks_amount": "₹500.00"
  },
  {
    "author": "@meppatel",
    "comment": "Wildly excited for the game! Rooting for you and the team. It looks incredible already. \nGonna purchase it the minute it drops. Hope it becomes a success financially and otherwise, and pushes more such content out of India.",
    "super_thanks_amount": "$5.00"
  },
  {
    "author": "@abhishekprajapat415",
    "comment": "Thanks for the start. It doesn't matter even if this game fails. What you have done is lay the foundation. You have experience that you can use in other games too along with the assets. I am soo happy that someone is taking the risk. Just a small support from my side.\nAlso it seems there is a lot of ghosting and lag, this in game footage is from alpha build but please please optimize your game.",
    "super_thanks_amount": "₹1,000.00"
  },
  {
    "author": "@ArshGoyal",
    "comment": "Huge respect for you man!! congratulations :)",
    "super_thanks_amount": ""
  },
  {
    "author": "@Graveness4920",
    "comment": "Although I don’t particularly like your presentation style, I’m giving you another chance. The game looks excellent, especially considering it is still in its early phase of development. I’m glad that India has genuine risk-takers like you rather than just “keyboard warriors” like myself.\n\nI also want to share a piece of advice: in software development, it’s a good practice to ask an engineer for an estimate and then double it for planning purposes but please don’t mention this trick to the engineer.\n\nOne concern I have about the video is the claim that the game is 60% complete in 10 months. Honestly, that isn’t a realistic timeline for game development; it usually takes at least 2 to 3 years.\n\nThat said, you have an amazing and promising team. Thanks for the introduction!",
    "super_thanks_amount": "₹2,000.00"
  },
  {
    "author": "@p.j.h2401",
    "comment": "I absolutely love the concept. Not a fan of presentation though. Please hire a marketing and product guy who will put a clear image in front of developers. Trust me, being a developer I can say that we Love having clear pictures of what we are supposed to build. \n\nTake it as an honest opinion/constructive criticism because I CARE!",
    "super_thanks_amount": "₹200.00"
  },
  {
    "author": "@karanneole5606",
    "comment": "This is really a good start for the Indian Gaming Community!!! This really makes me happy!!!",
    "super_thanks_amount": "₹40.00"
  },
  {
    "author": "@Thugesh",
    "comment": "Crazy stuff!",
    "super_thanks_amount": ""
  },
  {
    "author": "@niharchoudhary99",
    "comment": "Thanks for being the \"Torch-Bearer\" for the whole country Varun. I wanna see a big AAA game coming from India before I die!",
    "super_thanks_amount": "₹100.00"
  },
  {
    "author": "@hiteshs6211",
    "comment": "From making self-help videos at 50k subs 5 years ago to now making world-class games at (soon to be) a million subscribers. What a journey it has been Varun Mayya! Very inspiring. Thank you. All the best!",
    "super_thanks_amount": ""
  },
  {
    "author": "@gijovarghese7548",
    "comment": "I'm not a pro gamer, but the quality of work is so so good. Love to see Indian origin games with Indian landscape.\n\nYou're on to a big mission. My tiny support. Love from Kerala.",
    "super_thanks_amount": "₹10,000.00"
  },
  {
    "author": "@kilutica3D",
    "comment": "You and your team are doing incredible work—much respect for what you’re building. Based on the insights you’ve shared, it’s clear how challenging it must be to create a AAA title from scratch, especially in India, where startups face significant risks and the gaming industry is still in its infancy.\r\n\r\nI sincerely hope you succeed in this endeavor, becoming a major contributor to the field in India and helping pave the way for the growth of game development, 3D modeling, coding, and more. Your work has the potential to inspire and introduce gaming as a thriving industry in the region.\r\n\r\nThank you for sharing this amazing journey—I’ve subscribed, shared, and will be eagerly following updates. Your project looks phenomenal, a global-scale competitor with style! Wishing you all the best!",
    "super_thanks_amount": "₹500.00"
  },
  {
    "author": "@RiyanJunaid",
    "comment": "Can't do much since I don't earn anything rn this is the most I can do but really love the efforts because I am seriously annoyed by how the Indian government doesn't provide separate regulations for the gaming industry and considers it the same as gambling applications, and how china with no prior experience in the pc and console gaming industry and only having mobile games till now successfully entered the market with a great game like black myth wukong while india still isn't even able to properly enter the mobile market or any market at this point. Looking forward to the game!",
    "super_thanks_amount": "₹40.00"
  },
  {
    "author": "@aashish6307",
    "comment": "I really appreciate you for taking on this gaming venture just for the risks and efforts and the product shows great potential although in early development. Would highly recommend to focus equally on storyline and music as much as graphics.",
    "super_thanks_amount": "₹500.00"
  },
  {
    "author": "@vinayraoo",
    "comment": "Thanks, for making it real.",
    "super_thanks_amount": "₹100.00"
  },
  {
    "author": "@shivendrasingh9930",
    "comment": "All the best!",
    "super_thanks_amount": "₹40.00"
  },
  {
    "author": "@anandmaneesh1043",
    "comment": "Minister Piyush Goyal is going to be really happy\n\nPS: Really great work!",
    "super_thanks_amount": ""
  },
  {
    "author": "@amandevbhardwaj",
    "comment": "Back him guys, someone had to step up and if anyone is doing it they deserve our support and love. We are capable and soon we can develop the ecosystem and AAA titles will become a common thing from India.\nProud of you Varun.",
    "super_thanks_amount": ""
  },
  {
    "author": "@locknloadspreon",
    "comment": "Just a thought… the combat looks dangerously similar to Sekiro (especially the parries and the red “Sankat” prompt). I understand that this is supposed to be a souls-like game but if there could be something done that would make the combat seem unique, it would really set this game apart.\nBecause after all the tremendous efforts your team has put in, I would hate for the world to label this as a “cheap copy of Sekiro” without even trying it. (Because the world is filled with yappers and unfortunately, these yappers make or break greatness) \nThat being said, there is no doubt your efforts will make every Indian proud. \nThank you for doing what nobody else would. I hope this causes a revolution in the Indian gaming industry (and the world).",
    "super_thanks_amount": "$4.99"
  },
  {
    "author": "@DarshilParmar",
    "comment": "From playing Dota 2 to building game, you are living the dream!",
    "super_thanks_amount": ""
  },
  {
    "author": "@prajyotkumar9644",
    "comment": "There are some suggestions if you like.\n\n1. Normal enemies are too calm, they should be a bit more aggressive to feel a certain tension.\n2. Attack feels hollow, it needs to have a bit more animation. You can shake the camera a bit more dramatically for that especially the attacks after parrying.\n3. Enviroment is too small. I think some bigger games had this issue in past and it almost killed that game so Make your environment big so people don't feel like they are constrained.\n4. Same with boss, the aftereffects of his attack were good but he heavily lacked variety and also his attacks when it hit the character were lackluster. Also every enemy of yours felt slow in movement. \n\nSince its alpha build, I hope you take these into consideration. Good luck",
    "super_thanks_amount": ""
  },
  {
    "author": "@6luecap",
    "comment": "Bro I’m stoked. God bless you and best wishes.",
    "super_thanks_amount": ""
  },
  {
    "author": "@shubharthidasgupta25",
    "comment": "Just like everyone else, the first order of things is a big congratulations. You are doing a great job. But, I wanted to highlight a small thing, and perhaps a different perspective/take.\n\n- The game looks great. But it won't matter much if the performance is not that good. Whatever happens, the game should run consistently well and bug-free at 60fps+. That would be my personal number one priority, even over the graphics. I am prepared to play a game with mediocre graphics if it has a good and engaging story and runs wells. It may be early days, but the first look and gameplay did not look so smooth. The animations look jittery, missing frames, etc. I am sure with the crew you have those will not be overlooked. Hopefully later on with more polish the game FEELS good, not just look good. MOBAs are a good example of this.\n\n- The story HAS to be engaging. It can be a short 10-15 hour story, but it has to hook the players till the end. Even if it means less side quests and collectibles. Sifu is a great example of a brilliantly done short game.\n\nBest of luck to you guys and you are doing an awesome job. Keep up the good work!",
    "super_thanks_amount": "₹500.00"
  },
  {
    "author": "@satvik4225",
    "comment": "We got GTA 7 before GTA 6",
    "super_thanks_amount": ""
  },
  {
    "author": "@anish_rao_05",
    "comment": "As a 3d artist, i salute you man ,it's a very difficult work on  3d scans and to make a really good topology out of it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Omkumar_Parmar",
    "comment": "No fake marketing, no fake hyping just pure suspense. Love the mechanics and the style. Indian style combat looks cool and that style move after parry of that attack . Hats off  8:27",
    "super_thanks_amount": ""
  },
  {
    "author": "@JainVinit-l4d",
    "comment": "7:45 dharavi ka vu-kong  , amazing work btw",
    "super_thanks_amount": ""
  },
  {
    "author": "@Suparna-o2h",
    "comment": "Can't express in words how much you inspired me today",
    "super_thanks_amount": ""
  },
  {
    "author": "@Nerdhaunt",
    "comment": "I don’t think people truly realize how massive this is. Sure, some might brush it off as half-baked or rushed but this isn’t just a plug-and-play Metahuman wrap. This was built entirely from scratch, and in just 8 months. That’s insane. Absolutely mind-blowing work.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Vihuthegreat",
    "comment": "Can't wait for the end result . Gonna buy this day 1",
    "super_thanks_amount": "₹40.00"
  },
  {
    "author": "@hiten1657",
    "comment": "We need these types of people to change the gaming community in India. The efforts they give in this project the dedication they showed about their work the team who are ready to face any challenges we can see all these in this video alone and absolutely the master mind who manage all these stuffs hats off for you man Really appreciate your work!!",
    "super_thanks_amount": "₹40.00"
  },
  {
    "author": "@funboys1000",
    "comment": "Plz dont make it black myth: wukong x GTA with Indian skin and props, you gotta have USP... India has rich History and culture to draw inspirations from. Good Luck",
    "super_thanks_amount": ""
  },
  {
    "author": "@ravisankar5099",
    "comment": "Varun you are speaking for every kid out there who used to play games from their childhood \nThis is what exactly I wanted to do when i was a kid\n( Even now to be frank )\nHopes are high\nBest wishes for pulling something like this off",
    "super_thanks_amount": ""
  },
  {
    "author": "@dheerajvaryani",
    "comment": "Proud of this, thank you for everything you do for India. You are so inspiring.",
    "super_thanks_amount": ""
  },
  {
    "author": "@GautamSingh-bk3cq",
    "comment": "The entire gameplay mechanic feels like a copy of Sekiro . From the lock-on system to the parry mechanics, everything screams “uninspired imitation,” and to make matters worse, these core systems haven’t even been implemented properly. The combat lacks fluidity, and the timing feels off, making it more frustrating than engaging. On top of that, the narrative continuity is completely absurd—how are we supposed to believe that an average Mumbaikar can suddenly pull off advanced Shinobi techniques? It completely breaks immersion and comes across as poorly thought out fanfiction rather than a grounded or coherent story.\n\nInstead of attempting to create yet another half-baked “Soulsborne” clone or trying to build the next so-called “GTA killer” without the budget, talent pool, or years of R&D that studios like Rockstar pour into their projects, developers should focus on originality and cultural depth. Take Raji as a shining example—a beautifully crafted game by Indian developers that authentically integrates Indian mythology and storytelling into its gameplay and visual design. It’s unique, rooted in our culture, and most importantly, it respects the intelligence and expectations of its audience. Rather than chasing trends or mimicking global giants, maybe it’s time we start creating games that reflect our own narratives, legends, and creativity with sincerity and innovation.",
    "super_thanks_amount": ""
  },
  {
    "author": "@aniket0625",
    "comment": "after watching gameplay video here are few things i've to say \n1. background is so good \n2. npc and boss design can be better and if they have few voiceline it could be better \n3. instead of using term shrine adda can be better term or maybe something like indian  (just my personal opinion )\n4.fighting style can be better like the way blood coming from after watching the video it didn't felt like it's made in 2024 or 2025 \n\nfor now i got nothing more to say i will edit if i got something to tell more about",
    "super_thanks_amount": ""
  },
  {
    "author": "@ShubhNe",
    "comment": "10/10 For the Efforts,I have been on hopium for so long, hoping that someone will take a step for the industry. I hope you are the one who can actually make this happen.\nBest of luck",
    "super_thanks_amount": ""
  },
  {
    "author": "@Zero1byZerodha",
    "comment": "Congratulations Varun and team, quite amazing we have the capability to do this.\nLooks world class",
    "super_thanks_amount": ""
  },
  {
    "author": "@DirectionGaming",
    "comment": "Art Direction is completely missing & Lighting is bleeding. \n- Assets don't look good without good lighting. it's okk for solo. if have a team 1 of them should be Lighting Specialist.\n- somehow all colors are looking washed out. and looking unlit.\n- Environment interactions are completely missing.",
    "super_thanks_amount": ""
  },
  {
    "author": "@moosclesapex4643",
    "comment": "Not gonna lie, the game looks \"rushed\". its just been 8 months, why rush in to building everything. You should be more focused on creating the best scans, best assets, getting better character design. Don't rush it",
    "super_thanks_amount": ""
  },
  {
    "author": "@arjunsuresh6154",
    "comment": "Congrats to the entire Aeos team! THIS IS A MASSIVE BREAKTHROUGH FOR THE INDIAN GAMING INDUSTRY",
    "super_thanks_amount": ""
  },
  {
    "author": "@omkarchoudhuary3803",
    "comment": "It's truly inspiring to see someone go to such great lengths to build something out of pure passion especially when it's not a mainstream path in India.",
    "super_thanks_amount": ""
  },
  {
    "author": "@induprombordoloi9527",
    "comment": "I have nothing to criticize. I'm just glad someone from India is entering this lucrative industry and making a game that shows Indian culture and history. I'm really excited and my best wishes are with you and your hardworking team",
    "super_thanks_amount": ""
  },
  {
    "author": "@ShinAkuma",
    "comment": "\"Super High Quality\" in the title has the same energy as \"Superpower by 2020\"",
    "super_thanks_amount": ""
  },
  {
    "author": "@vinamrajha",
    "comment": "REVIEW AS A GAMER:-  As a hardcore gamer who has played almost all top-tier games. I am not sure about what you mean by the term \"Super High Quality\", as the game is not high quality at all. I was shocked with Intro, the surroundings looked quite realistic but when it comes to actual characters it just looks like two games combined in one. The surrounding seems like from a top tier game while the main character and playable part looks tbh, very Average. The music and sounds are fine. The type of game you chose, the story line felt very outdated, games storylines matters a lot now a days and this doesnt give a reason for me to play. \n\nReview as Viewer: Now those were my feedback as a gamer, when i see it practically, this is quite commendable to be making a game in just 8 months while having a team of 40 people is no joke. The top games in the industry takes years and years, so congratulations on that. The FPS was not good in the game but i do understand its just a demo of early stage game, so it will be obviously be improved a lot in next couple of months. Hear me out, if possible please use the components of this game and recreate the storyline, something modern, something creative, take your time and if possible ditch this game and make something entirely different, this game is bound to fail with this storyline and characters like these. Get over Mumbai and Slums. \n\nWill i play? : Answer is Maybe, depends on the price and only bc its been made here and i want to support them. I wont even have a thought of playing it if it wasn’t bc of that. I dont like the storyline, dont know why but i have seen too many games with the same storyline from India, there is no chance it will get global recognition organically without your personal image being combined. The games are mostly played by Genz and lower but this game isnt modern, not something that attracts me, maybe 30+ age group might give it a go. We need to support this industry but true feedback is required, and i can see the so much of jingoism in the comments, true feedback is not there. India Needs to get over these kind of Storyline bring something different, something that Raji did!",
    "super_thanks_amount": ""
  },
  {
    "author": "@asifbarlaskar1159",
    "comment": "A suggestion: increase the enemy proximity area detection- for instance: here only when the protagonist gets really close, the enemy characters engage in combat, u could reduce that to much further length, or even chasing the protagonist in combat after being attacked.",
    "super_thanks_amount": ""
  },
  {
    "author": "@AmitKumar-yt4yz",
    "comment": "Dude created dark souls indian version",
    "super_thanks_amount": ""
  },
  {
    "author": "@TamilSelvan",
    "comment": "Congratulations.. finally someone doing it instead of just talking.   All the best Varun & Team . This is a big inspiration.  You keep rediscovering the limits.  Keep rocking.",
    "super_thanks_amount": ""
  },
  {
    "author": "@divyeshpatro6915",
    "comment": "Hats off to you, Varun, for this incredible achievement! When I first saw the poster for Project 11A, I assumed it was another creator-led tech product something we’ve seen many times before. But finding out that you’ve actually built a game completely changed my perspective. The teaser looks absolutely stunning! You’ve not only broken stereotypes but also set a new benchmark proving that building a high-quality game from India is possible. Truly inspiring,thank you for rewriting the rules and leading the way!",
    "super_thanks_amount": ""
  },
  {
    "author": "@GamesOfVaibhav",
    "comment": "This looks Amazing! More than a thousand custom assets are no joke! I can see the glimpse of your budget! All the best for the Roller Coaster Ride!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Taayjus",
    "comment": "Wow just watching you guys do this inspired me! Love to see someone else from India pushing out something cool",
    "super_thanks_amount": ""
  },
  {
    "author": "@sahapreetam",
    "comment": "Being in the vfx industry for 15 years, its refreshing to see Indian gaming industry evolving and people like you are trying to create something unique and interesting. I wish you a lot of success in this project and in future.",
    "super_thanks_amount": ""
  },
  {
    "author": "@arrshK",
    "comment": "I hope you are open to critiques coz oh boy i have a lot to talk about this!\n\nYou guys are aiming to set a benchmark which is already quite high with souls games and good AAA games (only comparing in your competing market) so it will be a really tough job to make this game ab ove par and i can see that you people gave done an mind-blowing job :D \n\nNow lets talk about the game itself...\n\nSince the footage we saw was the alpha build i wont be too harsh and not point the obvious.\n\nAssets: you said it yourself nothing for me to talk about. 10/10\n\nGameplay: The first thing i notices is that you took inspiration from both Black Myth Wukong and Sekiro (which you stated later) and i am really excited about it because i SALIVATE on sekiro combat! Yes some polishing can be done but lets ot talk about it. And i am assuming you got the Shrine and the over the top dodging animation from BMW and i really like it but the only problem that i can see with what we've seen till now is that the combat isnt as interesting... Sure the system itself is from sekiro but the combat moveset seems sluggish and limited. Thats all i can say about the GamePlay and combat based on what we've seen.\n\nNPCs: They look uncanny and very off, i would suggest looking into Yakuza Games and how they do it.\n\nStory: Since youve kept the story a secret i cannt judge the footage from it but all i can say is, citing Hollow Knight's Gametester \"everything needs to fit in the world, nothing should feel out of place.\" and i stand by this golden rule and this raises lots of questions in my mind. Why is the mc dressed like that? Why is the starting area is mumbai slums? why does the main character have an anciant sword while everyone else is using things similar to danda? Why are we fighting priests in the SLUMS? Why are we killing normal residents? why are the police involved? I would love the story to answer these questions and raise more!\n\nMusic: Pretty good! cant say further due to limited footage\n\nAaand thats it! Thats all what i have to say about the current state of the game that has been released to public. I am really looking forward to what comes next and making our nation stand out (in a +ve way ) in the video game feild :D\n\n- Arrsh",
    "super_thanks_amount": ""
  },
  {
    "author": "@harishpatil5618",
    "comment": "I literally felt Goosebumps at last moment in clip. \nAll the best to whole team.",
    "super_thanks_amount": ""
  },
  {
    "author": "@0xLostInCode",
    "comment": "Please don't make this an Indian super high quality game, instead make it a super high quality game that happens to be from India.\n\nMy point is, please don't make India and nationalism the entire personality and selling point of this game. Make the gameplay, story and lore the strong suit of the game. Take your time investing in creative side of things otherwise you'll end up with a overhyped game that is just all show but no soul.\n\nThis could be a huge step forward for Indian game dev scene if done right. I am cautiously optimistic.",
    "super_thanks_amount": ""
  },
  {
    "author": "@sparkestic1238",
    "comment": "Finally, Someone did it and made everyone realize its possible.  And Im glad its you.",
    "super_thanks_amount": ""
  },
  {
    "author": "@SouvikRg",
    "comment": "I was so sure you guys are upto something amazing! I saw your team doing the 3D scan of the auto. My mind was blown thinking how you guys put things together. Been really great following Aeos and thank you for breaking barriers and leading the way!",
    "super_thanks_amount": ""
  },
  {
    "author": "@SeverusSnape-M2119",
    "comment": "my jaw dropped, it was mind bogling, really proud of you man. great job varun.\n\ni felt that it was a lil bit kinda copy of black myth, but i can't say until it's released .\ni hope you will take it positively and make something great out of it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@adilmohammed7343",
    "comment": "This is perfect! Especially the character animation and the world. Hoping to play the game when it releases",
    "super_thanks_amount": ""
  },
  {
    "author": "@shubhambehl101",
    "comment": "As a game dev , game designer and on side a mentor for both. This is the video I am gonna recommend to my learners  . This is a kind of project that makes me feel excited . rooting for you guys lets see how far it goes .",
    "super_thanks_amount": ""
  },
  {
    "author": "@asadhusain97",
    "comment": "Love how you spent time introducing the team. Great work. Hats off!",
    "super_thanks_amount": ""
  },
  {
    "author": "@DigiLearnerz",
    "comment": "I hope this project serves as an inspiration for an entire generation of indian enthusiasts. Mind blowing job Varun and the team. Thank you so much!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Blank-10s",
    "comment": "Thousands of historic battles and legends, millions of years of rich history yet let us show the slums and streets of our country since mumbai slums is what tge people of India feel connected to",
    "super_thanks_amount": ""
  },
  {
    "author": "@mitejmadan8672",
    "comment": "I saw the notification on mobile, really glad that I opened this video on my 4k monitor. Really inspiring to see someone really raising the standards. The environment is crazy accurate",
    "super_thanks_amount": ""
  },
  {
    "author": "@manasgupta5106",
    "comment": "Bro was talking in machine language throughout the video. And we all still got it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@vishwjeetchavan4656",
    "comment": "Can't wait till 2026, the graphics on next par. Well done by the whole team, Let's make this one skyrocket the charts.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ayushmhaisne5698",
    "comment": "Finally a game from India 🇮🇳   \n\nFaug bhi 1 game tha but",
    "super_thanks_amount": ""
  },
  {
    "author": "@thilarcp1147",
    "comment": "Truly great! Congratulations Rishi Khanna , you have finally got what you deserve.",
    "super_thanks_amount": ""
  },
  {
    "author": "@NeelLateAtNight",
    "comment": "This man with this team will go down in history as a revolutionary new gen entrepreneur. Kudos man, can't be more proud",
    "super_thanks_amount": ""
  },
  {
    "author": "@tanishqrathore1678",
    "comment": "I really respect you man.. its soo damn great that you live life this way. \nOne day, i will work with youu and we will make something absurdly impactful and big.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ninaddeshpande4427",
    "comment": "As an avid gamer and a researcher in Optoelectronics, the way you scanned is so innovative that other AAA studios are not even thinking about. I would easily pay EUR 80-100 on this game just to see how it comes out to be",
    "super_thanks_amount": ""
  },
  {
    "author": "@rishabhsingh379",
    "comment": "Hoping for this to be a big success. You are my inspiration <3",
    "super_thanks_amount": ""
  },
  {
    "author": "@Sumedhsvijay",
    "comment": "Kudos!! , It's looking really great. All the best to you and your team. Keep the good work going",
    "super_thanks_amount": ""
  },
  {
    "author": "@ChintuiQOO",
    "comment": "This will be the 1st ever video to hit ONE million views. Congrats!! Entire AEOS team. Waiting for the fall.",
    "super_thanks_amount": ""
  },
  {
    "author": "@photons30",
    "comment": "Maza aa gaya ! people gave so much importance to environment , sound details, the garbage dump , shrine details , hair , body mechanics  damm all so good - it was a benchmark demo from here loved it. Excellent artist introductions - hardly seen here in India.",
    "super_thanks_amount": ""
  },
  {
    "author": "@manashghosh-ve7je",
    "comment": "Indians are always ready to support Indian game...we only need a good game...and it's finally here..",
    "super_thanks_amount": ""
  },
  {
    "author": "@Bhartiya4736",
    "comment": "That's incredible.....\nAlways supporting you Varun.... Keep doing.\nIndia needs people like u.",
    "super_thanks_amount": ""
  },
  {
    "author": "@anrdhx",
    "comment": "Congratulations, Varun! You and your team at AEOS have done something so incredible that most people thought couldn't be done in India. Really proud of you for not giving false promises and for setting the bar for quality even higher! Kudos to your team",
    "super_thanks_amount": ""
  },
  {
    "author": "@AbhayRajan",
    "comment": "Now that’s what I am talking about. Ws gang",
    "super_thanks_amount": ""
  },
  {
    "author": "@sayShankk",
    "comment": "This is literally crazy, the amount of details has been put is incredible. I could have never imagined that something as complex env like indian streets could ever be portrayed so perfectly in a game. Impressed man",
    "super_thanks_amount": ""
  },
  {
    "author": "@WisdomWings28",
    "comment": "Nothing short of inspirational \nCongrats and all the best to the entire team",
    "super_thanks_amount": ""
  },
  {
    "author": "@chronos1",
    "comment": "I can see that you guys have taken notes from Black Myth: Wukong, but that took 100s of people 6 years to complete! This. This looks amazing for something built in 8 months by just 40 folks. Insane work guys looking forward for the launch :)",
    "super_thanks_amount": ""
  },
  {
    "author": "@gample_dude",
    "comment": "Bro on serious note, add story, additional gameplay variances and other interesting environment along with environment story telling too.",
    "super_thanks_amount": ""
  },
  {
    "author": "@vinaydhareshwar8517",
    "comment": "This is mad good. What a level! The shadows, feel of it and the details are immaculate. Gave a feeling of God of war, Assasins creed and a few other games - just from the initial gameplay.\n\nFull support on this.  Proud of this. Keep on building!",
    "super_thanks_amount": ""
  },
  {
    "author": "@vivek_sheeel",
    "comment": "You're right now paving the way for well made Indian video games, hopefully this inspires gaming companies to invest more in Indian projects.",
    "super_thanks_amount": ""
  },
  {
    "author": "@theirritatedfreak",
    "comment": "Huge respect to you sir, making souls like game in India and the game setting is also indian. \nParry and slashing sounds are just satisfying...\nYou really got my hopes high!!!\nJust keep on grinding and take as much time as you want . Just make a game that makes whole India proud!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@lordofblood2024",
    "comment": "This is how to get the foreign market. Because western people love to see Indian slums that makes them happy and feel superior. Show slums and get the views. There are games like Hollow Knight, Hades, Stardew Valley and all. You dont need a big team or Insane money to build realistic games. Even 2-3 guys r enough to create history. Look at the game Balatro. \r\nAnyways I will appreciate the effort. At least a team from India is making a game which is enough to make me happy. Good job.",
    "super_thanks_amount": ""
  },
  {
    "author": "@AahanaSharma-y7y",
    "comment": "SO COOLLLLLLLL!!! Its impressive to see someone building stuff by not complaining but just doing it for the sake of doing it . Most people fear the potential of failure , so hats off to the courage you have to pull off something so cool without compromising on the quality . Also I love the fact that you decided to not give up on India and decided to do it here only  , proving change is possible .\nRESPECT",
    "super_thanks_amount": ""
  },
  {
    "author": "@luvsharma4636",
    "comment": "I personally love the amount of effort you guys have and are giving to this game, i seriously respect the work done though it's just a fraction of the actual game as said in the video but I think you guys will improve if it needs any. I want this game to be a huge success as I was so anticipated just like a lot others,hope it's compared with big games like God Of War, Prince Of Persia, Assassin's Creed,etc etc.\nsome suggestions I'd like to give \nmain menu should be given some work, physics, small details of the characters and hope the character's story makes really good connection with the player.\nGreat work, All the Best\nLook forward",
    "super_thanks_amount": ""
  },
  {
    "author": "@pragalbhsinha8679",
    "comment": "Just insane! This is pure curiosity and genius coupled into a great project. Hope it gets all the success!",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhishekak9619",
    "comment": "This is the game that will get the indian gaming community educated about marketing tricks.",
    "super_thanks_amount": ""
  },
  {
    "author": "@adityabikramchoudhury",
    "comment": "At Start I thought, You're launching Your own Game Engine ... But Then It's like, bro This looks So real... Then I remember You were hiring for 3D Modeling artists and Animators few months back, and saw Ocaus in Mocap Suit, that clearly shows it was something related to 3D Stuff, but It's a game at this quality. Koodos To the Whole Team , and Specially to Varun for Taking This Initiative ... Waiting for the Full Version, And few feedbacks, plz work more on Facial Animations and Contact details, they both look unfinished.",
    "super_thanks_amount": ""
  },
  {
    "author": "@nikhilgowda2540",
    "comment": "This is what India needs and all Indians needed.... Huge respect for your team.. all the best for the team",
    "super_thanks_amount": ""
  },
  {
    "author": "@hmanshu_p",
    "comment": "We need more such INDI games!! This is amazing. More power to you and team. Hope the actual release would be much refined and loved and cherished by all.",
    "super_thanks_amount": ""
  },
  {
    "author": "@mr.debasishdas",
    "comment": "Hey, this is just my honest opinion. I’ve been playing MMO and campaign-based games since I was 7, and it's really exciting to finally see a game that's actually based in India. I see a lot of potential in it and I’m really looking forward to the full release. The gameplay looks smooth, the BGM is nice, and the world design is amazing. The only thing that threw me off was the combat, enemy NPCs, and weapons—they don’t really match the mission areas. I think there needs to be more contrast, otherwise it might end up looking a bit mid. But that’s just my take. Still really looking forward to it—fingers crossed!",
    "super_thanks_amount": ""
  },
  {
    "author": "@tyroooooo",
    "comment": "Finally, we'll be seeing triple AAA games from India",
    "super_thanks_amount": ""
  },
  {
    "author": "@kingboy2334",
    "comment": "i generally don't comment but this work is really amazing, u are the really one of few creators i always wait for.",
    "super_thanks_amount": ""
  },
  {
    "author": "@G10-dt4md",
    "comment": "Congratulations to you and all of the teams involved.. directly and indirectly.. \nYou all are doing amazing work.. \nKeep it up ️",
    "super_thanks_amount": ""
  },
  {
    "author": "@InventorLS",
    "comment": "That's unbelievable, looks too good to be real for a indian game",
    "super_thanks_amount": ""
  },
  {
    "author": "@sageofsixpaths98",
    "comment": "13:14 even the \"Gupt Rog\" advertisement \nThis is brilliant guys. This is huge. Sadhu!",
    "super_thanks_amount": ""
  },
  {
    "author": "@shibanbanerjee",
    "comment": "My goodnessss !!! This is crazyyyy !!! The nerd in me is so happy today. An Indian game with graphics which can hold its ground against the western counterparts! Always wanted to be a part of a proper Indian RPG. Now that you are doing this, I would love to contribute in some way. \nSuper cool, congrats Varun !",
    "super_thanks_amount": ""
  },
  {
    "author": "@anushchandrashetty",
    "comment": "Great CGI!! But since it is an early build, please allow me to play the devil's advocate (coz I really want this game to be the definition of perfection):\n\n1. When the player slashes the NPCs, there is no visible wounds or blood stains spilled on the ground. Even on their clothes or the player's clothes!! Without inflicted wounds and tarnishes on the clothes, it seems to be just an objective and not an actual battle.\n2. Similarly, when the blood splashes on to the player, there are no visible stains either on his clothes or swords(maybe the sword can be ignored, as such fine detailing may not be visible even in 4K). We can have these blood stains on the player and reset them when the player heals near the shrine so that the clothes don't seem bloody all the time.\n3. The assets on Kshudita asura are not on his body, they seem to float (example the neck gold ornaments). Sometimes they seem to disappear and appear frequently as well when the asura is fighting the player.",
    "super_thanks_amount": ""
  },
  {
    "author": "@alapandas6398",
    "comment": "Hats off to the team. Really excited to get a hands on the game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@praphulyadavpvt",
    "comment": "Varun looks like a proud father walking upto the camera",
    "super_thanks_amount": ""
  },
  {
    "author": "@imal007",
    "comment": "Good job. Out of 1.4 billion people, one decided to try to catch upto China by getting motivated thanks to Wukong.",
    "super_thanks_amount": ""
  },
  {
    "author": "@pritamadakofficial",
    "comment": "Finally someone did this  hats off to the entire team  India!! India!",
    "super_thanks_amount": ""
  },
  {
    "author": "@abdulkabir7527",
    "comment": "Guys the fact that you did all of this in 8 months is sooo amazing, the detailing of env is sooo amazing yaarrr... I wanna join this dev team",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheWiseShinobi717",
    "comment": "Bhai one good advice - Produce the game considering in mind the target audience, which has almost these specs on pc:\nRam - 8gb DDR4, Cpus - Intel i5/i3 or Ryzen/5, and GPU: 2GB/4GB GTX 1650 or similar spec, sometimes even the gpu is not a dedicated one, like many people still use an \"iGPU\", and around 512GB HDD/SSD!\n\nGreat project btw!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Gupta.satyam",
    "comment": "Bhai salute you\nThe level of effort you are putting",
    "super_thanks_amount": ""
  },
  {
    "author": "@black-fb1hw",
    "comment": "\"Dharavi\" The prime city of our country  I mean a indian game has to be based on this city man. Thanks varun",
    "super_thanks_amount": ""
  },
  {
    "author": "@sayyamgibrani",
    "comment": "Love the Video \nThe Time+ Work you have put into this is amazing. Super proud to see something like this coming from India. \nAnd How you have showcased your team is amazing. You are helping break boundaries.",
    "super_thanks_amount": ""
  },
  {
    "author": "@pavanmukku6694",
    "comment": "Very nice man… good job… I hope you will achieve great success… All is Well",
    "super_thanks_amount": ""
  },
  {
    "author": "@hardeepdhull3793",
    "comment": "getting goosebumps, an Indian founder trying something new not just thinking about profit like big companies.",
    "super_thanks_amount": ""
  },
  {
    "author": "@TrulySujan",
    "comment": "Not a gaming geek but..\nI am just rooting for this guy no matter what.",
    "super_thanks_amount": ""
  },
  {
    "author": "@akhill3254",
    "comment": "I don't know if the comment section is being sarcastic. The game honestly feels and plays bad. Both the creators and the people in comments seem to be delusional.",
    "super_thanks_amount": ""
  },
  {
    "author": "@NitinBajajMOG",
    "comment": "This is insane, congratulations Varun and entire team. More power to Indian Gaming community.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Solving_Engineer",
    "comment": "The depth of detail, realism, visuals like 3d models, lighting, textures really  look stunning, like AAA quality. I think this is first game to completly use 3D- scanning for modelling. Congratulations varun. The character movements/ rigging of charaters looks kinda rigid, or maybe its because its a demo. Other than that everything looks great. \nSome of important factors that makes games great are great story and gameplay. I will hope you get that too . Wanna gets my hands on it. The urban environment looks stunning. Its like Visual fest.",
    "super_thanks_amount": ""
  },
  {
    "author": "@aadityagetme1357",
    "comment": "This was not at all expected but its so damn great,really cooked As a kid I always wondered why there are no ganes made in india but now i guess the wait is finally over .\nLoved it man just do it we will support you !!",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhinavupadhyay7929",
    "comment": "You just had to make it about religion...this whole approach is ass backwards..you think of a plot, story line and build maps, levels around it not the other way around ..there will be lack of flexibility because religion is involved!!...areas built similar to real life locations will not be intuitive for game mechanics..could have tried to include bosses monster inspired from mythology but direct connection and trying to tell a religious story through a souls like game feels wrong!! ..and because it's around religion no one will criticize the game!...and makes me doubt your intentions",
    "super_thanks_amount": ""
  },
  {
    "author": "@Guru_3210",
    "comment": "This kind of things strengthen soft power of nation, thanks buddy for strengthing our cultural",
    "super_thanks_amount": ""
  },
  {
    "author": "@penaazv",
    "comment": "From writing the descriptions for Unreal Engine tutorial episodes during Avalon Meta days to watching this world class production unfold - what a surreal journey it's been. MAD respect to the team! Worth the hype.",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhishekkumarsingh8833",
    "comment": "Game looking great  All the best to you and your team",
    "super_thanks_amount": ""
  },
  {
    "author": "@AMITAWAGHADE",
    "comment": "I like the environments. My question is why the enemies are civilians and cops? It's an early build so I expect them to add more environmental ambiance, birds, dust and most importantly, wind. Character, combat animations will be refined I hope. Cautiously optimistic about this project. I want this to succeed. Guys, take your time and polish it properly.",
    "super_thanks_amount": ""
  },
  {
    "author": "@bhaveshtiwari5783",
    "comment": "Been watching you doing a lot of stuff of the beginning I'm not surprised deep down you're also hard core gamer.",
    "super_thanks_amount": ""
  },
  {
    "author": "@shaswanthvemuri8340",
    "comment": "A big shout-out to Varun! You are one of the very few mad people out there who uphold extraordinary standards and deliver exceptional work, something only a small percentage of the population truly appreciates or understands the difficulty of. I believe in the effort you guys have put into the game, and I'm excited about the Modern-Gamified-Ramayan. I wish there were a way for people outside of Bangalore to have early demo access too.",
    "super_thanks_amount": ""
  },
  {
    "author": "@_.hrsht._",
    "comment": "One suggestion on the unlesshing of Avatar. \n\nI'd say, do it in certain levels. Like the form you showed while our MC was fighting that gigantic man is too over powered. For many people it might look a bit weird too. \n\nWhat can be done is, let's make 4-5 levels of transformation with power levels in ascending order. \nEg. \n1) Slight color change and two bracelets appearing on both of his hands.\n(This will be for fighting tougher individual opponents) \n\n2) A tiara type thing (which was shown in the video) appears oh his head and a locket appears. (His colour would remain the same as level 1) \n\n3) His shirt Vanishes and a few more ornaments appear. The colour changes completely. (This will be the most powerful form which he can control) \n\n4) The final form, \n(basically the one you showed entirely in the video) \nwhich he'll never be able to control properly, for that he'll have to undergo a lot of psychological, philosophical and mental training. \nAll the other forms will just be an incomplete invocation/manifestation of the final form. \n\nJust a suggestion tho\nKeep up the good work.\nCan't express my happiness towards the creative work.",
    "super_thanks_amount": ""
  },
  {
    "author": "@FBepicLegend-qc8fb",
    "comment": "Bruh , if u are working on a project this big that definitely means every would have high expectations form u ,\nWe have never seen a game with that high graphics before (in India ) so this will definitely be hyped \nBasically what am saying is u would be representing india thats a huge responsibility u know \nPls be assured that this game become the best game globally",
    "super_thanks_amount": ""
  },
  {
    "author": "@The8merp",
    "comment": "I can't imagine how much work went into designing those textures, but the backgrounds really captures the grit of Indian cities unlike anything I have seen before. The NPC attack movements and dialogues and noises could be improved a bit, Far Cry 4 is a good reference for this as it's set in fictional Nepal and uses Hindi for all the NPC voices. Amazing effort and I wish the best of luck to this team.",
    "super_thanks_amount": ""
  },
  {
    "author": "@aaravarora3520",
    "comment": "5:48 in the hair setting animation, move the elbow little inwards which will also induce a slight change of angle between the hand and arm, resulting in a way more natural animation. This scene is definitely going to get some fame!",
    "super_thanks_amount": ""
  },
  {
    "author": "@vedant_stone",
    "comment": "The game of course seems damn good!! There's room for improvement of course if you compare it with assassin's creed and stuff, but damn, it's a crazy start, it can easily hit that level if they keep working on it and latter versions would be so so much better. But the start, damn, it's a great start for an Indian Video Game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@souviksinha3624",
    "comment": "Hats off to you and your team man for your dedication and effort towards promoting India by making a world class AAA game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@RUDRAKSHPRATAPBHANJA",
    "comment": "5:05 tech burned",
    "super_thanks_amount": ""
  },
  {
    "author": "@Deepak-m9t",
    "comment": "Game mechanics: huge pile of epic shit \nThis type of early demo can be done in 4 weeks, he just fucking with you all",
    "super_thanks_amount": ""
  },
  {
    "author": "@shreyansjain3830",
    "comment": "The parry animation and assassination animation looked a bit off, but still can be managed. But my only concern is using Unreal Engine destroys optimisation if developers don’t put effort in it. And India has a lot of budget ballers and laptop gamers who need a optimised game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@notlegalfaqr_yt",
    "comment": "The moment the transition comes for the MC, It's just goosebumps!! Much love to this venture!",
    "super_thanks_amount": ""
  },
  {
    "author": "@antemedon",
    "comment": "This is a tech demo at best. It screams \"oh look, we have hardware and flashy lights\"",
    "super_thanks_amount": ""
  },
  {
    "author": "@Akshatjijaiswal",
    "comment": "The shadows,the trees,birds.Just wow. Everything looks way too good.",
    "super_thanks_amount": ""
  },
  {
    "author": "@DS00099",
    "comment": "I truly wish for your success in this journey but I believe a bit of criticism is necessary here. People from other countries often glorify only good parts from their cities and because we see those parts, We believe that’s the whole reality But the truth is, They have problems too, Just like we do.\r\n\r\nThe difference is, While they focus on showcasing the good, We tend to focus only on the bad. We believe we’re being truthful by showing the harsh realities and yes, that is part of the truth but then people start to think that’s the whole truth about us. It gives an incomplete and often unfair picture.\r\n\r\nAlso, you’ll never see trash being thrown near small temples in those places or temples being built next to open drains. That’s something you guys need to change because it's far from reality.\r\n\r\nWishing you all the best.",
    "super_thanks_amount": ""
  },
  {
    "author": "@sandeepk8121",
    "comment": "Looks awesome!! Looking forward to the release. All the best",
    "super_thanks_amount": ""
  },
  {
    "author": "@aniruddhav9523",
    "comment": "I'm at 8:03 rn, i dont like people trying to make AAA games based on india cause it's always bs but this one? i love it so far, i'm hoping it has a good story line too!",
    "super_thanks_amount": ""
  },
  {
    "author": "@powerbackro2232",
    "comment": "My suggestions :-\n1. i think you have to add intraction between assets and character. ( like RDR2 )\n2. And plz dont include that slum narrative of our country because that affect on global level .\n3. my favorite game based on india is uncharted legacy , the best story telling , and the best graphics .\n4. Please you hire best audio actors and hire a audio company also for game songs and envoirmental sound . \nbest wishes to your team",
    "super_thanks_amount": ""
  },
  {
    "author": "@singha__",
    "comment": "i can't imagine man, how much hard work physically and mentally you and your team put in the project  Kudos everyone",
    "super_thanks_amount": ""
  },
  {
    "author": "@rishitd.b8497",
    "comment": "We want a MYTHOLOGICAL FINAL BOSS and some crazy GOD'S Cameo...........ALL THE BEST team",
    "super_thanks_amount": ""
  },
  {
    "author": "@yashasvi1495",
    "comment": "This is the very first time I am seeing something new and fresh and not a copy of anything. This inspired me so much to do something new for my country too.",
    "super_thanks_amount": ""
  },
  {
    "author": "@divoplays",
    "comment": "6:11 Dammn bro...  Hats off to your whole team... W Visuals, Graphics , Every small detailling of slum area & village... 🫡",
    "super_thanks_amount": ""
  },
  {
    "author": "@bharatnair15",
    "comment": "All I hope is that you guys put the time and effort into game and level design. While visuals are important, they aren't the most meaningful part of the experience.\n\nI wish you only success!",
    "super_thanks_amount": ""
  },
  {
    "author": "@JinkslovesOP",
    "comment": "Holy fuckkk, the graphics , movement, ui , the sankat waala alert when fighting, you nailed it man",
    "super_thanks_amount": ""
  },
  {
    "author": "@siddhartharajputsingh",
    "comment": "Revolution is here .... great work team ...",
    "super_thanks_amount": ""
  },
  {
    "author": "@thecuriologist",
    "comment": "I rarely leave comments on videos, but this one truly moved me. It’s incredibly exciting and inspiring to see someone in India taking bold risks, managing resources wisely, and utilizing local talent so effectively to create a quality game.\n\nI’m definitely sharing this with my friends—it deserves all the attention! I genuinely hope the game becomes a huge success, and I want to support you all from the bottom of my heart.\n\nWishing you the very best!",
    "super_thanks_amount": ""
  },
  {
    "author": "@XaggyBoi",
    "comment": "another indian game based on slums of course.",
    "super_thanks_amount": ""
  },
  {
    "author": "@arjunyadav431",
    "comment": "Huge respect to the entire team! \nI usually never comment on videos, but this time I have to because I have never imagined an Indian game of this quality. I am seriously hyped for this; I mean, the game's surrounding background is amazing.\nAlthough I saw some flaws in it, like the facial expressions of the characters could be better, and the combat gameplay and hit reactions can be improved, I hope they fix these by the time of release. Props to the team for trying to do such a risky and hardworking project. I hope it will become a massive hit and a foundation stone for the Indian game development industry! \n I will buy this on day one",
    "super_thanks_amount": ""
  },
  {
    "author": "@user-pz3hy7jo7i",
    "comment": "I am not Gamer but I love your style of thinking different creating new job opportunities to Indian youth.we support you always",
    "super_thanks_amount": ""
  },
  {
    "author": "@Its_crute",
    "comment": "4:41 bro roasted anarc watch",
    "super_thanks_amount": ""
  },
  {
    "author": "@AyushYadav-st4kr",
    "comment": "Bro great work !\n\nBut things you that could make it even better\n1.) Classical traditional indian building\n2.) a better sky(not so bright) or tint like evening or bluish-pinkish\n3.) Also falling leaves winds, cool trees  would be good",
    "super_thanks_amount": ""
  },
  {
    "author": "@TechzPlays",
    "comment": "I'm Very Happy Finally getting an Indian game",
    "super_thanks_amount": ""
  },
  {
    "author": "@pinkusagar",
    "comment": "Considering the game is 60% done, the demo characters looks cheap, absolutely nothing cinematic about it. What kind of action is this ? You need to hire a good storyteller cuz the demo ain't conveying anything worthy of the wait. Go back to drawing board, hire a storyteller, an action director and ofcourse character developer, those characters in the demo don't look very interesting to me. Everything looks like you are building stereotypes for easy consumption of western audience. Think hard get some hardcore game players in and ask them would you play this game ?",
    "super_thanks_amount": ""
  },
  {
    "author": "@SyN_B",
    "comment": "Souls like game in a modern-ish setting doesn't suit  the genre I feel.\nIt would have been great if it was rather mythical",
    "super_thanks_amount": ""
  },
  {
    "author": "@sakshathsm20",
    "comment": "This is Sekiro man, I really hope and wish the whole mechanics weren't lifted from there",
    "super_thanks_amount": ""
  },
  {
    "author": "@iamvanshikapandey",
    "comment": "This is a dream come true. As a kid, I used to hope there was a game which accurately portrayed India a game which highlighted our rich cultures, beautiful landscapes, varied environments, and spectacular natural beauty. A game which fulfills everything from snow-covered mountains to green plains, clean rivers, and vast expanse of greens. It does not have to be 100% realistic to the world this can be a game of fun and creativity. A good story, breathtaking graphics, and a lively atmosphere would make it unforgettable.\n\nI recall thinking as a child, 'I will create a game that is famous throughout the world for its culture and beauty,' but I never quite reached it. To see this finally coming to fruition is just so fulfilling. Good luck to your team, I hope you make something truly amazing. Make this game a masterpiece!",
    "super_thanks_amount": ""
  },
  {
    "author": "@aaritranjanmaity5624",
    "comment": "I will come with this criticism. This game 'feels\" like ass. If graphics were the only thing that mattered then games like ultrakill would not have been so critically acclaimed. You are making a game not a movie, so focus on the gameplay mechanic first. Its choppy, sloppy, and doesn't feel fun. It's like those old phone game, space shooter and stuff, but with better graphics. \n\nHeres what I suggest, for player, make his swings sharp. By that I mean delete some frames in his animation so the swing of the weapon feels like a gun shot. To make it seem more powerful, some particle effects on hit can work. In souls like, victory over enemies must feel earned. So instead, try making enemies with a non subtle variety of attacks, and give them some characteristics. \nBy characteristics, I mean like imagine two different kind of enemies, a heavy guy and a light guy. Heavy guy's attack will be telegraphed, but he will attack strong. His defense will be High as well, and some change in sound effects may do the trick while fighting him (A feedback mechanism will be good too). The light guy will fight fast and will drain your hp if you are not quick enough. Do the same thing with his attacks as you did with the player. Heres another thing.\nI mean seriously, I can't really anymore more about this, but it feels like a 3d project rather than, well, a 'game'.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ash_ketchum_plttwn",
    "comment": "leaving this comment before watching, will edit this after watching. \nlfggg ️\n\nok so edit 1 : \nwaiting for the day when my potato laptop can run it",
    "super_thanks_amount": ""
  },
  {
    "author": "@ryokorp5393",
    "comment": "Good idea but here are some suggestions:\n1.Gameplay straight up looks like sekiro shadows die twice. Its not a bad thing but innovate on the idea. \n2. Remove the shrine thing. Add temples/mandirs instead, see ? Some simple tweeks here and there would solve the problems but those tweask should be innovative or creative imo.\n2. Dont make the combat souls like if that was your vision initially or is now after i have seen everyone sayin the enemies should be aggressive or something.yess the enemies should be aggressive but the gameplay shouldnt be relying on fast movements like sekiro but a mix of gameplay complexities and fast movement. By gameplay complexity i mean rpg elements that enhances your character in unique ways. Keep it balanced for a engaging yet challanging combat. Gameplay>>> graphics just dont try to make this a souls like pls \n3. Doesn't matter if the game is of 20 hours or 10 but dont make the things repetitive. Always keep adding new things as the game progresses and not the in the spoon feeding way but keep it just this much open so it allows a sense of discovery, kind of like botw tofk. Actually it would be very fun and interesting to have a botw tofk kinda game from india that doesnt go flashy with being a aaa game but just stays fun, engaging yet challenging. I hope you crack the code, you are doing great bro!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Ayzn22",
    "comment": "As an adept Indian level 3D character&props artists this start puts a smile on my face.Some things don't make sense thought and scanned model are heavy on first place,the release is true early,and why's there buildings in background.",
    "super_thanks_amount": ""
  },
  {
    "author": "@cyberwolfron980",
    "comment": "11:55 what?! You blocked out an entire town?",
    "super_thanks_amount": ""
  },
  {
    "author": "@senseiscavern6140",
    "comment": "why does this game look like some sort of asset flip, this doesn't feel unique at all, its mechanics look  clunky, this tries too hard to be a soulslike , but cant achieve that feeling. the creators should take more time developing this, and should really focus on the artstyle,optimization , combat and most importantly details( environmental details) they really shouldn't rush this. they may initially get money but in the long run this will be another forgotten and laughed upon fau-G type game",
    "super_thanks_amount": ""
  },
  {
    "author": "@vr.collectionseries37",
    "comment": "Bro i didn't expect this what did you made ... A masterpiece 7:07",
    "super_thanks_amount": ""
  },
  {
    "author": "@sanathoikhwairakpam5",
    "comment": "A game that would change india gaming market. For us pc gamers its a proud moment. Good luck and we will be joining the journey with you guys",
    "super_thanks_amount": ""
  },
  {
    "author": "@Crystal_Ninja_",
    "comment": "Intentionally or unintentionally The game play looks like a copy of sekiro",
    "super_thanks_amount": ""
  },
  {
    "author": "@blaze26700",
    "comment": "10:42 it needs more work to do but it definitely has potential. \nThe quality and gameplay is definitely not on par with AAA titles. \nBut I'm hoping you people will pull it out somehow. \n\nI am very excited to play this game in future",
    "super_thanks_amount": ""
  },
  {
    "author": "@debanganchakraborty117",
    "comment": "Great work done by the team! But why does some of it feel like Sekiro? Though it's the alpha build, animations and combat mechanics can be much better. You have the time, please focus on improving the game mechanics and story more than just the graphics. Also judging from the graphics (with probably further enhancements in the future) it looks like this game would be heavy hardware demanding (maybe RTX 40 or 50 series GPUs at bare minimum). Please optimize the game so that a large number of players with mid range rigs can also get interested in buying and playing the game. \n\nGames like black myth wukong are kinda play once type of game because their only objective is to deliver an immersive story. UTA's development should also be more biased towards the story imo so that it becomes a successful launch.\n\nPlease consider this as a small piece of suggestion from a gamer's end. Rooting for UTA's success!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@eshaanitrate",
    "comment": "Yooo this looks so cool!! that switch-up literally gave me goosebumps, love that we are also gonna have our own Sekiro soon :D",
    "super_thanks_amount": ""
  },
  {
    "author": "@scienceinoneshot1693",
    "comment": "I love the animation and graphics, but the quality of characters is very low. It would have been awesome if they look better, right now they resemble closer to cartoon",
    "super_thanks_amount": ""
  },
  {
    "author": "@nullprophet10",
    "comment": "so you bought a  bunch of assets and threw them in unreal engine. i''ve seen kids make better shit than this",
    "super_thanks_amount": ""
  },
  {
    "author": "@shukmoghe5942",
    "comment": "Not to hate! I know how hard game dev. is, but selling this as a 'Super High Quality Game' is a HUGE Reach. The game quality is barely better than the G-one Game from 2006. the movements seem copied from other prominent soulsborne games. I have no expectations of decent dialogue given how India treats voice acting as a career. It is good that you made an effort. But you on thin ice mate. You went for the hard sell and now you gotta deliver.",
    "super_thanks_amount": ""
  },
  {
    "author": "@pulsestar1053",
    "comment": "Nice bro. Finally India ka game hoga. From mumbai myself so I relate to the surrounding background of the game",
    "super_thanks_amount": ""
  },
  {
    "author": "@tat_smilyboy6518",
    "comment": "Hi Varun/Aeos, \r\n                         I am Darahas just finished watching the video. As i was watching it all I could think about while watching the stream was that thanos meme \"I will do it myself\". As an aspiring indie dev you are in a way laying the road for me.\r\n                         \r\n                         As for the suggestions:\r\n\r\n1.Take your goddamn time: NO ONE is rushing you take another year atleast postpone the game when you have a great product done the only thing you need to do is refine it.\r\n\r\n2.Animation: I think you might heard of the uncanny valley effect. The faces in the game are close to it also I have noticed there are no facial movement or expressions. The animation where the main character brushes his hair is awful. Animate th hair please. \r\n\r\n3.Price: As you know India is a price sensitive market as a broke colledge student who loves games I will come cleanand admit that piracy is the only way I can afford to continue my passion. Make sure that it is not over 400/-\r\n\r\n4.Game design: You know it. I know it. And my dogs also know it. You copied/took inspiration from fromsoftware. I understand even Wukong did it but please add something new to it. Im jus ranting so take it with a grain of salt. THE SHRINE SYSTEM AND GRACE SYSTEM IN ELDEN RING IS LITTERALY THE SAME. I don't want any foreign youtuber to say that it is a cheap copy of \r\nSeikiro. As the avatar system has not been revealed I would not take this seriously\r\n                         \r\n                         I would like to end this by saying that you are doing god's work and dont mess this up",
    "super_thanks_amount": ""
  },
  {
    "author": "@evilhuntgaming835",
    "comment": "Game looks good, But here are some suggestions: \n\n1. While running the motion of character looks stiff. (looks like upper body especially the hand holding weapon is still and only legs and left arm are moving, the animation can be improved, \n\n2. The parry mechanism needs improvement, at 8:03 when our character blocks mace, it does not looks accurate(logically considering size of boss and his weapon vs our character in its normal form, once our character turns into an avatar, then some more enhanced mechanisn can be used there) \nfor 1 & 2 you can take inspiration from Ghost of Tushima\n\n3. The interaction with shrine feels very fast, its like just a press of button and nothing much happens on screen which does not provide the sense of achievement for completing a part or mission. The interaction can be improved at shrine. (I know you took some reference from Black Myth Wukong and balancing it from Indian religion Pov without hurting any section of society will be challenging)\n\n\nother  suggestions: \n\n1. Performance optimization for low end devices (many of my frnds still use their 4-5 yrs old laptop with specs like  - i5 8 or 9 gen, 8 gb ram, Nvidia 920MX, 930MX or 1050. And even with high end machines I have seen people avoiding to push their machines to max as the laptop generated too much heat and GPU/ GPU temps are above 90 and and fans make too much noise. So despite the hardware is able to run game on high/ ultra setting people play on low/ medium setting on laptop ( key reason is they can't afford to change/ upgrade machines every 2-3 years, and they want to last it as long as possible)\n\n2. Keeping the names of characters/ items in game a bit simpler but keeping the Indian touch and easy to pronounce especially for audience outside India as to make this project financially successful as well, a major contribution might come from other high income countries as disposable income and pc penetration in India is very low.\n\nAll the best for your journey, India definitely needed something like this",
    "super_thanks_amount": ""
  },
  {
    "author": "@geodudeop",
    "comment": "lets be honest guys this game looks like avg 3d render.. not worth the hype people are actually giving \nit will not be  playable by most indians.. instead of making 'the most high quality' they should focus on 'content', \nthey are  just marketing it as 'India's' and providing any avg game plot...",
    "super_thanks_amount": ""
  },
  {
    "author": "@theshubhamydvplays",
    "comment": "Thank You bhai! On the behalf of whole India",
    "super_thanks_amount": ""
  },
  {
    "author": "@dbzkid3071",
    "comment": "Another pathetic  black myth wukong clone with the art direction of a potato and combat that looks like it was made for mobile phones",
    "super_thanks_amount": ""
  },
  {
    "author": "@dannydohma6808",
    "comment": "Generic artstyle looks bland, terrible art direction",
    "super_thanks_amount": ""
  },
  {
    "author": "@asd-bl5ur",
    "comment": "why is it so choppy feels like 20 fps",
    "super_thanks_amount": ""
  },
  {
    "author": "@sparrowera",
    "comment": "man the graphic  the player moves looks seek!!!  i hope this game will be a banger",
    "super_thanks_amount": ""
  },
  {
    "author": "@pranavpprasanth9790",
    "comment": "I see a lot of sekiro influence... not downplaying your work and effort... but the mechnaics feels very similar to sekiro.... Would personally love to see more unique mechanics. and Please no more slums. slumdog millionaire was almost 20 years ago...",
    "super_thanks_amount": ""
  },
  {
    "author": "@chiruchintha",
    "comment": "video starts at 3:00",
    "super_thanks_amount": ""
  },
  {
    "author": "@aakashsensharma7675",
    "comment": "Feels like a cheap sekiro copy. I want Indian game studios to thrive, but copying concepts blatantly won't work.\n1. The posture bar is a straight copy from sekiro\n2. The danger symbol on unblockables is exactly like sekiro too where a danger kanji is flashed before the attack.\n3. The block and hit upon critical state is exact copy of sekiro.\n4. Shrine with rest and travel system -- blatant copy\n\nNothing original has been presented in the showcase and I don't see a reason for the game to exist. \nDon't know why the dude presenting is so proud of what they've done.\nI know it's an alpha but none of the movements are polished and seem out of place.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Rajjuo-bz1en",
    "comment": "I just randomly came across your video and boy oh boy, i must say, the graphics, the gameplay is looking really good in terms of it's made here in India but not by any big companies....hattsof brother. Also, the way you're trying to give and show the essence of Sanatana Dharma through your game to all the people despite of their religion is another thing which needs to be commended. Keep it up, this is just the beginning. You will reach even higher heights in life.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ErikBerg666",
    "comment": "The game looks awesome. I wish you all the best for the development. Just a piece of advice, hope you take it in positive sense : @8:08 The villan with 'tripund' on his forehead, depicting a brahmin priest as asura looks very anti-Hindu. (Maybe you might have got inspiration from Ravan, but Ravan had a entire backstory to justify he is brahmin, but you will not have the time to depict an entire story of the villain in the game apart from casual appearance). People who might be saying on my comment - You are making a fuss out of nothing, try depicting the villain as a stereotypical Muslim Maulana with his beard, no moustache, a skull cap and a netted vest.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Barnito-m7w",
    "comment": "It is great that someone is doing something from India, but this is not high quality at all. The foliage comes off as a bit unrealistic because the artist used assets from Megascan without considering where each plant fits best, making it feel a bit disconnected. Some realistic, hand-painted foliage could bring it to life! Also, the character movements in combat could use some tweaking. The lack of eye movement and facial expressions makes them feel less engaging. Plus, the hair design seems to need some improvement, and it’s a little odd to see characters floating and not having any footprints. I am not against it, but it looks like a bunch of rookies created it because there are so many problems. In the end, I hope they fix all the mistakes and create a better game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@DynamicGamingDuo7",
    "comment": "This looks pretty shit compared to Raji, wtf do you mean by first high-quality game?",
    "super_thanks_amount": ""
  },
  {
    "author": "@lightbringer6436",
    "comment": "Although the game is great , please make sure not to add too many bosses being like a evil brahmin. Also hopefully its not like gta where you need to kill , rob and steal things. Though it might be fun, but if you hit big and lakhs play the same, it will impact society negatively as seen in american gun killings. \nQuick idea : 1) how about showcasing ancient indian weapons?\n2) how about treasure hunting concepts?\n3) how about getting random luck when prayed in shrines?\n4) bosses becoming allies?\n5) how about random boosts for cleaning things like trash ?\n6) how about a tree to learn moves shown in indian martial arts\n7) also adding a feature to get random luck for planting trees ? Like as the tree grows the fruits and leaves give boost or the flower and leaves offered at shrine gives blessing? Also a stack of receipes of it?\n\nThats all",
    "super_thanks_amount": ""
  },
  {
    "author": "@Asahi_991",
    "comment": "That looks like shit. We should focus on cows. As indians we can't do anything more than cow science.",
    "super_thanks_amount": ""
  },
  {
    "author": "@arjunvarmamaths1349",
    "comment": "Very good, 80% of footage is slums, dust, shit..\nForeigners can easily identify that this is india, well done.\n\nThat is unique to india.\nThat's what foreign media do\nThat's what we do too..\n\nKeep it up guys",
    "super_thanks_amount": ""
  },
  {
    "author": "@neetinsharma919",
    "comment": "5:00 no tech burner got burned in this shot.",
    "super_thanks_amount": ""
  },
  {
    "author": "@memesboy2198",
    "comment": "Brother please learn from the mistakes of mumbai gullies and make it for world . we can even wait for 3-4 years but it should be incredible and something which can represent india ..lots of love to you",
    "super_thanks_amount": ""
  },
  {
    "author": "@YashMinesXD",
    "comment": "bro this is very good i like the concepts you are doing such a great job for our Indian gaming community but a little request from your fan\nat time stamp 11:22 the Jain Idols or the Tirthankara please they are the sign of non violence as we strictly does not support violence so please if they were gona add in the game and if there is any violence kindly please remove the Idols and the Temples just a humble request no hate to anyone , love you  again you are doing  a great job",
    "super_thanks_amount": ""
  },
  {
    "author": "@RayEn-kk1nz",
    "comment": "It's bad they have just complete copy pasted from different games and why are they showing slum or poor cities \nI mean every country want to stop not show these things instead want to show rich culture like wo kong but they are stereotyping the game \nIf world is set in modern india them show modern india will some indian aesthetic \nIt's bad and i think it's just cash grab\nWe have played many AAA game and if i want to buy this game then i need solid reason give them my 1000 rp or any price they will decide",
    "super_thanks_amount": ""
  },
  {
    "author": "@kyubhi",
    "comment": "So this is what u call international standards?? Really sorry to say but not very impressive .. It looks like we downloaded a indian texture pack onto wukong \n\nWell its good that u are trying to make smtg .. But dont fool everyone with high quality textures come up with an unique story an actual usp not just the old slum, asura, police tropes",
    "super_thanks_amount": ""
  },
  {
    "author": "@shivambanerjee1014",
    "comment": "Please keep the price and pc specs reasonable for indian players. We would loveeee to buy and play this. Our bharat’s first aaa title.",
    "super_thanks_amount": ""
  },
  {
    "author": "@PavanKumar-vt8sh",
    "comment": "6:52 one of your clients would not be happy",
    "super_thanks_amount": ""
  },
  {
    "author": "@chantelsopio5826",
    "comment": "When you add  \"India\" to something, it automatically means downgrade",
    "super_thanks_amount": ""
  },
  {
    "author": "@nishanthipparagi6245",
    "comment": "Honestly disappointed with how India is shown here. India is much more than slums and pothole filled roads. All this is going to do is strengthen the western propaganda which constantly try to downplay India as a third world country. Hope you guys show India in a better way and show a new perspective of developed and culture rich India.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ath-c4q",
    "comment": "I m glad that someone in India is doing this.",
    "super_thanks_amount": ""
  },
  {
    "author": "@itsmohdmustafa",
    "comment": "Looks bland asf. No art direction",
    "super_thanks_amount": ""
  },
  {
    "author": "@sudhamjayanthi",
    "comment": "5:13 damnn that was a real move!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Asahi_991",
    "comment": "This isnt a soulslike . Dont disrespect from software. This is shit.",
    "super_thanks_amount": ""
  },
  {
    "author": "@utkarshmishra7574",
    "comment": "Instead of diving straight into full-blown AA or AAA Souls-like games, Indian studios should focus on creating smaller, well-polished titles. This approach would help them gain valuable experience in game development, distribution, and finances, otherwise Indian games will never take off.\n\nAnd what is this obsession of cringe-worthy, Bollywood-style characters and stereotypical storytelling. It’s time to break free from these clichés and start creating original, thought-provoking content that reflects creativity and innovation rather than tired tropes.",
    "super_thanks_amount": ""
  },
  {
    "author": "@LOL-h8h",
    "comment": "9:28 youtubers ko kya ho gaya hai iss saal koi itna crazy game bana rhaa hai koi crazy headphones bech raha hai",
    "super_thanks_amount": ""
  },
  {
    "author": "@schnitzel_enjoyer",
    "comment": "wtf is this? Indian Gollum?",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhinavamrute",
    "comment": "8:19 This reminds me of Prince of Persia",
    "super_thanks_amount": ""
  },
  {
    "author": "@gyanvatsalswamifanclub",
    "comment": "Buddy now the World watch what india can do. Huge Respect bro",
    "super_thanks_amount": ""
  },
  {
    "author": "@ani_at_aiims",
    "comment": "11:13 gupt rogi milein",
    "super_thanks_amount": ""
  },
  {
    "author": "@thefinancialfixer",
    "comment": "Why that character looks like varun great work bro I loved this and hope I get this game....on my PC as soon you release the game love you bro you really inspire me",
    "super_thanks_amount": ""
  },
  {
    "author": "@ooogabooga5111",
    "comment": "This game literally makes no sense",
    "super_thanks_amount": ""
  },
  {
    "author": "@DhavalShukla",
    "comment": "This is awesome. The characters and interactive entities and actions do need massive work but the environment itself has been rendered beautifully. This is amazing. Would love and encourage you to go crazy and go all the way with anything and everything that you think is needed to make it in your best vision and you'll definitely find the backers I am sure of it!",
    "super_thanks_amount": ""
  },
  {
    "author": "@RAGHUVEEROP",
    "comment": "Sekiro  wukong copy movement",
    "super_thanks_amount": ""
  },
  {
    "author": "@krishnatagore5750",
    "comment": "I appreciate that Indian games are coming. But this is just sekiro rip off with indian assets. Its not wrong to take inspiration from another game but should not copy the whole thing exactly. Like shrine as a checkpoint, sword seems like katana movement, death blow looks like owls mikiri counter, the word appearing on screen when a serious attack is coming, posture bar etc etc. Black myth handled the game mechanics properly to get a souls like feel. Here I am pointing about only game mechanics not graphics.\nIf you want to stand out in the world, honestly with this its impossible. You need to reformulate the game mechanics again to make it different from other games. Even top tier graphic games fail due to poor game mechanics. I am not blaming about graphics which I can understand with small team you are building but you also need to change the art style to be good. But biggest priority should be game mechanics improvement. Honestly you will receive a lot of hate from hard core fans of souls games. The people in comment section are not aware of this and hence supporting. I have no right to judge you, but I am suggesting you because I want Indian gaming industry to thrive and this game at beta stage. So it can still be improved . Wish you all the best!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@suyashalva2452",
    "comment": "feels like a scam",
    "super_thanks_amount": ""
  },
  {
    "author": "@MrJayvj",
    "comment": "Heck Yes!!!!! , im so happy to hear about this!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Anime_Adventures12",
    "comment": "Cheep copy of black myth wukong",
    "super_thanks_amount": ""
  },
  {
    "author": "@EkSherRoj",
    "comment": "Danda fight with talwar 6:42",
    "super_thanks_amount": ""
  },
  {
    "author": "@sudhamjayanthi",
    "comment": "4:47 LMAO he did the same thing at private demo",
    "super_thanks_amount": ""
  },
  {
    "author": "@bilhary2148",
    "comment": "I feel  genuinely Good work 1st time in India game industry, I proud of it, our indian gaming industry growing and good working lovely",
    "super_thanks_amount": ""
  },
  {
    "author": "@arastutomar40",
    "comment": "Indai games - let's show sum slums and then beg for respect from foreign countries",
    "super_thanks_amount": ""
  },
  {
    "author": "@knightslares3352",
    "comment": "That's so disappointing gameplay demo i have ever seen... sorry but you need more budget to create better mechanics & details.",
    "super_thanks_amount": ""
  },
  {
    "author": "@princekumarrollno.3093",
    "comment": "Sasta sekiro shadow die twice",
    "super_thanks_amount": ""
  },
  {
    "author": "@shouryasharma7134",
    "comment": "GREAT STUFF MAN I WISH YOU ALL THE BEST!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@cyberwolfron980",
    "comment": "7:56 you portrayed our pandits so wrongly here, it was completely unnecessary\nAll I'm seeing is an incoming lawsuit and a ban lol",
    "super_thanks_amount": ""
  },
  {
    "author": "@singamonline",
    "comment": "3:01 Very excited from தமிழ்நாடு",
    "super_thanks_amount": ""
  },
  {
    "author": "@MayankNagle",
    "comment": "Thane ki Rickshaw spotted at 7:12",
    "super_thanks_amount": ""
  },
  {
    "author": "@2SBGAMING",
    "comment": "Really happy to see people are trying to start Indian startup in gaming. I really like the early looking game and I hope it will be good as it progress.. I just wanted a real India not a stereotype India and we had good devs lets make a good one. cant wait to try",
    "super_thanks_amount": ""
  },
  {
    "author": "@gladiatorking6294",
    "comment": "Did you even play a Dark Souls  game \nHow the hell are you compared with a Souls game this is bull shit \nDon't scam Indian gamers with playing with their emotions",
    "super_thanks_amount": ""
  },
  {
    "author": "@PavanKumar-vt8sh",
    "comment": "3:34 YouTube in the corner",
    "super_thanks_amount": ""
  },
  {
    "author": "@AnUnknownAsuraScrolls",
    "comment": "Imagine getting Rs.14,290 and view count as Rs. 10095.81 from just one video about an alpha version of one game\nHats off to you Mr. Varun\nEdit: And so, The Game quality is as if you recorded india with a 5K UHD High Reso. 360` Rotational Camera",
    "super_thanks_amount": ""
  },
  {
    "author": "@rajaththakur4234",
    "comment": "it looks great we can see your hard work...great work.. best of luck",
    "super_thanks_amount": ""
  },
  {
    "author": "@Chotukc007",
    "comment": "Optimization will be the real challenge. Good luck!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Jaaay-2007",
    "comment": "Ever since the lockdown i wanted to make a game a AAA title game for 2 years using meta human creator and UE 5 , I failed to do so but now its good to see that times are changing for India's game development industry",
    "super_thanks_amount": ""
  },
  {
    "author": "@thetejasagrawal",
    "comment": "This is beyond amazing! The alpha build footage looks promising. As a person who started as a game developer, this feels very at home and I love that finally someone is taking game development seriously in india to a level that, since a very long time was termed to be a western thing. Congratulations to the entire team and can't wait to see this in action!",
    "super_thanks_amount": ""
  },
  {
    "author": "@bb_alternate",
    "comment": "bhai ne to mehanat kiya hai lekin ye na ITS NOT SOMETHING NEW tikhe India me hi, maine review videos dekh liya hai, aur sab na marketing strategies hai bas, bada aya shanne banke.",
    "super_thanks_amount": ""
  },
  {
    "author": "@SassyPuffyBear",
    "comment": "this is actually awesome man best of luck!!! i'm excited about this!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@_.RUDRA._",
    "comment": "This will be revolution in India gaming industry it will surely change the scene of indian gaming globally",
    "super_thanks_amount": ""
  },
  {
    "author": "@reanozeon9459",
    "comment": "This looks really Good ! Well .. Something really good coming from India .. Appreciate it !  Well I am here in Romania right now and watching this !",
    "super_thanks_amount": ""
  },
  {
    "author": "@rahulreddy2155",
    "comment": "India has so much potential to create really good stories from the varies mythology and folklore we have, really excited to look at the end result",
    "super_thanks_amount": ""
  },
  {
    "author": "@adityaraj2373",
    "comment": "Its a myth now , 10years ago we do not buy the games rather used cracked version but now everyone who play game are easily spending on games sometimes to buy skins too.Means is high time Indian are ready to pay for games too, there are billions of dollers Gaming industries waiting",
    "super_thanks_amount": ""
  },
  {
    "author": "@cezanne3D",
    "comment": "love the idea here. but the typical game violence is kind of boring. I think we're evolving as gamers to experience something way more mythical and magical than a game with an avatar holding a sword. Love how this opens up so much more in the Indian 3D game space! Congratulations on your journey and coming so far, would love to see how this evolves! : )",
    "super_thanks_amount": ""
  },
  {
    "author": "@durgeshchore8665",
    "comment": "I'm sorry but feels like 70 percent like sekiro game if you played that game you will know, if you guys prove me wrong I will be more than happy, in the end I want to support the indian gaming industry",
    "super_thanks_amount": ""
  },
  {
    "author": "@jolly397",
    "comment": "90% unreal engine 5 and publicly accessible assets , 10% any contribution from your team whatsoever , amazing stuff",
    "super_thanks_amount": ""
  },
  {
    "author": "@chiragbalani7719",
    "comment": "All love and more appreciation. You guys are the disrupters!",
    "super_thanks_amount": ""
  },
  {
    "author": "@301Raptor",
    "comment": "Big respect to Aeos Games for taking Indian gaming to the next level! \n\nThe visuals, story, and overall idea behind Unleash the Avatar look amazing. \n\nIt's great to see a game based on our culture with such high ambition. \n\nWould love to see more details on the gameplay, how the combat works, NPCs, and how the world of Chanderi feels when playing.\n\nA devlog or updates from the team would be really cool. Also, if there's any playtesting or early access — I'd love to be a part of it! \nSuper excited for what’s coming!\n\nAll the best!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@r.s.hrishikesh7227",
    "comment": "damnn its so exciting to see a souls-like from india \nas someone who has played all of fromsoftware games this is fire",
    "super_thanks_amount": ""
  },
  {
    "author": "@KuNu2u",
    "comment": "Did you use poly cam to compile the photos for the 3d scans? Are these assets on any of the 3d trading sites? Btw you and your team are awesome.",
    "super_thanks_amount": ""
  },
  {
    "author": "@divyanshveersingh9680",
    "comment": "Damn I am really glad someone is doing this, but I would suggest dropping the shrine mechanism or altering it since its just very similar to wukong's mechanic.",
    "super_thanks_amount": ""
  },
  {
    "author": "@DOXTOX",
    "comment": "Bro we are with you. Lot's of love and support from us",
    "super_thanks_amount": ""
  },
  {
    "author": "@barmyrishiarts4978",
    "comment": "wishing the best for you to succeed in the indian and world market and really bring up a change for the newer gaming generation, would love to work with you someday",
    "super_thanks_amount": ""
  },
  {
    "author": "@BooBeess",
    "comment": "considering how amazing your videos are you didn't put that much effort in the showcase reel of this game :( I really see so much potential in htis game really can't wait to see the polished version",
    "super_thanks_amount": ""
  },
  {
    "author": "@butter1904",
    "comment": "That's 8 months of work...  fire",
    "super_thanks_amount": ""
  },
  {
    "author": "@desiRenders",
    "comment": "It was my dream to create something like this and you guys are already doing it, Incredible work",
    "super_thanks_amount": ""
  },
  {
    "author": "@Ikashdev",
    "comment": "India need more mindsets like you bhai,  deeply love it",
    "super_thanks_amount": ""
  },
  {
    "author": "@Yuichiro_Hyakuya_2002",
    "comment": "Constructive criticism: No originality. Why rush after \"souls-like\" games when there're games like Elder Scrolls, Mass Effect, and what not? Great work on the development, but I'd have appreciated intellectual creativity to a greater extent.",
    "super_thanks_amount": ""
  },
  {
    "author": "@laptopwindows-sp4mf",
    "comment": "As a user, people will definetly appreciate a good story more than graphics. It's all about story telling",
    "super_thanks_amount": ""
  },
  {
    "author": "@shadowash5012",
    "comment": "Looks very promising! this type of content says that Gaming Industry in India is growing rapidly",
    "super_thanks_amount": ""
  },
  {
    "author": "@sumits1384",
    "comment": "Having higher graphics and assets is no big deal, please make interaction with those assets better like physics and stuff",
    "super_thanks_amount": ""
  },
  {
    "author": "@mewmaxer",
    "comment": "The start looks promising, and I believe you will create the first Indian MMO game, attracting players from all over the world and building an incredible playerbase. Keep going! ⁣",
    "super_thanks_amount": ""
  },
  {
    "author": "@amankumar.11",
    "comment": "Dhanyawad bhaiya you jave done something that uncommon in bharat. We are just grateful for such high level 3d graphics. No words to appreciate the work. Thanks to all team. Bharat and Bhartiya people are going to be proud of your work.",
    "super_thanks_amount": ""
  },
  {
    "author": "@sairevanth3674",
    "comment": "This video is highly inspiring for aspiring and skilled gaming developers or designers. As a souls like enthusiast ( I didn't play many because I'm may be dumb ???), I m looking for this game's release and experience this awesome stuff",
    "super_thanks_amount": ""
  },
  {
    "author": "@K_OS_Gaming",
    "comment": "Attack animation and more areas  needs lots and lots of work.. hopefully you will get it through.. all the best",
    "super_thanks_amount": ""
  },
  {
    "author": "@heetsoneji3694",
    "comment": "Love you for this! good luck, wishes and blessings for this venture.",
    "super_thanks_amount": ""
  },
  {
    "author": "@vizdrom",
    "comment": "\"Brown Myth Wukong\" my first thought seeing the Shrine checkpoint",
    "super_thanks_amount": ""
  },
  {
    "author": "@ultranoob9591",
    "comment": "nice man and imagine this level of graphical game of mhabharat having those flashy wepons and machenics it will be insane and nostalgic",
    "super_thanks_amount": ""
  },
  {
    "author": "@potatorantgg",
    "comment": "THIS IS GREAT! But just had one suggestion - as you said you guys are kind of showing the Ramayan story in modern way, please make sure no one in disrespected, because it may lead to boycott and bad rep for the game (like adipurush). So make sure you consider this.",
    "super_thanks_amount": ""
  },
  {
    "author": "@levenewgaming575",
    "comment": "As a game developer....i really can se the efforts and aslo can see the areas which could have been made better..... but as its in beta....its perfectly worthy and the game awaites more modifications.....love from me keep it up......full support from mee you are doing great work.... just don't put down the hopes of India.",
    "super_thanks_amount": ""
  },
  {
    "author": "@94utkarsh",
    "comment": "An Indian souls like was never on my list. I still play Ds3 to this day, looking forward.",
    "super_thanks_amount": ""
  },
  {
    "author": "@obhaig",
    "comment": "Good work. I am rooting for your success",
    "super_thanks_amount": ""
  },
  {
    "author": "@KanchanRinnivlog",
    "comment": "Great work brother",
    "super_thanks_amount": ""
  },
  {
    "author": "@VirtualRockstarsTV",
    "comment": "Looks Awesome!",
    "super_thanks_amount": ""
  },
  {
    "author": "@rishi71307",
    "comment": "So happy to see such good work on this game. Still would suggest to work on it's finishing, it's gonna be a blast for sure",
    "super_thanks_amount": ""
  },
  {
    "author": "@dineshbs444",
    "comment": "Nice one. I hope the team is looking into all aspects of gameplay performance. This is the key to reaching a wider audience and definitely can't be compromised. Hoping that this will do really well. All the best!",
    "super_thanks_amount": ""
  },
  {
    "author": "@adityakulkarni7268",
    "comment": "Finally we can see something in gaming from India, also as an 18 yr old we always have a dream to be gamer but this feels like we have a great opportunity in this. \nA ADVICE: As a gaming viewer  i feel u should get a gaming streamer with u to help with promoting the game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@scooupa",
    "comment": "I'm not from India but I'm Really into souls-like games so looking forward to play it :D",
    "super_thanks_amount": ""
  },
  {
    "author": "@k.vamshikrishna6838",
    "comment": "Looks good for a Mobile Game, Praying you develop PC games moving forward",
    "super_thanks_amount": ""
  },
  {
    "author": "@painyeofficial",
    "comment": "The HUD, UI/UX, sound effects, main menu, particle effects, and character expressions still need significant improvement. Please focus on refining these elements before release, as they are crucial for enhancing the overall visual and immersive quality of the game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@handlingthehandler",
    "comment": "I really really hope you guys have an in-depth lore for this game \n\nSoulslike whether it's the Dark Souls series, Lies of P, Nioh games or now Wukong always derived something great from it's lore and goes very deep which runs in the background and not shoehorned in!\n\nAll best guys, i hope you make it a steam chartbuster",
    "super_thanks_amount": ""
  },
  {
    "author": "@quazarblades9458",
    "comment": "really looking forward to it! keep up the amazing work!",
    "super_thanks_amount": ""
  },
  {
    "author": "@brdJr1",
    "comment": "Yoooooo!\nThis looks fire!\nNGL, even better than some early GTA games!\nCongratulations!",
    "super_thanks_amount": ""
  },
  {
    "author": "@zypher3998",
    "comment": "The team is super experienced and probably one of the best working people out there with international title experiences!",
    "super_thanks_amount": ""
  },
  {
    "author": "@aayushwalawalkar3357",
    "comment": "This game looks very similar to Black Myth Wukong\n\nThis game is nice, but it may tarnish India's reputation. Countries may call us copy-cats.",
    "super_thanks_amount": ""
  },
  {
    "author": "@vikram3019",
    "comment": "such a incredible game in just 8 month .\nimagine what Indian game dev can do if they get funds and time like western devlopers",
    "super_thanks_amount": ""
  },
  {
    "author": "@animaxenglish3704",
    "comment": "Need a fight scene inside an indian local train",
    "super_thanks_amount": ""
  },
  {
    "author": "@jacksparrow6557",
    "comment": "Bro you went and above and beyond for this it's a solid proof of concept and the behind the scenes are very inspiring. It's a huge undertaking wish you all the luck fall 2026 seems a little too close for comfort.",
    "super_thanks_amount": ""
  },
  {
    "author": "@subratamridha1339",
    "comment": "Tremendous job, wish there could be more, teams doing this, and be a part of the team",
    "super_thanks_amount": ""
  },
  {
    "author": "@bijitesh1514",
    "comment": "Excellent work you guys are doing. One suggestion, please work on the characters expressions and animations more.",
    "super_thanks_amount": ""
  },
  {
    "author": "@amlankashyap100",
    "comment": "What a surprise! Great work Varun and team",
    "super_thanks_amount": ""
  },
  {
    "author": "@rajkishore95",
    "comment": "Wow so many donations, people really do want India to prosper. But the majority likes to throw trash on the road like they don't care",
    "super_thanks_amount": ""
  },
  {
    "author": "@BreakersLive",
    "comment": "We got indian souls like before gta 6",
    "super_thanks_amount": ""
  },
  {
    "author": "@manekdsilva",
    "comment": "Rooting for the success of this project, y’all have clearly put in some real innovation into the asset pipeline, and so many things look great, the visuals/narrative will feed perfectly into marketing too. The difficulty some projects face is that they look great, but don’t mechanically feel satisfying or innovative, so fingers crossed that you’re doing extremely extensive play-testing, and letting that feedback guide the tweaking of game mechanics, level design, animation pacing & sound. Especially in the already brimming soulslike/action rpg genre, those seem to be main indicators of international success for titles. Huge respect for taking risks that very few have taken, and congratulations to everyone on the project!",
    "super_thanks_amount": ""
  },
  {
    "author": "@aarav6891",
    "comment": "This feels like as if Raji and GTA had a baby.",
    "super_thanks_amount": ""
  },
  {
    "author": "@shaikhfaizhaidar8785",
    "comment": "feels like playing sifu but at a low difficulty level",
    "super_thanks_amount": ""
  },
  {
    "author": "@Robinomorklerk",
    "comment": "Love from Bangladesh  \nAnd Best of Luck I hope the game will be great",
    "super_thanks_amount": ""
  },
  {
    "author": "@bigG278y",
    "comment": "We have so many beautiful places and architecture here in India. Bro took the worst place to make a map smh",
    "super_thanks_amount": ""
  },
  {
    "author": "@nuzlanazeer4430",
    "comment": "An Indian souls like was not a thing I was expecting to see before GTA 6",
    "super_thanks_amount": ""
  },
  {
    "author": "@def4lt4444",
    "comment": "$10\nAppreciate your effort,make us proud",
    "super_thanks_amount": ""
  },
  {
    "author": "@heart555yt2",
    "comment": "Bhaiya ji ye bahut mast hai mai wait karunga release hone ka",
    "super_thanks_amount": ""
  },
  {
    "author": "@skite3627",
    "comment": "Let's be honest, India's gaming development is in the 2005 era and it's improving",
    "super_thanks_amount": ""
  },
  {
    "author": "@Gostlock",
    "comment": "May i know where are u planning to release it? steam or some other places",
    "super_thanks_amount": ""
  },
  {
    "author": "@samarthkapil6579",
    "comment": "I would buy this as long as this studio you created continues their efforts, I live for this, i had to quit computer sciences due to financial constraints and pursued my career in insurance, silver lining is i have no more financial struggles. I would love my countrymen to realize the dream I once saw and ill fully support them.",
    "super_thanks_amount": ""
  },
  {
    "author": "@TridevkrSarkar",
    "comment": "The game really looks amazing. For a game coming out of India this is a huge step forward.\nKeep up the good work.",
    "super_thanks_amount": ""
  },
  {
    "author": "@shadow_1011sd",
    "comment": "The Song, The Background, the texture, The Movement, the effects everything is perfect.\nWell, congratulations to the whole team.",
    "super_thanks_amount": ""
  },
  {
    "author": "@404Xd",
    "comment": "damnn thats actually-",
    "super_thanks_amount": ""
  },
  {
    "author": "@cuckoonut1208",
    "comment": "A rich story line with zero Bollywood trash will make this game more accessible to International players. Seriously, get rid of that stuff.",
    "super_thanks_amount": ""
  },
  {
    "author": "@XJacktheripperX",
    "comment": "Looks great but I would suggest adding more motion and physics to the game to make it more high quality. Like more movable ornaments or clothings on the characters etc. Those really make the visuals more appealing. All the best with this project.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Lofibets440",
    "comment": "Is this available for android or pc only?",
    "super_thanks_amount": ""
  },
  {
    "author": "@karmabasedj8184",
    "comment": "This game, when released, would be the least pirated game ever, while selling out millions. Good job on this initiative!",
    "super_thanks_amount": ""
  },
  {
    "author": "@heheo.zabemaru.",
    "comment": "Ab koi mahaan YouTuber aake isliye video banaega k isme tilak lagaya pandit ko villain dikhaya hai.",
    "super_thanks_amount": ""
  },
  {
    "author": "@siddhantgupta4117",
    "comment": "Sekiro- Slums edition.",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhishekak9619",
    "comment": "They wont be leaking any of the gameplay. It will be leaks like cinematic trailer got leaked accidentally.",
    "super_thanks_amount": ""
  },
  {
    "author": "@madhurmaharshi",
    "comment": "I honestly think this is really cool, yes there are many areas to improve and I am sure you will achieve that, LETS GOOOO, super excited to play this game asap!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@tanishgehlot",
    "comment": "A MESSAGE FROM INDIAN HARDCORE GAMING COMMUNITY\n\n-  focus on hardcore gamers as we are the actual people who will spend their money to play this game\n-  graphic quality is important but in the end its all about gameplay\n-  many indian games dont focuses on side quests or small missions apart from main story line which makes  a good game a great one\n- game optimization is all that lacks in  indie games we dont want our game to be laggy and choppy \n- we are gamers who dont go outside in the real world, so we love to explore the in game world, if the game boundaries are too short they ruin the experience\n- PLS consider the user of the game SMART , many indian games thinks we gamers are not smart enough and they make the game easy and even a simple common sense mission they treat user that they know nothing\n   \nconclusion\n- graphic good but gameplay great\n- we can wait for few years but dont waste our money on unfinished product \n- what we like in games - explore, solve puzzles by ourselves even if it is hard, some side quests or achievements apart from main story line or may be some easter egg that is way hard to find\n- INDIA is in our heart, a game cant make us more patriotic let it be a game rather than a product with an indian flag on it\n\nWE BELEIVE IN YOU DONT BREAK OUR TRUST LIKE OTHERS DID",
    "super_thanks_amount": ""
  },
  {
    "author": "@KDTechverse",
    "comment": "Kudos to you Varun !  all the best and I wish you achieve your goal sooner than yoh expected and shine like the brightest star in the galaxy !",
    "super_thanks_amount": ""
  },
  {
    "author": "@carrot2318",
    "comment": "To the people who are criticizing this game need to remember that this is an early alpha build, and this in itself is way better than the final version of any other game developed in India (Except Raaji). With such a limited team and limited resources Varun bhaiya's team has done an astonishing work in such a short amount of time, and I have really high hopes for it. Keep it up Varun bhaiya. Also, people comparing it to the bar of gta, when it's clearly stated and represented as an rpg soulslike is hilarious.",
    "super_thanks_amount": ""
  },
  {
    "author": "@piyushrathan",
    "comment": "Please dont rush and try to make it as polished as possible,all the best.",
    "super_thanks_amount": ""
  },
  {
    "author": "@sarbajeetdutta2106",
    "comment": "Is that based on the same concept of souls like games? I mean the resting option to replenish health and stuff and also the parrying system which breaks enemy posture is very similar to Sekiro. Also, the \"sankat\" text that was shown for unblockable attacks from that boss is definitely a ripoff of the \"危\" sign in Sekiro which means 'danger' during unblockable attacks.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Guys-PB-gc6xl",
    "comment": "Bhai Sekiro: Shadows Die Twice ka rip-off hai.\r\n\r\nPehla gate scene, \r\nThe way they indicate first enemy at his video \r\nThe way he runs. \r\nLimit of his defense at top left yellow bar. \r\nHis defense against gun shot. \r\nHis counter defense from enemy melee attack\r\nThat red dot on enemy indicating lethal finishing attack\r\nAll fighting style. \r\nBC SHRINE, about saving game, resetting life, travelling, BC - sidha keh dete ke Sekiro: Shadows Die Twice khel lo dubara. \r\n\r\nThat F*cking SANKAT signal, kya bak*c*hodi hai.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Itskunalumare",
    "comment": "Wow this look so Organic to our cultural surroundings and work Bhai!! Cant wait to buy it and play sooner 🇮🇳 Proud of you Varun",
    "super_thanks_amount": ""
  },
  {
    "author": "@giantjupiter",
    "comment": "Will it have Proton (Windows compatibility layer for Linux) support?",
    "super_thanks_amount": ""
  },
  {
    "author": "@kar_zoldyck",
    "comment": "Its super amazing ngl...but one thing i disliked is potraying ...come on man every thing is so amazing game play wise or the graphics ..but slums would be really a bad depection :(.....there are so many beautiful places u can add..such as sikkim or other places on maps :)...just my opinion..tired of bad potrayal of India.",
    "super_thanks_amount": ""
  },
  {
    "author": "@be-backslash",
    "comment": "Less than a year omg you guys really deserve a big praise .",
    "super_thanks_amount": ""
  },
  {
    "author": "@ArnavMangarapu",
    "comment": "Amazing work i think these game has lot of potential, but small request don't release the game untill it's optimised plz . Don't make the mistake indus made . All the best",
    "super_thanks_amount": ""
  },
  {
    "author": "@soham_das",
    "comment": "Graphics are great but maybe the story should be the USP",
    "super_thanks_amount": ""
  },
  {
    "author": "@DakshDas-f3q",
    "comment": "Indian rockstar games before GTA VI",
    "super_thanks_amount": ""
  },
  {
    "author": "@tejjm4263",
    "comment": "Hey Varun and team,\n\nI’ve been playing games since I was a kid — I’m 28 now — and recently I played Ghost of Tsushima. In the gameplay you showed there were a few things I felt were missing, especially when it came to the sound design.\n\nDuring combat with mid-tier or low-tier enemies, the sounds and character dialogues didn’t feel very immersive. It lacked that emotional pull or intensity. Also, the world around you should feel alive even when you’re just moving through it. Ghost of Tsushima does a good job with ambient sounds like rustling grass, birds chirping, foxes, and some NPC interactions. The Witcher 3 or Red Dead Redemption 2, those NPCs and their interactions felt much more immersive and dynamic.\n\nAll the best! Looking forward to play this!",
    "super_thanks_amount": ""
  },
  {
    "author": "@LostMyPowerArmor",
    "comment": "Hey Varun, I am someone who really enjoys video games and am also very passionate about the industry as an art form. It really pains me to see how gaming is treated in our country and I wanna make a difference.\nDo you guys need any extra members in your team. I don't know anything about coding but I can write decently well. \nIn any case, I wish you and your team good luck.",
    "super_thanks_amount": ""
  },
  {
    "author": "@FartingChickenn",
    "comment": "Its not always necessary to make the game based in India",
    "super_thanks_amount": ""
  },
  {
    "author": "@LM35-1.44",
    "comment": "Even the gameplay PC is struggling , talk about the optimisation",
    "super_thanks_amount": ""
  },
  {
    "author": "@rudrapratapsinghsolanki7277",
    "comment": "Congratulations Man! Crazy stuff.",
    "super_thanks_amount": ""
  },
  {
    "author": "@famouspeople5899",
    "comment": "is their no city  for play",
    "super_thanks_amount": ""
  },
  {
    "author": "@ONESHOTYTGAMING",
    "comment": "Good luck , great stuff.",
    "super_thanks_amount": ""
  },
  {
    "author": "@memesboy2198",
    "comment": "India is not limited to mumbai and delhi but also try to show kashmir , north east , uttarakhand,south and many more",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheBengalFilmer",
    "comment": "Ab Asli Maaza Ayga 2026 Mein Game Khelne Mein ️",
    "super_thanks_amount": ""
  },
  {
    "author": "@chiragvaghela07",
    "comment": "India's game market is untapped gold mine. Great efforts in correct direction. Way to go Guys!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Tatay-05",
    "comment": "Finally somebody did a great job by utilizing their full",
    "super_thanks_amount": ""
  },
  {
    "author": "@itZsehZ",
    "comment": "Keep it up , its really good",
    "super_thanks_amount": ""
  },
  {
    "author": "@roronoazoro4293",
    "comment": "Bro all the best we support you \nGot nothing much to say but would really like to know more about the storyline because that transformation at the end of gameplay was dope",
    "super_thanks_amount": ""
  },
  {
    "author": "@Neonloverx",
    "comment": "it took wukong 5 to 7 years. so rememeber that",
    "super_thanks_amount": ""
  },
  {
    "author": "@captainnemo8072",
    "comment": "Sound effects and music seems overlooked",
    "super_thanks_amount": ""
  },
  {
    "author": "@jitendrabarange3622",
    "comment": "How you optimize the game",
    "super_thanks_amount": ""
  },
  {
    "author": "@ArtsySIDDD",
    "comment": "Cool stuff bro.. keep going.. love it!!\n\nhopefully like u, I will be able to do something myself for the Art n Animation industry in India as well.",
    "super_thanks_amount": ""
  },
  {
    "author": "@vasuverma8832",
    "comment": "as an indian i wish you all the best for future bro and from the bottom of my heart I AM PROUD that such a game is finally comming from my country.. LETS GOO.... Thanks brother",
    "super_thanks_amount": ""
  },
  {
    "author": "@HarshitBahri",
    "comment": "A major issue with Black Myth: Wukong was its optimization, largely due to being developed on Unreal Engine 5. This engine, while powerful, demands high-end hardware, which means the game requires expensive graphics cards and powerful PCs to run smoothly.\n\nThe game saw most of its sales from China, which makes sense given the cultural connection and the story’s roots in Journey to the West.\n\nHowever, considering that the majority of Indian gamers are on mobile platforms and can’t afford a PS5 or a high-end gaming PC, this approach indirectly excludes a large portion of potential players—especially in regions like India—just for the sake of graphical realism.\n\nGood work though ️",
    "super_thanks_amount": ""
  },
  {
    "author": "@evilgraphix2927",
    "comment": "Everyone ...out there they did so much hardwork so everybody promise me that they are gonna buy this game not pirate.",
    "super_thanks_amount": ""
  },
  {
    "author": "@jaidubey7540",
    "comment": "This is Awesome. Kudos to you and the team for pulling this off.!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@akhilramani5215",
    "comment": "Super excited to see someone took a courage and of course capital to take this risk. Just one thing I would like to suggest, just put camera bit lower in X axis (Sky is not visible) and may be reduce focal length a bit, the environment is super detailed but due to some camera setting everything looks smaller, kind of like a miniature.",
    "super_thanks_amount": ""
  },
  {
    "author": "@AryanGaming56497",
    "comment": "Great work every indian will be proud of this",
    "super_thanks_amount": ""
  },
  {
    "author": "@freezingicy9457",
    "comment": "This looks like a shitty version of Sekiro, I dont understand why Indian studios keep on trying to make wannabe AAA games instead of just focusing on making a good indie game",
    "super_thanks_amount": ""
  },
  {
    "author": "@yadavshubham13",
    "comment": "Take your time to improve the game don't waist time to prove others opinion brother \nThis is going to be the next big thing for us",
    "super_thanks_amount": ""
  },
  {
    "author": "@thegamingstoic",
    "comment": "It's great to see AAA game from my own country. Take your time to make it the best possible experience. Really proud of yall. 🇮🇳",
    "super_thanks_amount": ""
  },
  {
    "author": "@broiliterallyhatehandles",
    "comment": "PLLEEEEEAAASEEEEEEE you HAVE to hire voiceactors fo the sound effects! For the bosses and npcs! And more main characters pleaseee!",
    "super_thanks_amount": ""
  },
  {
    "author": "@vamankad",
    "comment": "This is just huge!! Congratulations to you and your team for pulling this off and all the best for the release. \nI just hope the people of India don't start with \"this game is hurting our religious sentiments\" stuff. I really hope the government and the people see this as a game that will change India's gaming industry and put us out as a big player in the world. \nI think people will really lose hope in the nation if such an amazing game faces hurdles from crybabies 🫡",
    "super_thanks_amount": "₹1,000.00"
  },
  {
    "author": "@-zero-",
    "comment": "nice attempt but take this as constructive criticism, this feels like 2010 game like prince of persia with a bit on an \"Indian\" touch. please make it modern and unique.",
    "super_thanks_amount": ""
  },
  {
    "author": "@code_vermillion",
    "comment": "This looks amazing, just a small little feedback: pls change the running animation. Dunno if its intentional or coincidence. The running animation look nearly identical to black myth wukongs. Visually and combat wise this looks stunning tho",
    "super_thanks_amount": ""
  },
  {
    "author": "@Hiraproductionsofficial",
    "comment": "I can't belive it, it looks real .\nI wish the cost of game will affordable for students like me.",
    "super_thanks_amount": ""
  },
  {
    "author": "@santhoshravi2515",
    "comment": "Is this place any related to Tamilnadu?",
    "super_thanks_amount": ""
  },
  {
    "author": "@advik565",
    "comment": "Finally something in India.  Form an indian",
    "super_thanks_amount": ""
  },
  {
    "author": "@dem0n595",
    "comment": "It looks like a small demo, there are flaws lets ignore them as we want to slowly improve game development in india, it will require 2-3 good games for benchmark, I saw you took sekiro's fighting mechanics just make it little smoother, Also it looks really empty like an mobile arcade games put some npc both passive and hostile.... For me I would really love to see more of the gameplay.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ArjunSharma-lm3vp",
    "comment": "Please fix the colour pallet of the games . The blues of drums and whites of the wall and the colours of most of the thing does not blend in with the world .\n\nThe assets need colour correction for the scenes .\n\nThe hairs need some more efforts to be better they look like ,foils of aluminium sheets crumbled into a ball and mashed on someones hair.\n\nThe facial characters look really unreal, literally.",
    "super_thanks_amount": ""
  },
  {
    "author": "@c0mplicated",
    "comment": "after seeing this video, i won't pirate games",
    "super_thanks_amount": ""
  },
  {
    "author": "@prstudios97",
    "comment": "Looks Promising, Proud of the team",
    "super_thanks_amount": ""
  },
  {
    "author": "@nadeabhi3500",
    "comment": "the love that people showed by donating money and overwhelming comments, makes me feel that people do care and people want development in every field. we will rise again and Varun you are a damm hardworking man and lucky to have such lovely audience. kudos to all of you guys and good luck.",
    "super_thanks_amount": ""
  },
  {
    "author": "@iama.k1080",
    "comment": "Pgr and dmc has really damn good 3d animation that makes the gameplay feel fast, tense and beautifully. If you slow mo the action the models look very weird but in action its all fire.",
    "super_thanks_amount": ""
  },
  {
    "author": "@AdiS7-l3c",
    "comment": "Amazing finally we have an Indian game that has world class appeal. Amazing work exited to play this game even more exited for it than gta 6.\nBtw will it be console only game or it can run on high specs pcs as well , cus I feel most of Indian audience playing AAA games comes from PC world.",
    "super_thanks_amount": ""
  },
  {
    "author": "@XpertGamer....",
    "comment": "I am very excited to play this Game",
    "super_thanks_amount": ""
  },
  {
    "author": "@sanchitsoni-p1g",
    "comment": "Finally... Something good... I hope when released it actually delivers....  All the very Best...",
    "super_thanks_amount": ""
  },
  {
    "author": "@alshaaransari2821",
    "comment": "Very cool can't wait to not hear about it for another 5 years",
    "super_thanks_amount": ""
  },
  {
    "author": "@dank_shiv",
    "comment": "1. The Real question is, Does it Run on my 1650 AMD processor as smooth as GTA V and RDR 2 Runs? \nWill it be optimised for Indians who have low end pc's because most of us Gamers in India have low budget pc, \n\n2. Do the Charachers gonna have facial expressions as well?\n\n3. Will This game gonna have Reasonable price for US Indians?\n\nIf the answer for all of the questions is yes then i am gonna purchase my first game on steam.",
    "super_thanks_amount": ""
  },
  {
    "author": "@OnlyHereBro",
    "comment": "Is it in xbox?",
    "super_thanks_amount": ""
  },
  {
    "author": "@chakanshu",
    "comment": "\"indian sekiro\" sorry . Let's go I wanted to make something like that and I've decided on working on a 2D sekiro style combat cuz I love the game.\nYour game's style is awesome and that little styled hair move umh It's amazing.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Suryashis_",
    "comment": "Focus is so much on it being Indian that the rest of the plot suffers. Auto traktor and slums, sums up India. I hope the game is actually good when it releases.",
    "super_thanks_amount": ""
  },
  {
    "author": "@chhotu_pardesi5565",
    "comment": "Looks Phenomenal! Will the entire gave have this realistic slum setting or will it have more of a Fantasy vibe??",
    "super_thanks_amount": ""
  },
  {
    "author": "@Djsanddy",
    "comment": "great job man. FPS looks stuttery but I am sure you know and will be fixed in the final release",
    "super_thanks_amount": ""
  },
  {
    "author": "@officework7979",
    "comment": "Good work Varun and Team. Keep it up.",
    "super_thanks_amount": ""
  },
  {
    "author": "@user_747",
    "comment": "In the end kids will compare this with some AAA ganes and say this isn't like any big games and in the end no matter the price they will pirate it, that will be the reality. In India everyone wants things for free, jugaad doondega",
    "super_thanks_amount": ""
  },
  {
    "author": "@chisd5643",
    "comment": "Understanding that the Game is still in it's alpha stage I urge you to put some emphasis on the sound design, the swings and guns don't feel impactful enough without it, that Being Said amazing work! Looking forward to seeing this progress",
    "super_thanks_amount": ""
  },
  {
    "author": "@shebinnn",
    "comment": "This is like Sekiro got reincarnated in Indian grounds can’t wait to dodge, parry, and get humbled by some desi bosses....",
    "super_thanks_amount": ""
  },
  {
    "author": "@PriyankPrawal",
    "comment": "God of War (made in India)",
    "super_thanks_amount": ""
  },
  {
    "author": "@whitehumour69",
    "comment": "AYOO INDIAN SEKIROO I M ALL FOR IT LETS GOO",
    "super_thanks_amount": ""
  },
  {
    "author": "@apoorvdixit2657",
    "comment": "This is so inspiring! I truly admire your courage and your ambition to venture in this space. I look forward to buying the final product on Day 1! :)",
    "super_thanks_amount": ""
  },
  {
    "author": "@Blazee_OP",
    "comment": "Too good Varun I hope for the best to you and to your team one suggestion- instead of the slums it would be better if u show something of a typical Indian neighbourhood rather than slums ..cause if it is going  to be a first high quality game from India we can’t let it gain a stereotypical traction right ?",
    "super_thanks_amount": ""
  },
  {
    "author": "@autoandbeyond",
    "comment": "Finally a game inbuilt with pride on our culture. Waiting Waiting...",
    "super_thanks_amount": ""
  },
  {
    "author": "@pipasees",
    "comment": "Love the effort and thanks a lot for doing this",
    "super_thanks_amount": ""
  },
  {
    "author": "@kamimoon-maki",
    "comment": "very impressed , please please make sure you guys nail the combat down - your game looks really good",
    "super_thanks_amount": ""
  },
  {
    "author": "@fateofgod",
    "comment": "Finally someone is going to show our true potential . Hope everyone acknowledge your hardwork.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Containerrd",
    "comment": "how are you going to release it so soon? even wukong and sekiro were in development for more than 4 years, the wukong demo was 1 high quality level they had at the time. not to mention so much mocap, va will be needed, unless planning to use asset packs for mocap",
    "super_thanks_amount": ""
  },
  {
    "author": "@Vman_95",
    "comment": "Combat looks like inspired by Sekiro with focus on parry and Sankat (Kanji) symbol \n\nBut it just kinda feels weird setting is morden era possibly Mumbai city setting and charectors using swords and guns too?",
    "super_thanks_amount": ""
  },
  {
    "author": "@rishabhraj9859",
    "comment": "i love this shift to perfection going on in india.",
    "super_thanks_amount": ""
  },
  {
    "author": "@advaithsreekanth1019",
    "comment": "Im gonna be th devil's advocate here and pount put the following \n1. 0 variation the shed roofing textures. Gives a very tile like view in aerial shots expecially \n2. Combat still looks rudimentary\n3. Animations are a little choppy, \nReply if you find more, prolly will be useful for the devs",
    "super_thanks_amount": ""
  },
  {
    "author": "@kkbad4009",
    "comment": "This is very awesome, no just awesome.. cant explain... I will support can much as I can",
    "super_thanks_amount": ""
  },
  {
    "author": "@puspaltarafdar2465",
    "comment": "Amazing effort!!! Although this is a very early build and surely a lot more will be added in the development process, here are some suggestions from me:\n\r\n1.This is a fantasy game, go more artistic with the Lighting. In any fantasy game like Sekiro, Elden ring, God of War, DA Inquisition etc. you will see that they are much more artistic with their lighting choices. That’s because realistic lighting in fantasy games may look a little out of place. A more stylized lighting can make the visuals more appealing.\n\r\n2.Blood splatters too far from where the impact is happening then vanishes in thin air. If there is blood, the blood should stain the clothes and skin, as well as fall on the ground and splash on the walls. If blood stains the weapon, make the character wipe off the blood as blood is highly corrosive to metal. Little details go a long way. Take inspiration from Ghost of Tsushima’s bloody combat.\n\r\n3.When the player is walking there is no visual cue. If it is a muddy ground, there should be footprints, if not footprints then at least make little splashes of water. If the ground is dry, there can be a little dust whenever the foot hits the ground. Different games do it in different ways. Some kind of visual sensation will surely make the movement of the player feel better.\n\r\n4.The boss is yelling, but his mouth is visibly closed at all times, looks odd. You can either animate the face with the sound or play with the lighting and headgear to subtly hide the face during the battle. Sekiro does both with different bosses.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Gloriousgaming0047",
    "comment": "Great start.. take your time, Dont rush it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@gamernerd7139",
    "comment": "This is wonderful work! The closest I have seen some Indian (nee Sri Lankan) city represented was in Uncharted Legacy of Thieves 3rd edition. Hitman World of Assassination attempts to show Mumbai but not at his resolution! \nLooking towards a tight game design. Make it count! Time for the next generation in this country to actually put the hard effort to create world standard products.",
    "super_thanks_amount": ""
  },
  {
    "author": "@robbydutta6521",
    "comment": "Looks really clean. Just some animations adjustments, more polished gameplay and better hitboxes. Thats what my suggestion would be. Im definitely buying this one",
    "super_thanks_amount": ""
  },
  {
    "author": "@rishikeshdas7766",
    "comment": "My god what a game more power too you brother huge respect ️️️️️",
    "super_thanks_amount": ""
  },
  {
    "author": "@D-f5j",
    "comment": "Damn , Much Respect to you Sir",
    "super_thanks_amount": ""
  },
  {
    "author": "@ursmilan142",
    "comment": "Is this the same going to be a copy of Sekiro or something different? Lots of mechanics are the same as Sekiro. Hopeful for the game rather than just the assests on Unreal Engine 5.",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhilashmohanta9878",
    "comment": "I don't know why but i am more exited for this game then GTA 6",
    "super_thanks_amount": ""
  },
  {
    "author": "@Insanely_devilish",
    "comment": "Not high quality tbh, it's a compilation of high quality renders nothing more. Why the creator thinks good graphics means good quality ? I mean what's fresh in this reveal ? Slums ?",
    "super_thanks_amount": ""
  },
  {
    "author": "@michaelchawang6810",
    "comment": "the visuals are not bad its fine. I think you should focus more on the SFX and the action sequence, also would recommend you to higher a Concept artist who can help you with the Characters and environment to fit with the plot of the story if there is any.",
    "super_thanks_amount": ""
  },
  {
    "author": "@TejaGaming2200",
    "comment": "Bro full support",
    "super_thanks_amount": ""
  },
  {
    "author": "@17_swayamgunjal8",
    "comment": "You can see the sekiro resemblance but at the same time, the game's originality seems one of a kind, cudos to you and team, great job",
    "super_thanks_amount": ""
  },
  {
    "author": "@ParikritKoirala",
    "comment": "Just a suggestion\n1) Optimization is the most important thing. Even looking at the trailer it feels quite choppy. \n2) that's amazing that you and your people are working hard for this but  the game needs to well managed I guess working only 1-2 years on triple A games and publishing it is not worth it.  It looks great but find some ideas and take some time to make things even better for a great experience\n3) looking at the trailer chatecter model looks quite unrealistic. Especially in combat where blood scatters in unrealistic way. Like adding wounds on damaged ones would make it lot more better \n4)  while looking the facial movement features should be added like in combat chatecter should look aggressive doing so will make the game even more immersive. \n5) that's great you and your team has put lot of efforts but adding different combat styles and finishing move would be great \n \nThese are my perspective and some suggestion hope you find this well",
    "super_thanks_amount": ""
  },
  {
    "author": "@saiprasanth4950",
    "comment": "All the best. Proud of your Team",
    "super_thanks_amount": ""
  },
  {
    "author": "@terribleminer7041",
    "comment": "The game looks good but gameplay shown still lacks maybe cause its of development phase\nI pointed out many things there is lack of cuts, bruises, dust, water ripple, splashes, weapon swing signs, facial expressions \n\nThe heavy man hit the weapon to ground, there was only dust, no crack or hole in ground and no effect to water.\n\nNext is the UI, its eye straining and focus will change the players hp at the left-top, item at bottom-right. Instead of going left-right or right-left , eyes will be in diagonal which is too much time taking.\n\nCut scenes graphics are not matching the gameplay.\n\nI hope that this game reach the expectations you all wishing for.",
    "super_thanks_amount": ""
  },
  {
    "author": "@akhileshwar833",
    "comment": "Hat's off to you. As someone wrote, make for the world, not for India. \nA bit of caution: While we do have mythologies, it is also important to respect people's beliefs and not trivialize things just for making entertainment for the world. It's fine to take inspiration from mythologies but using characters should be done cautiously and respectfully. It is better not to put any gods in the game. Like we don't want a situation where a god like thor is having romance.  Also, if it is mythology inspired, then it is encouraged to also make it meaningful.  \n\nAs for the game itself, i would say make it more than just India's souls-like. It should have some memorable features that are not in any Souls game but people enjoy that a lot. Idk, maybe aerial fights or flying. Maybe include controllable spatial and time powers. And make the world more alive where not everyone wants to attack you lol. Include things like cows maybe. And please don't get restricted due to 'India's first soul-like': it's just about being a but more creative and having a bit more ideas, which can elevate the game to a whole new level. And since it is based in India, an lot of ancient Indian weapons can be included which i am sure you are including. Even mythological weapons like Sudarshan chakra can be cool. You can also add things like temples, where fight is forbidden, giving respect can unlock some powers or heal and there could be some teachings there as well. As in sleeping dogs, in buddhist shrines, lighting incense increases health bar. In the end, i wohld again emphasize, do not be constrained by the term Souls-like. U could create situations where we are traveling on a ship and are fighting in a ship, it's not one vs all situation but there can be necessary ncp allies as well.",
    "super_thanks_amount": ""
  },
  {
    "author": "@5Mid",
    "comment": "Finally I hope this is real arun mayya speaking. \n\nFinally some one showcasing the world, what Bharat can do. Thanks Varun we support you.",
    "super_thanks_amount": ""
  },
  {
    "author": "@speed.exe26",
    "comment": "If what was mentioned in this video is all true, then it is a huge step forward in a right direction. As someone who has played a lot of AAAs, RPGs I can say that the graphics look great. It can rival many big name games as you mentioned. As for the story, if done right then it could be a great success. My only concern is that the gameplay looks janky and you mentioned that it is inspired by sekiro but this in game footage made fights look easy. But in qny case, you have taken up a huge risk and I pray for your success. Many don't realise how big of a leap it is for India as a country nit just for you guys. I hope you succeed and that success indpires a lot more indians who have the talent but doesn't want to take the risk or pursue it. I am waiting to buy the gane and test it for myself. Don't pay attention to hate comments or any other demotivating stuff, you guys rock.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Mavellyrical",
    "comment": "Can't wait to try it! BTW where is your shirt from really like it",
    "super_thanks_amount": ""
  },
  {
    "author": "@Bekind609",
    "comment": "Wtf!!  High quality",
    "super_thanks_amount": ""
  },
  {
    "author": "@eshanborah8944",
    "comment": "Visionary of our times.\nWish to meet you one day.",
    "super_thanks_amount": ""
  },
  {
    "author": "@phoenixgamerz7192",
    "comment": "Cool stuff man...Good job and good luck from Pakistan",
    "super_thanks_amount": ""
  },
  {
    "author": "@reenachauriya4931",
    "comment": "Sekiro combat with gta graphics Nice work",
    "super_thanks_amount": ""
  },
  {
    "author": "@shivamohite5653",
    "comment": "Main question what engine is that???",
    "super_thanks_amount": ""
  },
  {
    "author": "@Emily-qu3ty",
    "comment": "It looks great!\nIt came out of nowhere in my feed.\n\nBut you have my full support!\n\nI would like to see games from my country.\nI am still bummed that indian gta (mayanagri) never took off. \nIf this game succeeds I want you guys to make a game like a indian version of max Payne 3. I tell you it will be a huge success if you could pull it off. \n\nI hope you succeed in this game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@CHAUPLAH",
    "comment": "Now it's our duty to make it known to every gamer we know.",
    "super_thanks_amount": ""
  },
  {
    "author": "@IMRo444",
    "comment": "Hey, this is not bad! It's not Black Myth: Wukong but it is definitely a great step in the right direction. There a few things that needs to be worked on (at least in my opinion) but other than that, I have high hopes",
    "super_thanks_amount": ""
  },
  {
    "author": "@FrizerraFitzgerald",
    "comment": "Varun is special man, everything he creates or facilitates makes me excited. A legit role model",
    "super_thanks_amount": ""
  },
  {
    "author": "@vmaya_bro",
    "comment": "the screenshots are crazyy they look so real",
    "super_thanks_amount": ""
  },
  {
    "author": "@prashantprasad7898",
    "comment": "The thing is, people get swayed by the essence of the Indian setting, which I also liked, but comparing it to other AAA games like Ghost of Tsushima is too much — it's not even reaching mid-tier quality for now...maybe in future when they will reveal a polished version.",
    "super_thanks_amount": ""
  },
  {
    "author": "@PRATIKDOLAI-i5y",
    "comment": "really great job, just some improvement is needed. in the first attempt you have done very well. i hope that it will ignite  the competition in india followed by making greatest games in india in near future. admiring your spark for this work",
    "super_thanks_amount": ""
  },
  {
    "author": "@ajit_gaming",
    "comment": "Awesome work keeps it up",
    "super_thanks_amount": ""
  },
  {
    "author": "@diptangshu9434",
    "comment": "Atleast someone is trying to change it, I am a student but I really hoped that I could help you a little bit...  Thanks",
    "super_thanks_amount": ""
  },
  {
    "author": "@sajalyadav2834",
    "comment": "really proud of you guys, this is really big so excited for the game, i just cant wait",
    "super_thanks_amount": ""
  },
  {
    "author": "@sanket.solanke",
    "comment": "Everything in the demo looked ugly together. I know it's alpha footage, but you can polish it 100 times and it'll still look ugly. I hope the style is drastically different in final product. More visually harmonic and less chaotic random.\n\nHire a director, or take help from someone. World building is a big part of any game. You have to do that with not just the story but visually too.\n\nImagine a game like god of war, but instead of being set in ancient Greece, it is set in slums of Mumbai with \"bollywood\" twist.\n\nEvery once in a while there is a game maker in India who try to make a \"game set in India\" and not a game. Don't fall into same trap.\n\nSure assets are good, may be mechanics are good to but you want to tell a story inspired of Ramayan, set in a slum, there is a guy with a sword dressed out of time, there is police in uniform and guns, a guy in safari with pipe, a giant south Indian with a mace, \"bollywood\" style and everything looks a mess. Is it similar to some places in India? Yes. But it looks like a place most people would not like to be in. \n\nMake something beautiful not realistic. Nobody is attracted by what they perceive as ugly.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Vanswock",
    "comment": "Any thing new?\nit seems like a jankier version of sekiro?",
    "super_thanks_amount": ""
  },
  {
    "author": "@amanvermal",
    "comment": "Loved it, Varun. Full support to you and your team. \nSomething I didn't like is the use of Slum and a tilak wearing Pandit as villain in the trailer. I hope this does not represent the entirety of game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@shaymartix1712",
    "comment": "Excellent work dude, I'd suggest improve sound designing, like movement, action, sound design sounds like an old mobile game, also using AI would make a muchh better experience",
    "super_thanks_amount": ""
  },
  {
    "author": "@ganeshamurugan667",
    "comment": "One year ago u have mentioned working on prototyping kit based raspberry pi which is something like you talking mirror and later you have also posted a video working on that solve loneliness problem in India. We all thought you would do something great and useful because as a country we have other big problems to solve because with the potentially you have distribution you could have built something greater but a game really never expected from you despite we are all waiting on this hyped project which is a game totally disappointed varun.",
    "super_thanks_amount": ""
  },
  {
    "author": "@hectera",
    "comment": "It is deeply disappointing when a piece of media chooses to represent India solely through the lens of poverty, especially by showcasing slums as the primary visual identity. India is a nation of vast diversity, rich culture, and breathtaking landscapes—from the snow-capped Himalayas and lush backwaters of Kerala to the architectural marvels of Rajasthan and the vibrant skylines of modern cities like Bengaluru and Mumbai. Reducing this incredible country to a single stereotype is not only lazy storytelling, but also deeply disrespectful to the millions who take pride in their heritage and progress.\n\nSuch representation fuels the global misconception that India equals poverty, ignoring the fact that the nation is also home to one of the world’s fastest-growing economies, a booming tech industry, and a youthful, innovative population. Developers and content creators have a responsibility to portray cultures with depth and nuance—not with tired clichés. While it’s true that every country has its struggles, it’s unfair to highlight only the flaws while ignoring the beauty, resilience, and brilliance that define its people. It's time for the world to see India beyond the slums, and recognize the elegance, energy, and excellence it truly embodies.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Nikhil-dx9kc",
    "comment": "That looks like Unreal Engine5. A suggestion I would like to add is let the characters have some face expressions while fighting or vaulting. Even NPCs needs some expression they are completely dead for that. I hope you guys will work on it. Also maybe its too early but we need some more variation in fights and combat. If all these are kept in mind I bet this game could do wonders.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Unknown-bt6zy",
    "comment": "Woww\n\nAfter Release, where I can play?",
    "super_thanks_amount": ""
  },
  {
    "author": "@rampanta3491",
    "comment": "wowwww man the games look really good . As level progresses make the visuals more appealing, also refine the combat . i think the approach for this game design is inspired by sekiro. so focusing on bosses  enemy and environment with combat is crucial for the project.",
    "super_thanks_amount": ""
  },
  {
    "author": "@bikashmishra6675",
    "comment": "Wow,I thought I would be disappointed yet again,when I saw \"Indian game\" but wow,this is amazing. \n\nWell,this is the very beginning of break through in Indian gaming creation. There will many which will follow through. Government should invest into this guy and guys like him.",
    "super_thanks_amount": ""
  },
  {
    "author": "@CKPVPDEVIL",
    "comment": "Is this game is alsi for Mobile or not i guess it's only for pc cause every Indian games are only for pc like kamla and i know that kamla game also now realised for mobile but the graphics and the the quality is not good but i hope you will add it also dor mobile if not then it's fine but bro you literally created a fire bro full support",
    "super_thanks_amount": ""
  },
  {
    "author": "@listenup_01",
    "comment": "8:30 The problem is those potholes in the road. I didn't see any water splashes when the character stepped in one. Hope you guys fix that and add some sound effects too!",
    "super_thanks_amount": ""
  },
  {
    "author": "@ivisualWizard",
    "comment": "Huge Respect Team",
    "super_thanks_amount": ""
  },
  {
    "author": "@KapishDalmia-k3x",
    "comment": "Problems\n1) literally unplayable optimization for a game 60-70% done\n2) no npc's around \n3) zero immersion \n4) not shown any voice acting\n5) gameplay mechanics are too bad(actually though too bad)\n6) character models for enemy aside from the boss were bad\n7)please dont fool us by saying it us 60-70% done cause even if it is there is no super high quality in here as super high quality environment like buildings and huts, grass or lighting are super common nowadays there is nothing even impressive about only having those \n8) there are literally no npc's\n9) either you are fooling us or you have no idea\n10) but I still hope you can deliver a good game as I am indian and want the country to develop it's just as of now what you are showing is just not convincing in any way to be a somewhat successful game given you release at least",
    "super_thanks_amount": ""
  },
  {
    "author": "@yayatistudios",
    "comment": "This reminds me of the Mumbai mission in Hitman 3",
    "super_thanks_amount": ""
  },
  {
    "author": "@davidstarc5984",
    "comment": "Varun ur awesome. What a swag that character did in the game turning u know that hair thing it did and the weapons pakka local . We are with you",
    "super_thanks_amount": ""
  },
  {
    "author": "@nishantkumarai",
    "comment": "Congratulations Varun\nKeep working, don't listen to hate who don't known how to make game. \nBest of Luck",
    "super_thanks_amount": ""
  },
  {
    "author": "@kushalbanerjee07",
    "comment": "Brother u should add some cuts and bruises when hit...it would be crazy",
    "super_thanks_amount": ""
  },
  {
    "author": "@Singh_Mannu-c8f",
    "comment": "epic bro. jab bhe release karo to batna try kara ga",
    "super_thanks_amount": ""
  },
  {
    "author": "@RAMANBUCHHA",
    "comment": "now please dont release it for like 2500 , keep it cheap and focus on marketing so that you get audience",
    "super_thanks_amount": ""
  },
  {
    "author": "@Arpan993",
    "comment": "Actually excited for the game keep on working.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Rossonerian",
    "comment": "Thank you for inspiring me brother,I want to be a game dev too and love souls like games so I would also work on one someday or the other",
    "super_thanks_amount": ""
  },
  {
    "author": "@febinmathew",
    "comment": "WOW amazing stuff, really got me screaming in my room lmao i really do see the souls like inspo especially seikro combat and and wukong elements rlly amazing you guys def will be supporting you guys when the game comes out and trying it for my self to. in my personal opinion i would really like to add more things like fluid animations , a doge or a dash mechanic , and more lively npcs like they taunt you or like feint at you to make the game even more immersive , may be like a weapon upgrades or armor upgrades would beee really fucking dope.",
    "super_thanks_amount": ""
  },
  {
    "author": "@sandipansengupta1707",
    "comment": "please take inspiration from hitman or uncharted.. where they have introduced indian environment so beautifully",
    "super_thanks_amount": ""
  },
  {
    "author": "@amitansurkar1769",
    "comment": "My god y does almost everyone, go for a souls like approach",
    "super_thanks_amount": ""
  },
  {
    "author": "@Sanatanibalk91",
    "comment": "what a masterpiece man.,",
    "super_thanks_amount": ""
  },
  {
    "author": "@DeepKingg",
    "comment": "4 days ago title was \"India's First Super High quality game\".now its \"India's First  Soul-Like game\" . nice progress ..",
    "super_thanks_amount": ""
  },
  {
    "author": "@akashtahal",
    "comment": "Where can we download it?",
    "super_thanks_amount": ""
  },
  {
    "author": "@ravigupta5330",
    "comment": "This kind of things should be done but I have complain why did you show our country like there's only rugs and slums",
    "super_thanks_amount": ""
  },
  {
    "author": "@AVI_XIX",
    "comment": "Man i really support indian gaming community and putting myself in it as developer too, the work you have pulled with your team is fabulous and mesmerising . BRAVO!!!\r\nhere's some time stamps where you should consider a thought \r\n 7:53 - Villainizing the tika (tilak) is great part of western and Arabic invasion in India, furthermore our bollywood continued to make fun of our culture. I know you have a rough idea while making that but consider changing the 3 stripes tilak to something more evil like a black tilak or ...(you get the idea am pointing )",
    "super_thanks_amount": ""
  },
  {
    "author": "@yugshrivastava5628",
    "comment": "A bit of GOT, bit of sekiro, bit of black myth and other games here and there. I don't have any problem with them but just that it should not be some another indian ripoff of other games. Like the approach you are taking but please emphasize on the gameplay mechanics feeling not clanky and the story as you said very good. Feeling proud of you. Props to youal and the team for doing something.\n\nThanks for this. It means a lot to a game enthusiast.",
    "super_thanks_amount": ""
  },
  {
    "author": "@mr_batangad",
    "comment": "Pal its looks like crazy im waiting for it.!",
    "super_thanks_amount": ""
  },
  {
    "author": "@yourfriendlyneighborhoodca6241",
    "comment": "Pls optimize your game for us poor gamers so we could also run it on integrated graphics",
    "super_thanks_amount": ""
  },
  {
    "author": "@mayankrathi9677",
    "comment": "Looks promising  great work",
    "super_thanks_amount": ""
  },
  {
    "author": "@ADI-xp4qe",
    "comment": "As a 3D artist myself I wanted to share few thoughts let me know if they are constructive. \nTo start off, good job with putting the efforts, i think things are in right direction but can be pushed further \nSo, firstly i think it's important to understand what your game is aiming towards gameplay or narrative. Great games have a balance of both but it's subjective at the same time, like detroit is a great narrative based game while doom has crazy good gameplay. So from that point of view I feel the vision is missing from the trailer. Again you can argue we have story through art and have gameplay. But, I think narrative should not be spoonfed to the audience on a primary level it's fine but you can always aim for complexity to get better results. \nMy suggestion talk or hire gameplay designers and narrative designers who have great experience in this domain and have a vision what do you want to showcase. It doesn't have to be rocket science, just proper vision towards the goal. \nSecond, problem with photogrammetry from an artistic standpoint. While it's great that you have used scans to recreate this whole settings, there are few issues with it. 1st you can't use unreals PBR to full potential because most of the data is borrowed from real life and they act as buffer to enhance the artistic aspects. So, in short i think it's important to aim for less is more. \nSecond, there was a wide contrast between the characters the props and environment, from a style pov. Which made things unrelated and inconsistent. \n\nI have showcased artistic feedback later because i understand the technical limitations and this being your first game i understand the sheer ignorance with development you guys will have and its great that you are on this endeavour to push things and our industry i 100% support this thing and looking forward to your progress.\nAnd i believe you man you do listen to your audience, so I hope you go through this feedback too. \n\nHope this helps\nGoodluck",
    "super_thanks_amount": ""
  },
  {
    "author": "@zeusstormbolt8116",
    "comment": "This is more like sifu than souls like right? I appreciate the effort! Hopefully the release is super fun",
    "super_thanks_amount": ""
  },
  {
    "author": "@Yt.rituraj",
    "comment": "Ive played a lot of games, i don't want to give any gyaam but i am indian so how can i stop myself,\n1) games can be repetitive, if youre in horror you can find the same things in diff games. making it repetitive\n2) you don't need to put art for making it good, recent game R.E.P.O got hit with almost normal art in game, the mechanism for user matters more.\nApart from this, anything you do can work, dont always listen people not even me, keep working keep making.",
    "super_thanks_amount": ""
  },
  {
    "author": "@proEntertainment-987",
    "comment": "Don't worry Allah be with you",
    "super_thanks_amount": ""
  },
  {
    "author": "@qkpd",
    "comment": "indian sekiro before gta6",
    "super_thanks_amount": ""
  },
  {
    "author": "@gamernerd7139",
    "comment": "Since I am not a into game development, this is for people who do game coding, is Rust a viable language instead of c++. Given its extremely aggressive compile time checks on memory safety and object management.",
    "super_thanks_amount": ""
  },
  {
    "author": "@xXApexPredator",
    "comment": "Congratulations on reaching this exciting stage with your game. Even in its early alpha build, it’s clear that a great deal of passion, creativity, and technical skill has gone into it. The foundation you’ve laid shows strong potential.\n\nAs you move forward, I encourage you to focus deeply on gameplay, narrative depth, character responsiveness, and progression systems—these are what truly define a memorable player experience.\n\nThere’s a unique opportunity here to ground the game in Indian culture and storytelling. Think Ghost of Tsushima—a game that thrived by staying authentic. This could be India’s Uncharted or Tomb Raider: cinematic, tightly designed, and rooted in local heritage. I’d recommend avoiding an open-world format and instead crafting a refined, narrative-driven journey.\n\nTake the time you need to polish it—quality outlasts deadlines. You’re on the right path. Keep pushing—this could be something truly special.",
    "super_thanks_amount": ""
  },
  {
    "author": "@aalamkhan5466",
    "comment": "Made Call of duty walfare Type Mission   People will love to do mission  it will give a super kick to your game",
    "super_thanks_amount": ""
  },
  {
    "author": "@Utkarsh-xp8el",
    "comment": "This guy loves the word \"cleanup\"",
    "super_thanks_amount": ""
  },
  {
    "author": "@krotonval",
    "comment": "Damnnnnnn, exited to play the whole game when released !!",
    "super_thanks_amount": ""
  },
  {
    "author": "@AnandMishere",
    "comment": "Finally, some work from our country is worth showing its pipeline to the rest of the world. I believe Raji has done something commendable, as have the other games like Indus.\nThis will be on Par with such games. I always support other local devs who have been working so hard to compete in this risky gaming market.",
    "super_thanks_amount": ""
  },
  {
    "author": "@doneythomas66",
    "comment": "I hope, it will be a benchmark of gaming industry especially in our indian gaming industry ️",
    "super_thanks_amount": ""
  },
  {
    "author": "@itsfun2990",
    "comment": "inspiring.. keep bringing these updates",
    "super_thanks_amount": ""
  },
  {
    "author": "@AveragelyNoobs",
    "comment": "Greetings, We Averagely noobs Support indian devs, Let us know about alpha testing, We will Make a video for it and promote it!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@matrix484s",
    "comment": "Damn, that looks realistic and tbh it's on par with the aaa games. Love that",
    "super_thanks_amount": ""
  },
  {
    "author": "@cyberpunkgaming7971",
    "comment": "Incredible . This is what I'd like to spend my money on.",
    "super_thanks_amount": ""
  },
  {
    "author": "@tabahigamerx_",
    "comment": "Comment section is donation section",
    "super_thanks_amount": ""
  },
  {
    "author": "@jajuo32",
    "comment": "Is that Sekiro mechanics? I love it, there has been no game that has mechanism like Sekiro, it will become crazy",
    "super_thanks_amount": ""
  },
  {
    "author": "@zo_gamer3740",
    "comment": "I would love to see more AAA titles delving into the old kings or folklore of India, or games like saint's row, or gta.\nAlso I was wondering if the style of the game might be more suited for pre-colonized India",
    "super_thanks_amount": ""
  },
  {
    "author": "@shoaibha",
    "comment": "There is lots of motion blur possibly due to TAA or YouTube compression?",
    "super_thanks_amount": ""
  },
  {
    "author": "@Abhayyyyy",
    "comment": "Great bhai intezar rhega iss game ka",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhishekak9619",
    "comment": "This is going to be so much bigger, than that chinese watch guy.",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhayvishwakarma4558",
    "comment": "All the best guys",
    "super_thanks_amount": ""
  },
  {
    "author": "@ALIKHAN-i6j7b",
    "comment": "Sorry brother but please don't make it a UE5 mess type of game, take your entire life and optimize it as good as you can. I am looking forward to play this game but if it is 30 FPS locked and a glitchy stuttery mess then I will pass on that but I hope you understand why I am telling you this as for a long time I haven't received some good optimized games in last years.",
    "super_thanks_amount": ""
  },
  {
    "author": "@anaverageinternetuser7705",
    "comment": "what is story of this game",
    "super_thanks_amount": ""
  },
  {
    "author": "@OsinakiKun",
    "comment": "Critic: Game is very out of place, Nothing makes sense... For a game to be indian you shouldnt force INDIA INDIA... try anient India maybe, \ndo Something different... this feels like a slop... look at KCD they represented their culture and history without forcing it an d being innovative and bringing something new to the market",
    "super_thanks_amount": ""
  },
  {
    "author": "@Nitinsharma-if8xt",
    "comment": "First soul like to hoga bht mene bhi apne future project k liye story features function or gameplay kis type ka hoga wo sab likha huva hai gdd bna k ....️️️ Best of luck brother Indian games bas traditional jo path h wo follow na kare bas ...",
    "super_thanks_amount": ""
  },
  {
    "author": "@vivekkashyap3203",
    "comment": "why do i feel like the animations are directly copied from sekiro",
    "super_thanks_amount": ""
  },
  {
    "author": "@rashuu69",
    "comment": "Super proud of you brother...As a Gamer and cse students...i know how difficult and challenging it to make a game...And you did it brother... congratulations",
    "super_thanks_amount": ""
  },
  {
    "author": "@okirenvader1692",
    "comment": "ye teaser tha ya trailer nahi samajh aya then again when you see studios like cd project red their trailers and teasers introduce the player to the world of the game and are really convincing so much so that a person would really be interested in investing their time and mooney in that game. you claimed that the game is going to be india's first high quality game yet you are going to release it in 2026 instead of taking 7 years which is the ususal time big studios take to make and launch their games so that not only do they stand up to the quality requirements but also provide more that 40 hrs of content. whatt is the budget of this game? again claiming it to be high quality sounds a bit too far fetched as the gameplay looks choppy i know you might fix that but that is not the biggest problem here , tell me why does the HUD look so unpolished and uninspiring. Secondly what i dont understand is when a big company like rockstar keeps it game dev journey absolutely hidden why are you showing a half baked poduct right now? something is fishy.",
    "super_thanks_amount": ""
  },
  {
    "author": "@avengersnewbie2348",
    "comment": "Why does the movementp feels so rigid and camera.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Phantom-d5e",
    "comment": "I think this is based from indian land of peace so main character should be representing as a worrier nor than main character killing normal people , police , religions person etc it should represent as an indian mindset don't just merge every other game story and build something , proud that games of such quality is coming from india but just think of indian mindset",
    "super_thanks_amount": ""
  },
  {
    "author": "@yoyosingh1088",
    "comment": "You should have seen how Enotria the last song implemented their game and then have developed this with that inspiration",
    "super_thanks_amount": ""
  },
  {
    "author": "@VinitR",
    "comment": "I really like what you presented, gameplay. Although the presentation could look more engaging if you have at least two speakers, makes the viewer feel part of the team.\nOne suggestion I have for your team: Take feedbacks with a grain of salt, so many people nag about a lot without understanding market research, what is trending, keywords a user would expect from a premise. E.g. the slums are a unique environment and I knew before clicking that viewers will hate it. It is perfectly fine for an RPG to start with modest levels with modest environments moving to different varied levels. You will also get nostalgia factor from overseas users from the Slumdog millionaire movie.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ashj8186",
    "comment": "Guys I think we need more \"Indian references\". Can't tell which country this game takes place in.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Thanos_1821",
    "comment": "facial expression, some super moves or special powers that makes the protagonist special then others, I know this is in beta, hoping for a great game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@big8533",
    "comment": "the mechanics and theme is inspired by sekiro , nice progress tho",
    "super_thanks_amount": ""
  },
  {
    "author": "@ArcadyArts",
    "comment": "I appreciate the work... I myself looking to get into Indian gaming industry.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Parthbhaiiiiii",
    "comment": "indian ofc too be appreciated we are doing this good or atleast taking a risk to make such games hats off",
    "super_thanks_amount": ""
  },
  {
    "author": "@vikasgoud5303",
    "comment": "I dont like when every other game being based on mumbai..",
    "super_thanks_amount": ""
  },
  {
    "author": "@TrinityPAS",
    "comment": "made a pandit a villian good initative bro . love from pakistan broo",
    "super_thanks_amount": ""
  },
  {
    "author": "@IroxGamer",
    "comment": "Only suggestion is to smooth the animations and movement",
    "super_thanks_amount": ""
  },
  {
    "author": "@ashrhn",
    "comment": "Whoops is it available on pc, price, launch date \nHow did I miss out the games name & platforms it's available on..",
    "super_thanks_amount": ""
  },
  {
    "author": "@Reviewtaku",
    "comment": "There are many mistakes and things i don't like but apart of that the game is so good and for souls like game the environment is so bright can you guys make it dark and like the village you made make it ruinded something like that it would look more like a souls like game",
    "super_thanks_amount": ""
  },
  {
    "author": "@dipankarsanyal1594",
    "comment": "Character expression, sound design, optimization. Do not forget that you're using unreal engine 5, so optimize this game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@SantoshKumar-jr2dt",
    "comment": "Souls games are not popular in India but this type of game helps to get popularity souls games \n\nBtw game is looking fire",
    "super_thanks_amount": ""
  },
  {
    "author": "@laviqhmpl",
    "comment": "It seems like it's made on Unreal Engine 5, graphics look good.  But stuttering will be an issue.",
    "super_thanks_amount": ""
  },
  {
    "author": "@umane2183",
    "comment": "Wtf was this Wukong from Dharavi",
    "super_thanks_amount": ""
  },
  {
    "author": "@leonthaj9467",
    "comment": "Extremely love the fromsoftware kind of mechanics. I wish you the best",
    "super_thanks_amount": ""
  },
  {
    "author": "@kireetjoshi3711",
    "comment": "This is amazing. Now we can have our own wukong",
    "super_thanks_amount": ""
  },
  {
    "author": "@KhmerTarotReading",
    "comment": "i would be great if intro song would play non copyrighted of Shree Krishna Sloka or something",
    "super_thanks_amount": ""
  },
  {
    "author": "@mrtigeryt9558",
    "comment": "THE GAME AND THE ENVIRONMENT IS NICE NOW YOU SHOULD FOCUS ON INTERACTIVE CHARACTER MOVEMENTS AND ENEMY AI",
    "super_thanks_amount": ""
  },
  {
    "author": "@dk331",
    "comment": "Hey, just a suggestion. If you are able to change the audio tracks for different weapons (like wood on wood, pistol on wood, metal on wood, and metal on metal) it would make the gameplay even better.\nI am not a game developer, so I am sorry if its rude of me to say this.",
    "super_thanks_amount": ""
  },
  {
    "author": "@swastikchatterjee407",
    "comment": "I must say that such a benchmark you guys have created for the indian game development industry i am also a unity game developer and we are also working on a fps game project, so as a game dev i have to say that the theme is not really mathcing with the whole story it seems that you are trying to mix wukong with uncharted lost legacy but this is not giving us a very good result. According to me this particular slum type theme is best suitable for COD like stealth mission based gameplay not for this one this kind of gameplay is best suited in the Himalayas or kedarnath type of religious areas and villains also should be more mythological or supernatultal vibed not a police man or a woman this is not gta bro. But apart from this the sound design, the game design, animations, vfx is 10 on 10.\n\n keep working on this project and make standard to compete internationally we arr always here to motivate you.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Vishwasssss",
    "comment": "I can clearly see that the game is heavily inspired by sekiro. But as a souls like game you should explore different games based on this genre as it will help to create a unique game rather than a souls like clone. For Now You should focus on smooth animations. The attack and deflect animations look very choppy ( fix their timing and increase their spacing )  and also the deathblow animation need a massive overhaul as it feel very weird. And work on skill trees and add different tools variety which will help gamers to play with different strategies. The Game needs so much work so don't rush it. Take atleast 3-4 years imo to polish the game properly. You can also release a demo version so that you will get gamers response to improve your game just like The First Berserker Khazan did. All the best",
    "super_thanks_amount": ""
  },
  {
    "author": "@fpsbyaim3382",
    "comment": "I hope this is a mobile game cause game mechanics is not PC/console level",
    "super_thanks_amount": ""
  },
  {
    "author": "@Glitchysky21",
    "comment": "What kind if game is that.. First thing i see is u killing a women with sword for no reason then fighting with cops with a swors.. It doesnt make sense.. I think u should make the game more realistic so people can enjoy it more. Its nit a hate its a recomendation from a fellow gamer.",
    "super_thanks_amount": ""
  },
  {
    "author": "@adilmohammed7343",
    "comment": "Try to present this game at the game awards (2025) or any live gaming events introducing it to a larger audience",
    "super_thanks_amount": ""
  },
  {
    "author": "@MHGaming4281",
    "comment": "Looking forward for play this",
    "super_thanks_amount": ""
  },
  {
    "author": "@sanggnas2329",
    "comment": "Coming a long way from the Bhagat singh game i played back in 2007",
    "super_thanks_amount": ""
  },
  {
    "author": "@matanmc",
    "comment": "this comment will go unnoticed but speed up video 1.25x animations & gameplay feels better",
    "super_thanks_amount": ""
  },
  {
    "author": "@Shark-06",
    "comment": "Thank you",
    "super_thanks_amount": ""
  },
  {
    "author": "@devyanshrastogi",
    "comment": "I was actually thinking this while ago that this guy the guy who knows unreal engine isn't making a game!!\nto be honest I have seen your video on unreal engine and I was really thinking that why didn't you built a game, well I got my answer now by the way I have also built a game it's in pre alpha state right now, maybe I will DROP the teasor next month , as an indie devoloper i envy you for the large digital asset base that you have curated from your team, and I am still struggling with it, but it is what it is \nAll the best for your project",
    "super_thanks_amount": ""
  },
  {
    "author": "@meyashtiwari",
    "comment": "Great work but just a suggestion, remove the religious symbols specifically from the enemies as this might offend someone and might get you in controversy. Don't forget that this is India and here people will only focus on stupid things to take someone down.",
    "super_thanks_amount": ""
  },
  {
    "author": "@utkarshsisodia2375",
    "comment": "Very good project. keep going one day the games coming out of Bharat will be at par with other gaming industries. Just don't stop and keep yourself motivated.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Rohitgamerz962",
    "comment": "Impression gameplay keep it up bro",
    "super_thanks_amount": ""
  },
  {
    "author": "@lowbudgetgamer2439",
    "comment": "I need to work on Animation fluidity.\nAlso Character reaction animation required. My suggestion is that during development time don't focus on graphics. Improve Gameplay and Animation. As for the soul like most Important aspect is Gameplay and Animation. Try to smooth Gameplay first and after that work in graphics and particle effect.",
    "super_thanks_amount": ""
  },
  {
    "author": "@AmogSus-g6h",
    "comment": "Perhaps this game will fill the void sekiro left",
    "super_thanks_amount": ""
  },
  {
    "author": "@budotenka494",
    "comment": "Finally great news! I am going to purchase it!",
    "super_thanks_amount": ""
  },
  {
    "author": "@basu_gaming",
    "comment": "Amazing graphics",
    "super_thanks_amount": ""
  },
  {
    "author": "@Uttamkumarjha-pc6ut",
    "comment": "bro if you are reading my comment please dubbed this game in hindi also please when was game going to release",
    "super_thanks_amount": ""
  },
  {
    "author": "@AshwinPrakash-e4f",
    "comment": "I'm really happy and concerned that you are stepping into a very risky zone in the indian market. I know this is an alpha, but these are my thoughts:\n1) The character's leg animation, I loved it mostly.\n2) The dirt interactions on the ground.\n3) The overall setting and background looks promising \n\nNow to the imp parts.\n1) The name of game, ui, hud look way too generic. The name could be something very imdicative of the narration or character, if you think of it the name suites many fantasy AAA games..where a power is unleashed. The Ui should be such which prompts to player to start the game. It should be a part of the story. The hud, i think it's overly being indianized, just to be indian, a national pride is awesome but shouldn't overshadow the game. As in an american game or a chinese game wont shout chinese out. So keep some things like the hud minimalistic yet original to the game.\n2) If the gameplay showcased is an actual part of the story, then it's lackluster, as in..there's not much context..im pretty sure there's more to it! \n3) The charater movements and attacks shouldn't be just a button click and animate..it should feel cohesive. \n4) Character eye contact and expressions should be improved (I liked that giant mans face after that show off, excellent for an alpha of the build)\n\nI'll edit if I notice more, full support. Nail it. \nDon't just creat a fantasic product but also do fantastic marketing to get it put there. Do large collabs, celebs, actors...if both aspects are in place, I'm sure you'll nail it. Looking forward to play this game️",
    "super_thanks_amount": ""
  },
  {
    "author": "@akshustrikes6985",
    "comment": "Why this video doesn't have 10 million views",
    "super_thanks_amount": ""
  },
  {
    "author": "@yournightmareisnothere2387",
    "comment": "Bro fighting for weekly grocery's",
    "super_thanks_amount": ""
  },
  {
    "author": "@Driggergames",
    "comment": "Respect for you",
    "super_thanks_amount": ""
  },
  {
    "author": "@ded-kun",
    "comment": "one suggestion: the colors feel too saturated please dim it down a bit\nlike elden ring type maybe\nthe balanced color tone\nand also the character models of mc and npcs feels a bit more cartoonish I'd say  compared to the envirorment graphics and textures\nmake the character motions a little more smooth \nik its just at alpha stage so everything wont be perfect but if you can please implement my suggestions \noverall the game feels good",
    "super_thanks_amount": ""
  },
  {
    "author": "@RishabhK12",
    "comment": "I got paid from my client while watching this video (maybe it’s a sign) and decided to be small part of this blockbuster!!\nCan’t wait to see the end product!!!",
    "super_thanks_amount": "₹449.00"
  },
  {
    "author": "@GurguntlepalyaGaming-l3l",
    "comment": "what was the budget for this game, as a once aspiring game dev i just wanted to understand about how much would such a game cost",
    "super_thanks_amount": ""
  },
  {
    "author": "@subha_roy2512",
    "comment": "The game is another level. Honestly i don't eant much graphics,. just need good game mechanics. And this game really have the potential to fill the gap which nowadays triple a game have created.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ssmith5881",
    "comment": "Im loving this idea, \nHoping the story goes from the slums to the riches that can show off the skyscrapers of Mumbai and the rich palaces and gardens.\n\nHope inspirations from Hitman and Monkey man help. In the end I’m sure you guys are cooking up something awesome.\n\nWill be looking forward to the game!!\n\nMuch love",
    "super_thanks_amount": ""
  },
  {
    "author": "@AnirudhHu",
    "comment": "THANK YOU for what you're doing, I'm definitely buying this game when it comes out.\nJust one request, PLEASE don't make it \"Bollywood\", just make it Indian.",
    "super_thanks_amount": ""
  },
  {
    "author": "@lakshyaghunawat9423",
    "comment": "Bhai I am an upsc aspirant and I would’ve contributed to your journey if I was earning. \nEither ways I am proud of what you’ve pulled off",
    "super_thanks_amount": ""
  },
  {
    "author": "@DhanjitBsty-bi4ns",
    "comment": "My suggetion is portray the lord krishna with his real colour that is black",
    "super_thanks_amount": ""
  },
  {
    "author": "@sidharthsr4312",
    "comment": "Even though ik it is a fledgling passion project, I hope everyone working on this gets their due, credit-wise and financially. This could be the first step towards something massive, but it should be a step in the right direction. Awesome job all around!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@darkmageval",
    "comment": "i think you need to work on the name and branding of the game... it honestly seems a little cheap... also the effects and attack animations need work. All the best, looking forward to what the final build looks like, will definitely buy a copy when it releases.",
    "super_thanks_amount": ""
  },
  {
    "author": "@sparshi-g3w",
    "comment": "this is huge but I wanna say focus on gameplay aswell boss we don't care if u launch it in 2027 but it should be awesome cheers mate",
    "super_thanks_amount": ""
  },
  {
    "author": "@nadeemnawab7696",
    "comment": "Sir I genuinely respect your effort everything art environment  is perfect but the problem lies within game  mechanism please sir don't try to complete  with Indian industry, try to complete with game of global level .",
    "super_thanks_amount": ""
  },
  {
    "author": "@akshay4892",
    "comment": "Bring shivarajkumar jogi character into the sword fight",
    "super_thanks_amount": ""
  },
  {
    "author": "@debroy2441",
    "comment": "We need games based on hindu mythology",
    "super_thanks_amount": ""
  },
  {
    "author": "@Februaryeves",
    "comment": "The game doesn’t feel fluid there’s definitely room for improvement in both the Field of View (FOV) and animations. Also, I’d love to see more effort put into world-building, not just focusing on the Souls-like elements with an Indian twist. I hope you take this feedback seriously and work on refining these aspects. I’ll be rooting for your progress.",
    "super_thanks_amount": ""
  },
  {
    "author": "@AD2IMAGINATION",
    "comment": "i have one concern, i admit that you are good at videos and your are also good at graphics and 3d modeling. But please make sure to be very good (or excellent) at game storyline. Because there are many high quality games that has been filled because of their poor story line. I don't want to see your hard work go in vain because of that part.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ARTs896",
    "comment": "Important  advice:--\n\nRelease the b.t.s of making game for some extra budget..",
    "super_thanks_amount": ""
  },
  {
    "author": "@subhajitchatterjee9688",
    "comment": "Unreal Engine 5?",
    "super_thanks_amount": ""
  },
  {
    "author": "@SurajLiveGamer",
    "comment": "don't scam like Mumbai Galis",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheatreofFuga",
    "comment": "getting feeling of sekiro in desi style",
    "super_thanks_amount": ""
  },
  {
    "author": "@bake9637",
    "comment": "Why not just use low poly models with baked details? Do you really think all the major studios are dumb by relying on that method? your game already looks jittery and unoptimized and we are trying to compete against chinese devs lol. good luck",
    "super_thanks_amount": ""
  },
  {
    "author": "@Purnojit",
    "comment": "Graphics are awesome.\nPlease work on character behaviour and camera movement.\nMost important STORY !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@rakavi.ratankar.77",
    "comment": "Dammn.. Good \nKeep it up",
    "super_thanks_amount": ""
  },
  {
    "author": "@Biryani.216",
    "comment": "Idk,but this gameplay is kind of giving me the vibe of Raji: An ancient epic",
    "super_thanks_amount": ""
  },
  {
    "author": "@DorkRiot",
    "comment": "Its cool and all, but why would anyone play it? \nI am not hating on you but i am thinking realistically. I mean it does have high graphics, animations, assets, environment, but its lacks a cool story line, why would anyone play this game over gta 6, black myth wukong.\nIt just needs a cool storyline.",
    "super_thanks_amount": ""
  },
  {
    "author": "@tonyimpact3855",
    "comment": "Bhaiya story ko kamal ka banana...... Agar story accha nahi hoga then i dunno.... Aaj kal audience utni forgiving nahi hai.... Like u know what i mean! Ek khtarnak story jo khatam hote hote kuch heart me feel karake jaaye... Also put more modes and make the opening more appealing.... Baki  the way u came down to this level... I mean just wow",
    "super_thanks_amount": ""
  },
  {
    "author": "@shauryaxgaming2588",
    "comment": "Broo why does it feel like sekiro ???  But the graphics are lit just a few animation problems but everything else is just too good  we need more people like you",
    "super_thanks_amount": ""
  },
  {
    "author": "@singhofficial9282",
    "comment": "Mobile game aayega yaa pc k liye game asyega bs",
    "super_thanks_amount": ""
  },
  {
    "author": "@Aaryan-1379",
    "comment": "needs a lot of FPS fixing and motion smoothing but goddamn that bolly-dodge was insane hahahaha",
    "super_thanks_amount": ""
  },
  {
    "author": "@AstonOne77",
    "comment": "Thank you so much dude for this game\nthanks dude thanks\nI cant help u donate money cuz im a student\nbut i want indian developers to succeed more specially game developers",
    "super_thanks_amount": ""
  },
  {
    "author": "@killer19aj",
    "comment": "We have got an AAA indian game before GTA 6",
    "super_thanks_amount": ""
  },
  {
    "author": "@nishantsthalekar8857",
    "comment": "Looks good but gameplay needs to be ALOT better even for alpha. I've first hand experience of gaming industry for close to a decade and post pandemic it has gotten quite competitive. This means you have to set your bar really high if you want a successful release. Only having photorealistic assets won't be enough. The game design, gameplay mechanics, ai everything should be top notch. It seems you are using ue5 so you better use state trees for ai . But you did pique my interest and I will be rooting for you guys, all the best",
    "super_thanks_amount": ""
  },
  {
    "author": "@primal-consciousness",
    "comment": "I wish that instead of a mission or fight scene, you would have covered the character story so that people are excited to play it. I play games for the story line, not to attack anybody who comes in front of me.",
    "super_thanks_amount": ""
  },
  {
    "author": "@SM-td4vz",
    "comment": "I want to be a part of your next project if you need a deep voice for any character please",
    "super_thanks_amount": ""
  },
  {
    "author": "@tryhardigan9952",
    "comment": "Much respect to you, improvement in everything was mentioned except for gameplay. PLEASE IMPROVE COMBAT further until it’s quality is equal to the scans and environments or it will fail internationally, PLEASE do not depend on UE5s default motion from your trailer, I understand it’s early alpha but default automotion creates uncertainty. \n\nVideo reference combat quality examples (you can do better than them); Lords of the Fallen version 2.0, Black Myth Wukong and Dark Souls 3 as examples are a good start\n\nI design games, it’s rough out here, best wishes and salutations in your success.",
    "super_thanks_amount": ""
  },
  {
    "author": "@takemeseriouslyplx2124",
    "comment": "I'm so confused, and I'm sorry if this is harsh, but this looks like something one developer did in a week with premade assets! What exactly is this game? There is no art direction, the gameplay it very bare bones and clearly not even in an alpha stage and the level design is terrible!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Centipedes1",
    "comment": "Atleast represent your country better if you are making a world class game why unnecessarily adding slums and dirty streets. And make this game inclusive for all religions and represent Indian culture more beautifully. Focus on Indian culture and not poverty to make it look realistic.",
    "super_thanks_amount": ""
  },
  {
    "author": "@AbhinavKumar-gf9gt",
    "comment": "looks good all the best hope it gets better.",
    "super_thanks_amount": ""
  },
  {
    "author": "@visiontravel9900",
    "comment": "Varun even if graphics aren't great but we really want a good game -  game mechanisms or  world. \nAtleast a world like Assassin Creed 2 like thing. Game with good functions. Please. We want this game to make it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@paxonite-7bd5",
    "comment": "I appreciate your efforts and I agree that it's in the alpha phase. But I don't understand the concept yet. You have a fantasy touch in dharavi slums?",
    "super_thanks_amount": ""
  },
  {
    "author": "@levinhawk6828",
    "comment": "This is something between AA to AAA,\nYou need to work more on lighting, and materials(in this video some textures look low resolution and low detailed)\nWorld looks dense/filled which is good.",
    "super_thanks_amount": ""
  },
  {
    "author": "@pnahar0847",
    "comment": "real subtle with sekiro mechanics but still a big stuff for indian gaming",
    "super_thanks_amount": ""
  },
  {
    "author": "@YuvrajSingh-mg5gs",
    "comment": "Graphics are impressive",
    "super_thanks_amount": "₹100.00"
  },
  {
    "author": "@GAMINGXLIFE-z2t",
    "comment": "Who is here after watching Neonman's Video",
    "super_thanks_amount": ""
  },
  {
    "author": "@GAJENDRASINGH-t9t",
    "comment": "Souls like  \nGangster life",
    "super_thanks_amount": ""
  },
  {
    "author": "@chillnsleep",
    "comment": "is there going to be poops on the streets?",
    "super_thanks_amount": ""
  },
  {
    "author": "@savitarplayzeverything880",
    "comment": "I just hope the game comes optimised for low end devices also",
    "super_thanks_amount": ""
  },
  {
    "author": "@ACreatorMind",
    "comment": "YESSSSS, with sekiro mechanics ️️️",
    "super_thanks_amount": ""
  },
  {
    "author": "@devanshumangal07",
    "comment": "And if you are comparing it with mumbai gullies graphics, so ya it is much better but they dont have assests or camera team to 3d scan everything, they are making the assests by hand and with probably lesser budget so please dont compare it that way.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ci8387",
    "comment": "game's looking great! hope the story is just as good and nuanced as some of the other soulslike games!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@siddharthtiwary",
    "comment": "Send your UPI ID or QR Code! I don't want YouTube to take the 25% cut of my hard earned money! More power to you",
    "super_thanks_amount": ""
  },
  {
    "author": "@xerx170",
    "comment": "first of all, i like your videos and this is not an hate comment but If you want an honest review of a gamer, its just not good. realistic graphics doesn't make a good game. i've played alot of games including really old titles from more than 20 years ago and they feel visually better than this because theme and style of environment is more important. \n\nMy expectation for a first game of a studio isn't too high and i'm not comparing to rockstar but even comparing to small independent games like outer wilds(a masterpiece btw), this just doesn't stand out. i dont think i'd play this game even for free if this is the end result.\n\nThis looks like a soulslike game but it looks too easy for a soulslike tbh.\n\n I really wish to play a game in indian setting. hope you make it better. good luck.",
    "super_thanks_amount": ""
  },
  {
    "author": "@zombiesalad2722",
    "comment": "This is so fucking cool. \nCan't wait to see it become a reality.\n10/10 would play.",
    "super_thanks_amount": ""
  },
  {
    "author": "@agrajsingh9258",
    "comment": "we got Indian sekiro before gta 6",
    "super_thanks_amount": ""
  },
  {
    "author": "@rocket9691",
    "comment": "Thank you for putting in so much efforts humanity is saved, now justice will be there for everyone,earth will be green again,clean water,clean air everywhere.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Toffeebaba",
    "comment": "Wait for 5 years i'll join you",
    "super_thanks_amount": ""
  },
  {
    "author": "@ArnabBiswas-x6x",
    "comment": "Really amazing. Proud to see such graphics",
    "super_thanks_amount": ""
  },
  {
    "author": "@jungwoorex6841",
    "comment": "Soul's like? Brother this is not even a game. Might as well continue making videos instead of game dev.",
    "super_thanks_amount": ""
  },
  {
    "author": "@HimanshuKumar_24",
    "comment": "I'll buy it the day it comes out",
    "super_thanks_amount": ""
  },
  {
    "author": "@DIVYANSHSUPERHERO",
    "comment": "Bro don't take my opinion in wrong way but i want to use same beautiful environment other then slums. Maybe you understand my feelingsthanks for reading",
    "super_thanks_amount": ""
  },
  {
    "author": "@AriyaGavisti",
    "comment": "Alright man, as much as I wanna appreciate your efforts there are so many things you are neglecting. One of them being your own audience. Now, I don't know how the final version would be but right now I just don't see much soul into it. Also using Unreal 5 could be a death sentence. It's one of the most unoptimized engine available. Another thing is it being an \"AAA\" title, that already comes with a lot of expectations. That give rise to a lot of worries people should be having. The price, performance, content. Not saying you don't have it figured out but the presentation certainly didn't give me anything to chew on. \n\nYou can very well prove me wrong. But so far it looks soulless, uninspired, buzzword ripoff of a franchise that I personally hold dear to my heart, and it's just not me. Hopefully next time you show the game at least some of my concerns could be proven wrong. Again man, not hating on it but can't just jump into trusting an \"AAA developer\" after everything going on in the industry.\n\nCautiously optimistic though. Next presentation will be telling.",
    "super_thanks_amount": ""
  },
  {
    "author": "@lonewolfe2502",
    "comment": "It looks really good. But to be honest that Sword won't have any chance against that Gada.",
    "super_thanks_amount": ""
  },
  {
    "author": "@samarth-5e",
    "comment": "Good bro",
    "super_thanks_amount": ""
  },
  {
    "author": "@nileshghadge5016",
    "comment": "I got chills when the lead character transformed!",
    "super_thanks_amount": ""
  },
  {
    "author": "@RoystonDsa9",
    "comment": "4 ram ?",
    "super_thanks_amount": ""
  },
  {
    "author": "@imaginationrange1724",
    "comment": "bhai shab indian gaming industry revolution",
    "super_thanks_amount": ""
  },
  {
    "author": "@dalec2274",
    "comment": "only one scene ? seems good tho",
    "super_thanks_amount": ""
  },
  {
    "author": "@rahaman1992",
    "comment": "I'm Definitely playing it Brother !!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@QTGAMINGREAL",
    "comment": "Is this inspired by SEKKIRO?",
    "super_thanks_amount": ""
  },
  {
    "author": "@bhanuteja3916",
    "comment": "i love the gameplay and its quiet good some better changes should might help  like animations, enemy ai  make this tough no problem , and mostly  important thing is making smooth  optimization ..todays games are lacking in  optimization ...i am expecting a lot  more ahead hope this game would not disappoint\r\n us after release....",
    "super_thanks_amount": ""
  },
  {
    "author": "@Dexter_Diesel",
    "comment": "Abe yaar police ko bad light me kyu dikhate hai sab",
    "super_thanks_amount": ""
  },
  {
    "author": "@arnavjoshi5319",
    "comment": "Hi, not to be pessimistic, but the movement does feel a little sloppy…. The graphics are quite good… BUT the main thing making games good for people is the story and playing experience. I hope this will be patched in the main build. KUDOS to you for leaping forward so much",
    "super_thanks_amount": ""
  },
  {
    "author": "@yeslifer5",
    "comment": "So you just remade SEKIRO, but worse? why would anyone play this?",
    "super_thanks_amount": ""
  },
  {
    "author": "@Average_Gamer-k4b",
    "comment": "I don't know why i feel that the combat is inspired or copied by Sekiro Shadows die twice",
    "super_thanks_amount": ""
  },
  {
    "author": "@RamboShow123",
    "comment": "very proud of you \nbrother",
    "super_thanks_amount": ""
  },
  {
    "author": "@roybhaiopsingh",
    "comment": "will definitely purchase this game...but please optimize it well.  at last optimization is criticised the most",
    "super_thanks_amount": ""
  },
  {
    "author": "@mas6830",
    "comment": "bro made an indian sekiro clone",
    "super_thanks_amount": ""
  },
  {
    "author": "@ParthSharma-r7i",
    "comment": "Souls like Dharavi edition",
    "super_thanks_amount": ""
  },
  {
    "author": "@Blue-God",
    "comment": "Just played Hitman III—disappointed by how Mumbai was shown as nothing but slums and filth and you are doing the same. Is it an RPG ? if not that why there is a boss fight ?  If you're aiming for better representation in future projects, I can help with story, map, and character design BTW I am dispointed even kids are going better with unreal 5",
    "super_thanks_amount": ""
  },
  {
    "author": "@utkarshmishra7574",
    "comment": "It is unfortunate that most probably this effort will also fizzle out like the others before it, due to lack of support and funding, I hope I'm wrong.",
    "super_thanks_amount": ""
  },
  {
    "author": "@aswinkalex7275",
    "comment": "Tbh this does not look high quality nor does it look primed to be released next year. (Yes I’m taking into account that its a pre-alpha build)\n\nUnoriginality is such a turn off.\nI’m just gonna pretend I didn’t see the amount of copy paste game mechanics i saw in just TWO fucking minutes of gameplay cos this is giving me second hand embarrassment.\n\nSomeone pin my comment for me to come back and shit on this again when it inevitably bombs next year (I genuinely hope I’m wrong about this)",
    "super_thanks_amount": ""
  },
  {
    "author": "@LM35-1.44",
    "comment": "Indian studios keep releasing the trailers but never the actual game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@AoozarU",
    "comment": "It's too much 'inspiration' from Sekiro, and killing civilians and cops in slums is in poor taste.",
    "super_thanks_amount": ""
  },
  {
    "author": "@godrixrex",
    "comment": "This feels skiro with Indian touch, but hope it's also contains a Good storyline with gameplay. Hopes high, waiting for lunch",
    "super_thanks_amount": ""
  },
  {
    "author": "@Yeah-d7e",
    "comment": "well i've got a lot of things to say but firstly great work you guys the bg art is absolutely mind blowing and the overall quality remains quite good but still i don't like the theme of the game being ethnic which in case of india rises many problems and the the attack animations looks kind of old fashioned like the old souls games even though there is still many places and time for improvement but still as this is a indie project it has got many chances to improve in the future",
    "super_thanks_amount": ""
  },
  {
    "author": "@SungJinwoo-v7h",
    "comment": "Is this multiplayer? If not then ddude ....",
    "super_thanks_amount": ""
  },
  {
    "author": "@K_OS_Gaming",
    "comment": "Attack animation needs work sound effects during fight add some shake when you hit enemy should react when he gets hit.. if not it looks like you're slicing through air",
    "super_thanks_amount": ""
  },
  {
    "author": "@beastpggamer",
    "comment": "Nice work super excited for this but please work on character mechanics still there is something mission which is not looking right also please put up a good story hoping for the beast game from india",
    "super_thanks_amount": ""
  },
  {
    "author": "@Lilmoreluv",
    "comment": "Ayyy can’t wait 🇮🇳",
    "super_thanks_amount": ""
  },
  {
    "author": "@Spikeeshortss",
    "comment": "Bro that is something I want to see from a long time (plz don't make it only for India make it for the world",
    "super_thanks_amount": ""
  },
  {
    "author": "@devanshumangal07",
    "comment": "Bhai I respect the 3d models scanning and their finishing but please use some original game mechanics, please donot use the sekiro game mechanics as it is, at these stage maybe you can do something but please if you are doing it, do it originally and properly.",
    "super_thanks_amount": ""
  },
  {
    "author": "@siegkaiser",
    "comment": "Why not medival india?",
    "super_thanks_amount": ""
  },
  {
    "author": "@onlyforyou9999",
    "comment": "Many many congratulations  brother",
    "super_thanks_amount": ""
  },
  {
    "author": "@ripslinger17",
    "comment": "make sure price of the game is justified, so that everyone can enjoy the game. (it is a suggestion )",
    "super_thanks_amount": ""
  },
  {
    "author": "@LavaTyrant",
    "comment": "Someone show this to Zanny",
    "super_thanks_amount": ""
  },
  {
    "author": "@aliveoceans",
    "comment": "The game looks visually stunning and the gameplay seems quite engaging—great work to the team!  However, I’d like to share a serious concern about the portrayal of the final villain. His appearance, especially with the tilak and vibhuti (sacred ash) on his forehead, strongly resembles that of a Hindu priest or devotee.\n\nI understand the intention might be to depict a Ravana-like character, but in reality, these symbols are worn by countless peaceful and devout Hindus as part of their spiritual practice. Using them to represent evil risks promoting harmful stereotypes.\n\nFrankly, if this were done by someone unfamiliar with Indian culture—say, a foreign developer—it might be seen as ignorance, misunderstanding, or even bias. But when something like this is created by Indians, in India, it becomes deeply disappointing and shameful. Our own creators should know better than to misrepresent sacred traditions for dramatic effect.\n\nI hope future portrayals will handle cultural and religious symbolism more responsibly. Looking forward to seeing how the game evolves.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Bisu_NEET",
    "comment": "Thats so bad man at the end you have shown a pandit as a................Can you do the same for muslims also...??",
    "super_thanks_amount": ""
  },
  {
    "author": "@dosomethingunique001",
    "comment": "There will be a huge problem in optimising the game in future....",
    "super_thanks_amount": ""
  },
  {
    "author": "@anisha5322",
    "comment": "Not a gaming person but this definitely gave goosebumps!!! Looking forward to it🫶",
    "super_thanks_amount": ""
  },
  {
    "author": "@cartoonnation3764",
    "comment": "this better be open world game",
    "super_thanks_amount": ""
  },
  {
    "author": "@Perrytheplatypes",
    "comment": "I would love if you take criticism qnd improve on it , although it looks ok , it can improve greatly",
    "super_thanks_amount": ""
  },
  {
    "author": "@javyyadav8447",
    "comment": "Bro thank u sooooo muchh for this",
    "super_thanks_amount": ""
  },
  {
    "author": "@brawlera6738",
    "comment": "11:22 no way us jains got recognition for the first time in gaming history. Thank You Varun bhai",
    "super_thanks_amount": ""
  },
  {
    "author": "@arttrixs8049",
    "comment": "Been following Varun for a while—truly inspired by the effort and vision behind this game. As a UE5 dev with 2 years' experience, I’d love to contribute to this journey. Would be an honour to join the team! Could you please guide me on how to apply?",
    "super_thanks_amount": ""
  },
  {
    "author": "@Hellospeedfanpage",
    "comment": "won my heart \nyour team s genuienly doing great work \nreally appriciate it bhai",
    "super_thanks_amount": ""
  },
  {
    "author": "@Nixerman",
    "comment": "Since you deleted the feedback comment, this game will flop big time. And you'll never know why it flopped because you deleted the feedback and you don't like to listen to the people who want to help you. Ciao.",
    "super_thanks_amount": ""
  },
  {
    "author": "@SakaidoValo2099",
    "comment": "Why is every indian media just based on religion can't we think of any other concepts",
    "super_thanks_amount": ""
  },
  {
    "author": "@n3xus49",
    "comment": "People who are sending him money are either dumb or haven’t played a single pc games in their entire life.",
    "super_thanks_amount": ""
  },
  {
    "author": "@NivOfc",
    "comment": "OHHHH MYYY GOD quite literally.",
    "super_thanks_amount": ""
  },
  {
    "author": "@copycatyt4840",
    "comment": "appreciate the effort but the game looks like sekiro die twice",
    "super_thanks_amount": ""
  },
  {
    "author": "@anigame-kun",
    "comment": "Bro as a suggestion add pls also add more wepon like  kurumi kuhkari also bro I will suggest you to add more fighting techniques came from India or out of the India also also make and PC little bit duffer to defeat them don't make them too strong so it is difficult for us to defeat otherwise game will be irritating but make them little bit offered to defeat them also add more techniques to npc and for us Main character to unlock them",
    "super_thanks_amount": ""
  },
  {
    "author": "@NavtejYt",
    "comment": "excellent work of art just need some extreme touches and we are good to go",
    "super_thanks_amount": ""
  },
  {
    "author": "@Ghost_IND",
    "comment": "Hey Varun, \nI always had the same idea and wanted to do something similar but lack of funds and skillset I couldn't do it. Bu tnow seeing you and the whole video my spark is ignited again. I do not have the skillset to contribute to the same in game making or other stuff but I can help in user experience as in Alpha, Beta or any level of testing or bring in the prospective from a gamer's standpoint! Let me know if I can contribute in some sense, I really want to do something and be a part of it...",
    "super_thanks_amount": ""
  },
  {
    "author": "@darshkotak1354",
    "comment": "Great look in the game  would suggest u to change the surrounding to  to  be either futuristic or a of past like 1970 or something  swordas a wepon is not looking suitable with the time line or make the wepon looks a  bit diffrent an d futuristic  as to enhance the experience . Would love to buy your game on launch",
    "super_thanks_amount": ""
  },
  {
    "author": "@AakashKale27",
    "comment": "Hey Varun is the best effort I've seen from india... And just because I know you guys are amazing I'd want to give my 2cents on what can be done better... Referring to the footage I've seen.. the assets are photorealistic but the characters look cartoonish so, if you can make alittle more believable that will be great ! Secondly the animations, they are quite half baked which I expect from a early preview but please just don't make it another sandbox with a copy pasted souls formula... Add your own flair to the combat system and please get these animations right.",
    "super_thanks_amount": ""
  },
  {
    "author": "@rohannayak3827",
    "comment": "DAMNNNN so good we got a better indian game before GTA  6",
    "super_thanks_amount": ""
  },
  {
    "author": "@chetanchacharkar3626",
    "comment": "I really want to support your work and appreciate your work with donating some money but don't have but I promise when the game come out I'll buy it and play.\n\nAs a PC I'm emotional watching these clip I am wish you best of luck for future.\n\nYou're better than the other indian so called aaa game which build the hype but not up to mark of they promised. \n\nWish you luck for future most of us PC gamers are waiting for the game. \n🫠🫡",
    "super_thanks_amount": ""
  },
  {
    "author": "@SHIBOMCHOWDHURY",
    "comment": "Can we play in Mobile?",
    "super_thanks_amount": ""
  },
  {
    "author": "@ralspeno",
    "comment": "In your next project try creating fictional gods, pantheons, spiritual systems and mythologies like Tumbaad, Solo Leveling, Dragon Ball Z because when you create something original, you have the freedom to explore these characters in new ways that fit your narrative, without the burden of respecting existing beliefs or traditions. It allows you to dive deeper into the psychological, emotional, and moral aspects of these beings, which can lead to richer, more engaging stories",
    "super_thanks_amount": ""
  },
  {
    "author": "@Ujjwal9078",
    "comment": "Comment box:- \nDonation box:- ️\nSome advice from my side :- However, the game is good but i like the scene where the player finally fighting with main boss that boss fighting was something unique other than those normal gundaas \n\nso u should fix the players fighting style becoz he only fight with the same basic moves you should add some more moves and do something that players can fight with different weapons too just think about it \n\nand also give some more characters too so that players can choose on their own preferences and style atlast add some building too or you can choose the location where a lot of greenery present.\n\nThanks for trying to make atleast one is trying their best lots of love",
    "super_thanks_amount": ""
  },
  {
    "author": "@Marshall_Law",
    "comment": "Looks good but the mechines looks a lot like sleeping dog with some different effects and that shrine way too similar to sleep dogs shrines, i want this to be different from the crowd but I don't know where they are heading. Good luck",
    "super_thanks_amount": ""
  },
  {
    "author": "@hemant5718",
    "comment": "Nice effort but you made no effort towards making an original and new game, gameplay and physics wise.",
    "super_thanks_amount": ""
  },
  {
    "author": "@magsapp4819",
    "comment": "just go abroad first week of releasing this",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheChillGamerr",
    "comment": "Sadly, this will just die in production or be done with a 1 hour demo not a full game.\n\nThanks for trying though. Looks great but would have been good if it would ever come out as an actual game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Himan3huGaur",
    "comment": "let folks talk, you do what you do. if you can ship this things will only get better",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhakamath915",
    "comment": "I hope you achieve success in your life!",
    "super_thanks_amount": ""
  },
  {
    "author": "@phazer_6469",
    "comment": "Could go insanely hard but icl It feels like the world is too modern for there to just casually be soulslike combat to just be happening in the background.",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheSouravvideos",
    "comment": "This is such a great job done.",
    "super_thanks_amount": ""
  },
  {
    "author": "@vikashdigarse1256",
    "comment": "i am sure that the charcter is inspired from krishna/vishnuji, but why do you show them sky blue in colour when the were black.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Harshit-j5f",
    "comment": "Why add mythology in every game",
    "super_thanks_amount": ""
  },
  {
    "author": "@shubhamdebnath9752",
    "comment": "its a bad game...plz try to improve.\ndelivering this game frm india will lead bad impression on foreign gamers.\nassets r not rendering \ngameplay looks laggy\ngraphics is not everything.\nFIX the game",
    "super_thanks_amount": ""
  },
  {
    "author": "@bhavyachiwda930",
    "comment": "Make sure Varun maya ,  please don't hype . Please don't say \"we are doing hardwork\". Please don't make us emotional fool. Please don't repeat MUMBAI GULLIES Failed history. Please don't focus on Graphics. Please  Don't become Overconfident. Please don't sell your product on the country name 🇮🇳. Please don't represent your game as SO CALLED INDIA'S FIRST. please don't jump happy without full work. Please don't do overhype. Please  don't disrespect Indian developer. Please first learn honestly and ground to earth  values. Please don't make  your game fail with your SO CALLED HARD WORK. EVERY DEVELOPER DO HARDWORK. Please don't make fake  fame. Please don't make fake one day popularity. Please focus on game mechanics. Please optimize your game. Please make your game able to play everybody.  Sabke paas PC or PS5 jese chize nhi Hoti. Please don't do if you can't. Please don't stop from quality working. I HAVE NOT ANY HATE, par me yeh nhi chahta ki joh barbadi  MUMBAI GULLIES ke sath hui hai, wo tumhe bhi jhelnu pade.",
    "super_thanks_amount": ""
  },
  {
    "author": "@hareshgamer8990",
    "comment": "it's ok to inspire from sekiro, but never ok to completely copy it",
    "super_thanks_amount": ""
  },
  {
    "author": "@sakshambhatia9715",
    "comment": "Loved this, the presentation could be improved though!",
    "super_thanks_amount": ""
  },
  {
    "author": "@kiminoadachi6499",
    "comment": "eww what is this just make a mobile game at this point yall cant do what needs to be done for today gaming industry just focus on ya religious stuffs n stay in that damp corner",
    "super_thanks_amount": ""
  },
  {
    "author": "@HarshKumar-gh9uc",
    "comment": "I hope it do not meet the same fate as adipurush",
    "super_thanks_amount": ""
  },
  {
    "author": "@Siyam_Ahmed_3",
    "comment": "All I can say is, the combat is just a cheap copy of Sekiro. I mean, the deflecting, deathblow, and even the Mikiri symbol — they’re all here",
    "super_thanks_amount": ""
  },
  {
    "author": "@JATIN_09ok",
    "comment": "Where can I download",
    "super_thanks_amount": ""
  },
  {
    "author": "@MisterPallav",
    "comment": "broo the is looking insane",
    "super_thanks_amount": ""
  },
  {
    "author": "@Rudra_om",
    "comment": "jitna refine kar sakte ho kar lo koi bhi jaldi mat karo jitna Samay Lo Sahi karne ke liye control achcha karne optimise karne ke liye mechanism acche karne ke liye animation ke liye interactive aur attractive banane ke liye \n\nGamers se feedback log critics se feedback Lo jitna Samay Le paoge Lo 27 mein 28 mein launch karo Koi dikkat nahin Hai Lekin perfect Karke karo jitna ho sake",
    "super_thanks_amount": ""
  },
  {
    "author": "@ABHI9AV",
    "comment": "this is crazyyyyyyy",
    "super_thanks_amount": ""
  },
  {
    "author": "@AmazingCentury",
    "comment": "Good luck to u",
    "super_thanks_amount": ""
  },
  {
    "author": "@aditya4075",
    "comment": "Hell yeah! will buy it no matter what. lol i dont have my gaming laptop now still for the frickin sake of having this masterpiece i will buy it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Toffeebaba",
    "comment": "Thank you sir for this hope this will boost the game development industry",
    "super_thanks_amount": ""
  },
  {
    "author": "@jord5612",
    "comment": "Just one suggestion, please get rid of the indian background or use some himalayan or jungles kinda setting like far cry 4. The indian city background feels very off.\n\nI know it's gonna be alot of hardwork but then the game will have immence potential to go beyond the borders",
    "super_thanks_amount": ""
  },
  {
    "author": "@_bio",
    "comment": "so basically you have a parry system like sekiro, and a dodge roll mechanic like ds? PLEASE balance the game and make it hard enough because with those mechanics you'll basically be un-hittable.",
    "super_thanks_amount": ""
  },
  {
    "author": "@shashwatshrey9248",
    "comment": "Great stuff!",
    "super_thanks_amount": ""
  },
  {
    "author": "@abcdefgh6121",
    "comment": "Game looks really good. Just a small issue that when the person waves his hand ove rhis head. his hand goes insid ehis head. That is a small glitch.\nEdit:- The movement also looked a bit janky. I mean fps looked pretty low.",
    "super_thanks_amount": ""
  },
  {
    "author": "@RahulKumar-ft8lv",
    "comment": "ya black myth wukong ka vibe kyu de raha?",
    "super_thanks_amount": ""
  },
  {
    "author": "@NRchillin",
    "comment": "Sekiro se sword ️  chalana sikhi hai",
    "super_thanks_amount": ""
  },
  {
    "author": "@johnwickv3277",
    "comment": "How come i didn't know Sekiro got a DLC , jk but i really appreciate your efforts bro and i am greatly looking forward to playing this game. This is probably gonna be the first game that i will buy.",
    "super_thanks_amount": ""
  },
  {
    "author": "@rggaming7194",
    "comment": "Sponser kr dena merako.the first game i play and start the channel",
    "super_thanks_amount": ""
  },
  {
    "author": "@Flare2K2",
    "comment": "i hope the focus has been on the combat itself before tackling things like story and appearance, and by the looks of it, it seems to be the case, animations look great but now only a bit of clunkiness and optimisation needs to be done imo, good luck!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Anditech-w9h",
    "comment": "Please check the expressions when cut seen character face",
    "super_thanks_amount": ""
  },
  {
    "author": "@goten787898",
    "comment": "leh mumbai gully pe pura moot diya isne toh",
    "super_thanks_amount": ""
  },
  {
    "author": "@ARMOESTAN",
    "comment": "nice work dude there is a little resident evil touch hope this would be a great game i would like to be a videogame developer make the game more photorealestic im  16 year old",
    "super_thanks_amount": ""
  },
  {
    "author": "@inbuiltablecrow7553",
    "comment": "DAMN! .. I tried to avoid watching this trailer cause from the thumbnails it looked like another wannabe gta clone.. BUT HECK! didn't expect a souls like to pop out instead! \nLet me guess, you guys took inspiration from Black myth Wukong, and thought why not represent India in the same way, BUT during the gameplay and (Especially) in audio department I'm smelling a little bit of LIES OF P!!  (Anyone else does too?) (One of my most favorite games of all time though, so I was equally shocked and happy when the 'sword clash' sounded pretty familiar! ) \nThe environment looks Uncharted 4 remastered level (which is amazing!), though the animations sure look ps2 level (no offense, I know it's a very early build), guess it'll take atleast 2 years to polish all that out. \nThough, I would really prefer if you take all the time you guys require to polish it like a diamond, instead of hurrying and putting like out all those buggy, glitchy, abominations we were getting from real 3A studios .\n\nYou guys are right... If you can pull this off, I can finally see other Indians getting a confidence boost, and who knows, maybe we'll get our own Soul's aside, Wukong or stellar blade by 2030?\n\nI don't know if you guys will read my comment or not, but I'd like to wish you guys all the best from my bottom of my heart!! Please make it awesome!! . \nI'm so excited for this game to succeed, that I'll even try to support through YouTube superchat (Never done before!), when I get my pocket money!\nKeep it up and have a great day!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Vaishnav5880",
    "comment": "Keep it up bhaiya",
    "super_thanks_amount": ""
  },
  {
    "author": "@contestDecode",
    "comment": "I know you wanted people to see the real and most genuine trailer of the game but sometimes you should not go too much towards showing whats the game is going to look or feel 90 percent of the time , but should show the most precious or exciting moments 10 percent of those moment , cuz at the end of the day people are going to play and to see and feel that 10 percent , so you should promote that 10 percent , cuz trailer and walk through are two different things , \n\nBut yes one advantage of underselling a really good product is , the real marketting becomes word of mouth , and everyone loves to be the one to reveal the most underrated game to their group",
    "super_thanks_amount": ""
  },
  {
    "author": "@Omgadage07",
    "comment": "Some people advertise idea first and make worst games like faug but his game is different. I hope Mumbai gullies also be as per my expectations.",
    "super_thanks_amount": ""
  },
  {
    "author": "@codermehul",
    "comment": "Saw that you're using Tilaks of various sampraday's in the game as it reflects our culture but saw the enemy was having it but the player doesn't if you guys haven't added that for him please consider giving the player also some tilak (vaishnav, shaiv aur shakt ) according to the story, if done then thank you.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Shinchannohara143",
    "comment": "Fan ho gya bhai me tera",
    "super_thanks_amount": ""
  },
  {
    "author": "@thed3vil",
    "comment": "background music kaphi low h",
    "super_thanks_amount": ""
  },
  {
    "author": "@HarshRaj-is1hz",
    "comment": "Camera angle and movment is little weird",
    "super_thanks_amount": ""
  },
  {
    "author": "@callsign.alcatraz",
    "comment": "When this games come out I'm buying it",
    "super_thanks_amount": ""
  },
  {
    "author": "@ARJUNKMISHRA-f5r",
    "comment": "Finally a World Class Indian Game ,,,  PROUD OF YOU BHIYA",
    "super_thanks_amount": ""
  },
  {
    "author": "@BeanOnTheFlipside",
    "comment": "It's okay I guess. I don't see myself playing this ultra kill + dark souls esque game with realistic graphics.",
    "super_thanks_amount": ""
  },
  {
    "author": "@sujitwarrier4857",
    "comment": "People won't buy genuine games like Raji. But this modified UE sample project. Idiots will throw money at. Any realy gamer will tell you this looks like a scam.",
    "super_thanks_amount": ""
  },
  {
    "author": "@rohitPLAYS0x1",
    "comment": "less gooooooooooo, i am super excited",
    "super_thanks_amount": ""
  },
  {
    "author": "@keshav9261",
    "comment": "I dont know but i feel like this is a reskin of black myth wukong or maybe im tripping",
    "super_thanks_amount": ""
  },
  {
    "author": "@spongtas2774",
    "comment": "This game... THIS GAMEEEE!!!! I will buy this game and will not let my friends pirate this",
    "super_thanks_amount": ""
  },
  {
    "author": "@DIESHEN",
    "comment": "lets see how this one goes",
    "super_thanks_amount": ""
  },
  {
    "author": "@iama.k1080",
    "comment": "I wish expressions were more dynamic like dante",
    "super_thanks_amount": ""
  },
  {
    "author": "@15anshulkumar",
    "comment": "Damnnn, excited",
    "super_thanks_amount": ""
  },
  {
    "author": "@3972kenildhameliya",
    "comment": "i really appreciate your quality of the game but you have to make best storyline best characters best environment and aslo work on your gameplay to make your game best aslo make unique animations of your gameplay combination make unique and special your game i am definitely supporting you if you do that",
    "super_thanks_amount": ""
  },
  {
    "author": "@Masterkb7",
    "comment": "thats crazy i cant wait to play this !!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@kgamingzone1223",
    "comment": "Pls get some story inspiration from assassin creed , something like more mystery, mythology. India definitely might have potential in that sector.",
    "super_thanks_amount": ""
  },
  {
    "author": "@SiddhantMishraGD",
    "comment": "Hey Varun. Where Can I wishlist the Game. Kindly setup a Steam Page . This will get the Game wishlists. Wukong Launched with 400000 wishlist and hence very successful",
    "super_thanks_amount": ""
  },
  {
    "author": "@thewatcher1947",
    "comment": "Keep some muzzIim villain characters for authenticity and originality. Make it stand out in the crowd of leftist media",
    "super_thanks_amount": ""
  },
  {
    "author": "@whypoharry",
    "comment": "ngl the prototype looks greattttt",
    "super_thanks_amount": ""
  },
  {
    "author": "@CartManBrahhhhh",
    "comment": "This looks like something you would cook up to fool investors who dont really know anything about quality game design. Graphics can easily fool these type of people. And some gamers too, sad.",
    "super_thanks_amount": ""
  },
  {
    "author": "@randomriddle539",
    "comment": "Indian games ke graphics itne bekar hote hain ki khelne ka maan hi nahi karta free mein bhi aur upar se faltu naam rakhte hain wo alag",
    "super_thanks_amount": ""
  },
  {
    "author": "@kkbad4009",
    "comment": "Also, upload a video in Hindi, not for me but for the audience of India, hope you understand.",
    "super_thanks_amount": ""
  },
  {
    "author": "@_bio",
    "comment": "YO WHAT THIS GONNA BE HARD WW",
    "super_thanks_amount": ""
  },
  {
    "author": "@HarshKumar-gh9uc",
    "comment": "One thing i can say is dont care about age rating kids are not going to be playing this game anyways",
    "super_thanks_amount": ""
  },
  {
    "author": "@pcgenarts",
    "comment": "hire me, I have great idea, I love vfx, graphics and I'm good at it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@as_records_17",
    "comment": "Speechless bro  just awesome",
    "super_thanks_amount": ""
  },
  {
    "author": "@xunchann",
    "comment": "5:30 Starting\r\n\r\nAs the game has maintained such high quality environment and realism in its surroundings I (not speaking for others) personally would expect  to see more things be logical and consistent, Some might say why am I expecting logics in game, games aren't real, things are very much made up in it. Then here is the timestamp 12:30 where Varun himself talks about how they care about little details like window, handle of auto and scooter & so, to fix the imperfections. When such little detail matters then I think battles and interaction of the character with other things should also have same consistency to make sense. I hope this comment is taken as constructive criticism because if devs are talking about quality and perfection I think as a user I have the ability to criticize about it as well.\r\n\r\n6:20 The ground is wet and muddy, how come the character is running on a wet ground making no noise and sneaking up on enemy what sort of stealth is that? It would make more sense if enemy was more aggro and not just walking around with no sense of danger.\r\n\r\n6:45 again if you look at the environment it is very much real looking, but the blood looks totally cartoonish as its some RPG game, painted on top of scene, you can pause your video around this timestamp and see how inconsistent things are.\r\n\r\n8:51 The cutscene, finger of the boss enemy looks like noodles as it has no bones, too long and thin as compared to whole size of the boss enemy itself same for the other side of arm, looks deformed inconsistent size and shape \r\n\r\nOverall the map seems very narrow and small, 5-6 enemy after just few steps in game and then a boss fight?\r\nIf there was even 3-4 lines of story telling it would look and feel much better, hopefully in official teaser things will make more sense.\n\nAnd now some brutal inputs, pehli baat toh I don't understand why all Indian devs or creators khudka product launch karke emotion selling kyu karte hai? Indian culture ko represent karna hai but aisa kya character ko dhoti dediya villains are some ruthless civilians and bad police men? and thoda religious Ramayana or Mahabharat ke story ki touch dedo or emotion selling hojayegi kisi god ke avatar ko showcase kardo kya hai ye sab no matter how high quality the game is made in what's the point of it when the same typical mistake continues which other industries failed to fix as well",
    "super_thanks_amount": ""
  },
  {
    "author": "@itsyourbro5023",
    "comment": "Kudos !!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@BASTARFILMS97",
    "comment": "Game name",
    "super_thanks_amount": ""
  },
  {
    "author": "@avragegamer69",
    "comment": "I have a LOT of respect for u guys. But i can advice u to not to OVERDO graphics as a small team but spend this time and money on the STORY and the GAMEPLAY.",
    "super_thanks_amount": ""
  },
  {
    "author": "@suryavivek4873",
    "comment": "Some Elements inspired from Sekiro Like Shrine temple, Deflect Kill I guess But I like This.....",
    "super_thanks_amount": ""
  },
  {
    "author": "@AyushDixitFromUP",
    "comment": "MoCap done or not?",
    "super_thanks_amount": ""
  },
  {
    "author": "@SasmiVerse",
    "comment": "Hope this blows up, in a good way ofcourse Good luck",
    "super_thanks_amount": ""
  },
  {
    "author": "@Anybodyeverybodysomebody",
    "comment": "This looks like unreal engine slop",
    "super_thanks_amount": ""
  },
  {
    "author": "@Raveend9",
    "comment": "Sekiro in India hell yeah ...Good luck u guys",
    "super_thanks_amount": ""
  },
  {
    "author": "@rahulpatil3942",
    "comment": "Please implement some USP mechanics and a good story + gameplay loop to make it worldwide game and not just india based.",
    "super_thanks_amount": ""
  },
  {
    "author": "@miteshparmar4977",
    "comment": "Bravo!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@photoshopwithpeter8412",
    "comment": "You nailed it bro",
    "super_thanks_amount": ""
  },
  {
    "author": "@Iblamearnav",
    "comment": "i really love the game, cant wait to try it out, but it kinda feels like sekiro.",
    "super_thanks_amount": ""
  },
  {
    "author": "@prashantshukla6814",
    "comment": "Really coool looking gameplease dont miss out on game design though",
    "super_thanks_amount": ""
  },
  {
    "author": "@tHeCloud55",
    "comment": "why you wanna fight the police and gangs at the same game?",
    "super_thanks_amount": ""
  },
  {
    "author": "@NeerajKomatishetti",
    "comment": "Sorry to say this but, One thing I don’t like about it is using SLUMS, i mean they could have shown real villages from rural areas with beautiful landscape. If they truly care about the game being an international success stop showing india in bad light. at-least try to change perception of india.",
    "super_thanks_amount": ""
  },
  {
    "author": "@animemania99",
    "comment": "really looking forward for this game",
    "super_thanks_amount": ""
  },
  {
    "author": "@animcold",
    "comment": "In future I want to get in your team",
    "super_thanks_amount": ""
  },
  {
    "author": "@Fawaz.grapher",
    "comment": "You have done a great job brother, at least any Indian has brought a good game",
    "super_thanks_amount": ""
  },
  {
    "author": "@Richie-mi9lj",
    "comment": "Looks so much boring and dull. I will definitely not recommend this game to others",
    "super_thanks_amount": ""
  },
  {
    "author": "@hansadipsaha4442",
    "comment": "This is actually good",
    "super_thanks_amount": ""
  },
  {
    "author": "@xgas.hurried9894",
    "comment": "good job, but it js seems like an elden ring and wukong fusion.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Venomous69",
    "comment": "Relying on Nanite to compensate high poly count of photo scanned objects? I thought devs knew about the drama going around unreal's fake optimization tricks and gimmicks.",
    "super_thanks_amount": ""
  },
  {
    "author": "@pushkarajdesai893",
    "comment": "Waiting for india GTA that will be end of all games",
    "super_thanks_amount": ""
  },
  {
    "author": "@melmanoi2788",
    "comment": "I can feel my graphic card crying",
    "super_thanks_amount": ""
  },
  {
    "author": "@shadow_1011sd",
    "comment": "Hey sir, how about if you collaborate with Anjaniputra Games, although the company isn't that big, but i suppose you will really, really like and love their work, i suppose.\n\nEdit: Try Talking to them",
    "super_thanks_amount": ""
  },
  {
    "author": "@Harsh-Panwar",
    "comment": "why this game trailer look like Sekiro game but 144p quality not for graphics and the game combat and parry mechanics",
    "super_thanks_amount": ""
  },
  {
    "author": "@kingcobra24100",
    "comment": "@VarunMayya Null Game is far better than this right now.",
    "super_thanks_amount": ""
  },
  {
    "author": "@lgassassin5794",
    "comment": "Why the movement seems stiff and awkward",
    "super_thanks_amount": ""
  },
  {
    "author": "@bhaskarsarkar8944",
    "comment": "it is really amusing how stereotypically u made the villain wear traditional hindu preacher with the deliberation of him look a like brahmin. really sh@me on u.",
    "super_thanks_amount": ""
  },
  {
    "author": "@karanhatagale-fr8zj",
    "comment": "13:27  Keep it up  our country more beautiful and great history places, please later add them also",
    "super_thanks_amount": ""
  },
  {
    "author": "@howresolve",
    "comment": "Game name - kalyug",
    "super_thanks_amount": ""
  },
  {
    "author": "@Koro_Sensei_",
    "comment": "I think why we can't make a profitable game for the indian market other than a mobile game is infrastructure of the people, as in most teens or indians don't have a powerful enough laptop or a pc which they can afford,\n\nI mean sure we have become more progressive where indians have become a bit more financially secure enough to afford it but most still don't, why would they put money into something when they don't have a high paying salary , how to eat healthy,  how to not die of the heat , how to help the family or support the family, how to support a wife and the family, how will you make a family for yourself and take care of your parents. Will you have enough time, \n\nNow this is for most , but yes financially indipendent people have grown a lot in india doesn't mean they make the majority of indians. \n\nYou're already studying till 24 -26 you need experience to get anything in this life and no one is willing to provide you that even if you beg for the most parts. By the time you earn enough its 30 and past gotta marry and a family both work take care of things sleeping would be a vacation.\n\n\nWhat im trying to say most adult indians would have a lack of free capital, lack of expendable time without compromising other things , you've gotta dedicate time for this, while mobile games are quick , prota ble and free to download and play.\n\n\nI have no clue why im typing this nor am i the said things above yet . Im just gonna say im supporting this by commenting and liking this , i won't be able to play this game until i get a pc gaming set up with graphics processing , i just have a asus tuf laptop thats handling current games. Ammm yes , gopd job guys hopefully we have enough people with financial support to help you guys on the prmotional adventure and indian rise of gaming technology",
    "super_thanks_amount": ""
  },
  {
    "author": "@ActionSpidey",
    "comment": "damn brother you made a banger",
    "super_thanks_amount": ""
  },
  {
    "author": "@Mihir_Lakdawala",
    "comment": "Good job and keep it up,Making game is not easy thing, when we have start from scratch and limited money limited resources and very expensive skill man and software.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Danny_ragnarok",
    "comment": "dude, the game has potential. just take help from any good combat game maker that would help us and u a lot.  dont cheap out on this please.",
    "super_thanks_amount": ""
  },
  {
    "author": "@whitequill89",
    "comment": "Can u like change the shrine concept to something original",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheAlgorithmMM",
    "comment": "Only 8 month?? Really bra??",
    "super_thanks_amount": ""
  },
  {
    "author": "@Shortpedia-z5r",
    "comment": "It looks great i hope the story of it also good️",
    "super_thanks_amount": ""
  },
  {
    "author": "@AV7DANGER",
    "comment": "INCREDIBLE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@sanjayjoshi754",
    "comment": "feels like a reskined sekiro",
    "super_thanks_amount": ""
  },
  {
    "author": "@Flake52",
    "comment": "Yes go go go. Keep going",
    "super_thanks_amount": ""
  },
  {
    "author": "@hrithikpujaras1085",
    "comment": "Nah that ain't it bruh its too stereotypical tf",
    "super_thanks_amount": ""
  },
  {
    "author": "@Its_frenzy_shorts",
    "comment": "Jo clips tumne dikhaye hain, woh thode realistic toh lag rahe hain, lekin natural bilkul nahi lagte. Aisa lag raha hai jaise random assets ko ek saath daal diya gaya ho bina proper composition ke — pura 3D environment ek cluttered scene jaisa lag raha hai. Haan, tumne 3D scan technology use kiya hai, but models abhi bhi utne polished nahi lag rahe ki unhe ek high-quality ya so-called AAA game mein use kiya ja sake.\n\nAnimations bhi bilkul vibe ke saath match nahi kar rahe — unmein polish ki kami hai aur woh kaafi unprofessional lag rahe hain. Overall movement aur transitions mein koi proper flow ya consistency nahi dikh raha.\n\nAur sabse important baat — tumne ab tak gameplay mechanism ka ek bhi part dikhaya nahi hai. Jab tak woh clear nahi hota, tab tak hum game ke core experience ke baare mein kuch bol hi nahi sakte.\n\nThoda environment design refine karo, animations ko improve karo, aur gameplay ka thoda glimpse dikhana start karo — tabhi log fair opinion de paayenge.",
    "super_thanks_amount": ""
  },
  {
    "author": "@coolshoulin7868",
    "comment": "BROOO I M A PC GAMER AND PLAYING PC GAMES SINCE WIN 98 ..LIKE DEMORASH ALLADIN ETC TO COD ADVANCE WARFARE..IN THIS GAME I IT FEELS LIKE U HAVE MASHUPED CONCEPTS FROM FAR CRY PRIMAL AND ASSASSIN'S CREED..I APPRICIATE UR EFFORTS AND EFFORTS FOR ARRANGING FUNDS BUT BRO SHOULDN'T WE COME UP WITH SOME NEW IDEA..I HAVE SOME THOUGH...GOOD GRAPHICS IS NECESSARY BUT NOT ENOUGH",
    "super_thanks_amount": ""
  },
  {
    "author": "@pranjalshukla8096",
    "comment": "I am hoping you and your team do great\nbut but but\nplease take in all the criticism you can and dont expect the game to be massive success overnight from the very first game you make,\nother Asian studio from Japan, Korea, China etc, made gacha games - kept on improving their game continuously there is no shame in earning few buck by showing a sexy lady if the game is great, (I know its not possible in India) take any gacha game for example\nif not take any Final Fantasy game (final fantasy 1 through 16) for example to name a few, (or the most recent Stellar Blade for example)\nAll I want from you is, put your best effort in the game, do not set the game in the slums, do not fall into the stereotype trap if possible, \nI know you are making a difference in the Indian game market, I do not want you to fail\nbut do not even compare this with the likes of souls game, or wukong,\nI would also urge you to make a single player-story telling game in the future as well, any setting like Project IGI, Unchartered, and arcade game..... etc.\nNow Battlefield and COD (without the multiplayer alone is a big ask),\nI hope you find this input in some capacity useful,\neveryone, including those who are criticizing this, have very high hope that this succeed.\nbest wishes",
    "super_thanks_amount": ""
  },
  {
    "author": "@harleyquinn4110",
    "comment": "Its great but please don't use lord as gaming pawn in this please  god isn't just for destruction so that u can use it like a gaming pawn please  please don't disrespect it",
    "super_thanks_amount": ""
  },
  {
    "author": "@bookslibrary4469",
    "comment": "Indian sekiro?",
    "super_thanks_amount": ""
  },
  {
    "author": "@Trenchomi",
    "comment": "Sekiro Indian version",
    "super_thanks_amount": ""
  },
  {
    "author": "@zahidmilck",
    "comment": "Bhai isme koi story hogi ki bus only villan se Fight karni padigi but the game is so good full realstic fell",
    "super_thanks_amount": ""
  },
  {
    "author": "@perspectivei",
    "comment": "tell me where to support you . we will fund it",
    "super_thanks_amount": ""
  },
  {
    "author": "@hypro8547",
    "comment": "bhai india ke naam par is ghatia game ko mat market kar kyuki ye ek gobar chap game hai bhai indian gamers ke standard boht high hain . \nbhai india mein boht ache game bante hain like raji , fears to fathom but still we dont have a aaa game which we need and this game is not that aaa game it is a game which a 5 years old kid will be denying to play bhai mene sekiro elden ring dono khele hain bhai hollow knight 3 logo ne banai thi aur vo teri iss tatti game se 1 crore saal age hai bhai tu bas india ka naam leke ek ghatia game ko market kar raha hai aur tu hamari itni mahan ramayan jisne hame itna kuch sikhaya hai tu usse bhi barbad karne chala hai bhai tujhe combat par dhyan lagana chahiye kyuki agar tujhse story achi nhi bani fir bhi game badhiya hogi aur graphics jinhe tu itna acha bata raha hai vo ekdam tatti hai ye game mein bhi wahi unreal engine 5 wali feel hai jo mujhe nilkul achi nahi lagti mene teri wukong wali video dekhi tu keh raha tha ki game ki marketing achi hui hai isliye game ne records tode bhai tu pagal wagal hai marketing to sucide squad ki bhi hui thi par vo game chali nhi kyuki wo tatti thi ye crazzy stuff nhi hai ye tatti stuff hai tu kehra hai ki 70 percent game is complete bhai sun day 1 se chalu kar aur tu stereotype ko aur increase kar raha hai bhai hum slums mein nhi rehta bhai hum apne gharo mein rehte hain with gaming pc please take my advise",
    "super_thanks_amount": ""
  },
  {
    "author": "@techyguyaditya",
    "comment": "Looks better than black ops 6",
    "super_thanks_amount": ""
  },
  {
    "author": "@Wizard_of_failures",
    "comment": "Damn the game looks good and kinda souls like I hope you keep the scope not too big and make it a linear experience rather than being open world looks good obvs needs improvement but this is the step towards right direction and I usually pirate games but I won’t pirate this one I’ll definitely buy it you should definitely try keeping it at 30 USD or 1500 or 2k INR but anyway whatever the price I’ll pay why? Because this is the steps we need to take so someday we can make our own black myth level game keep going love this love you guys don’t give up",
    "super_thanks_amount": ""
  },
  {
    "author": "@DHINCHIKZ2D",
    "comment": "Full support",
    "super_thanks_amount": ""
  },
  {
    "author": "@indrayuddroychowdhury6016",
    "comment": "satyajit ray type stuff, amazing",
    "super_thanks_amount": ""
  },
  {
    "author": "@husseinmazhar8572",
    "comment": "This is copying a little too much from black myth wukong",
    "super_thanks_amount": ""
  },
  {
    "author": "@Purnojit",
    "comment": "Durning Boss fight it should be mud splashing  , i saw when ever heavy attack is throw dust is windring",
    "super_thanks_amount": ""
  },
  {
    "author": "@researcher5066",
    "comment": "Looking forward to playing it",
    "super_thanks_amount": ""
  },
  {
    "author": "@rhranjithkumar34",
    "comment": "Crazy crazy crazy",
    "super_thanks_amount": ""
  },
  {
    "author": "@lalitagautam2975",
    "comment": "Best game inzoi sea bhi acha pls is game ko mobile phone mea bhi dalna aur vo bhi free  jisse apka downloaders zada honge",
    "super_thanks_amount": ""
  },
  {
    "author": "@debroy2441",
    "comment": "We are expecting future from u varun",
    "super_thanks_amount": ""
  },
  {
    "author": "@Glupmany",
    "comment": "title change kr diya na aukaat dekh ke",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhilashsarma9241",
    "comment": "LET'S GO",
    "super_thanks_amount": ""
  },
  {
    "author": "@dmsc7250",
    "comment": "Crazy man I am going to play this game whenever it releases first tell me from where you buy the shirt which are you wearing",
    "super_thanks_amount": ""
  },
  {
    "author": "@Alpha-nf3it",
    "comment": "Supporting u brother",
    "super_thanks_amount": ""
  },
  {
    "author": "@AjayGupta-d3z8q",
    "comment": "Is this game sekiro inspired mann I would love to buy this",
    "super_thanks_amount": ""
  },
  {
    "author": "@nishantgarg8895",
    "comment": "Built for world and rule the world",
    "super_thanks_amount": ""
  },
  {
    "author": "@Acotic12",
    "comment": "sekiro ke mechanism copy kerke Indian theme pe daal diya lo ban gya game",
    "super_thanks_amount": ""
  },
  {
    "author": "@Rudra_om",
    "comment": "8:13 Even if you make some changes(low) to the graphics, improve these things.\n\nHere the player is attacking the enemy So the clothes of the enemy should be damaged and the body of the enemy should have internal organs which should be exposed And look at the blood coming out from there it looks like GTA 3Graphics: Even if you run it in full high quality on a good graphics card But when it comes to an average gamer, he will not have such good playability in high quality and his FC will also not be much.And inside it will just feel like playing Tekken 3 in HD Work a little on it, like making it more compatible with the environment and attacking it, and on its clothes and all this, work a little on it I know it hasn't been completed yet, but 20-30% or whatever, it is complete. But still there is work to be done on these things because the better these things will be, fighting skills, fighting animations, taking damage, interaction with the player, with NPP, with the enemy, with one's own body You will enjoy the game play just as much Even if you make some changes(low) to the graphics, improve these things.",
    "super_thanks_amount": ""
  },
  {
    "author": "@veerabhadraprasadr9886",
    "comment": "This game screamed GOD of WAR, Genshin impact and the over all Feelings of, India is entering the AAA gaming industry.  <3 Love the energy you made me feel. I love you guys, hope it all goes well <3",
    "super_thanks_amount": ""
  },
  {
    "author": "@swanayagupta",
    "comment": "That's is good now india need show we cange that not ever done before.  We gathering our team to build largest ai echo system in India. #ripkaai",
    "super_thanks_amount": ""
  },
  {
    "author": "@skullkraken_resurrected9857",
    "comment": "Looks good but need more polishing",
    "super_thanks_amount": ""
  },
  {
    "author": "@codersgaming4191",
    "comment": "ab to mujhe ps5 lena pdega, maine ek friend se bola tha, yedi mai play station lunga tab , tab pehle indian developer ka top game khelunga, but wo world benchmark par sahi rhe. na ki koi bhi game,",
    "super_thanks_amount": ""
  },
  {
    "author": "@PrafullaKhilar",
    "comment": "Is it a game or movie",
    "super_thanks_amount": ""
  },
  {
    "author": "@Hypher_TD",
    "comment": "The game looks amazing but is it just me or the main character reminds me of Ishaan Khatter @VarunMayya",
    "super_thanks_amount": ""
  },
  {
    "author": "@Bakchodedits12345",
    "comment": "What  you are doing is just jaw dropping Sir i would love to buy this game when it will be release Its actually pretty good.Hats off to you sir",
    "super_thanks_amount": ""
  },
  {
    "author": "@aadiwart2352",
    "comment": "It's cool the all but i would love some fantasy elements in the environment cause it's just to bland and looks like it's copy pasted multiple times which I hope it's not. I'm not a souls like enjoyer but the I can atleast can tell that the environment and the enemy design doesn't match with the  magic and stuff the player is using. It's a souls like so there has to be fantasy elements in there otherwise it's just a cheap copy I'm sorry",
    "super_thanks_amount": ""
  },
  {
    "author": "@AmogSus-g6h",
    "comment": "Indian Sekiro",
    "super_thanks_amount": ""
  },
  {
    "author": "@Pain237_",
    "comment": "Kash Ek moba game hota onmyoji arena jaisa \nIndia me to bahut saare figures hai games me add karne ke liye..",
    "super_thanks_amount": ""
  },
  {
    "author": "@nikhilvardhantawania4591",
    "comment": "Please try to show authentic story of Ramayana and use books of Geetapress for references",
    "super_thanks_amount": ""
  },
  {
    "author": "@KevixMultimedia",
    "comment": "Why does the guy at 7:15 is looking like \"Hindustani Bhau\"??",
    "super_thanks_amount": ""
  },
  {
    "author": "@GAJENDRASINGH-t9t",
    "comment": "The first bosss and only 1 pattern it will be too easy to defeat him lol",
    "super_thanks_amount": ""
  },
  {
    "author": "@cineshots2674",
    "comment": "BHAI YAR SEKIRO KA MINI VERSION LAG RAHA HAIN GAME  WOH HI POSTURE WALA MECHANISM BLOCK AND DODGE SIMILAR FINISH STYLE SAME IDOL THAT YOU CAN DO REST AND ALL  AND VERY FEW MOVESET  OF THE BOSS THAT HAVE SHOWN  I AM SORRY BUT I HOPE THIS GAME WILL DO REALLY WELL",
    "super_thanks_amount": ""
  },
  {
    "author": "@DaltoN512",
    "comment": "this would be amazing if it was 2019, but for 2025, do better this looks so bad",
    "super_thanks_amount": ""
  },
  {
    "author": "@Vashneya",
    "comment": "It should be interactive too like foot prints and stuff",
    "super_thanks_amount": ""
  },
  {
    "author": "@akshatmangal8251",
    "comment": "I didn’t like the slow-motion dodging animation(not as good as wukong) and the hair-flicking pose doesn’t suit it either.\n\nFirst impression is not so good not so bad with game mechanics",
    "super_thanks_amount": ""
  },
  {
    "author": "@samthedude2025",
    "comment": "I appreciate your work but people has to focus on showing the defects in this game because trust me people will notice stuff you will never see while you develop. So I hope you playtest this game with different types of gamers. And also focus on making a good game not \"India' s first ___\" game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@kapilaparmar9248",
    "comment": "Indians also can make",
    "super_thanks_amount": ""
  },
  {
    "author": "@swlchl",
    "comment": "Let me preface this by saying I'm so glad someone's decided to take India a step forward into the gaming industry, and the effort you and your team have put into this is undeniable... but at least in its current state, from what was shown in the trailer, the game's mechanics seem very derivative of Sekiro: Shadows Die Twice, to the point of being a borderline clone, and I find it disheartening that despite putting an incredible amount of effort into the art, assets and world, you've taken such a derivative approach to your gameplay. From the mechanics to even the animations and indicators, everything about the combat shown in that trailer looks like it was reskinned from Sekiro, and for the first AAA game from India to be a Sekiro reskin really doesn't sit right with me... I hope you can still take the game in a different direction because I'm really excited about its prospect, but this is not the way to go about designing your core systems.",
    "super_thanks_amount": ""
  },
  {
    "author": "@harshaggarwal9205",
    "comment": "If you are looking for a full stack developer, then please give me a chance in your organization. I can do good work for your organization.",
    "super_thanks_amount": ""
  },
  {
    "author": "@nightlifewarriorsgamerz8044",
    "comment": "Sujjesting add a story why he is fighting for like u can add scene first like for revenge he is fighting or any other reason pls mention in that game",
    "super_thanks_amount": ""
  },
  {
    "author": "@Thinkerikyk",
    "comment": "Best of luck ️ and tell me if u want any help but no money",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheRealNSgaming",
    "comment": "Sekiro ku bnaya jab mehnat kr hi rahe the to gameplay v alg rakhte sab kuch mst hai bs ye gameplay style sekiro se lena thik nhi",
    "super_thanks_amount": ""
  },
  {
    "author": "@youonlyliveonce1988",
    "comment": "took me only a few secs to realize that the game mechanics are similar to sekiro.. i hope this game is not a ripoff of sekiro with just a different environment!!!!!!!!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@kingofkings2027",
    "comment": "GTA mumbai got real.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Nar7976",
    "comment": "Why are we so obsessed with religion",
    "super_thanks_amount": ""
  },
  {
    "author": "@yashsharma6112",
    "comment": "It looks really good",
    "super_thanks_amount": ""
  },
  {
    "author": "@karthikraj9394",
    "comment": "Not gonna lie this looks stupid",
    "super_thanks_amount": ""
  },
  {
    "author": "@JustPlayer_One",
    "comment": "bro believe me it's not good!!!......... gameplay is very bad, individual assets looks good ofc, but all of them together just doesn't match, the composition and blending is very bad. Also random enemies are spawning man, i mean there are police then some thugs... i mean very random. And most importantly Gameplay sucks, also you are compromising the performance just for some little graphical enhancements. And do not use again again that it is a AAA game because it looks good!!! WTH!!... Games are not about graphics",
    "super_thanks_amount": ""
  },
  {
    "author": "@fun_g",
    "comment": "commenting for reach big ups yall",
    "super_thanks_amount": ""
  },
  {
    "author": "@maulikshah28",
    "comment": "Great effort!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Godzillaaa2788",
    "comment": "Broooo idea is good but souls like games gives more ancient or futuristic vibe but this and after attacks there is blood and they are people atleast there should be some type of monsters with a story",
    "super_thanks_amount": ""
  },
  {
    "author": "@miketyson4153",
    "comment": "Bhai blood over dikha dia sword se attack karne par ekdam se itna blood nhi niklta. Or kapdo par blood effect, blood drops bhi dikhao player or enemies dono k. Blood concept k lie  Assassin's creed dekho blood effect thoda fake type lag raha he. Baki to bohot acha he",
    "super_thanks_amount": ""
  },
  {
    "author": "@shourya1995",
    "comment": "well the game looks very good the animation and gameplay but the concept you are using too weird  killing peoples  with blood splash in a slum which will make people to actually believe india is dirty which is, but only in some most of the citys are clean and i would recommend that you should make your game like ancient india scenenary(like eldin ring but ancient india environment) showing indian temples and enemies rakhash from mahabharat. I would rate  the gameplay 7/10 (fighting system can more good ) animation 8/10(make it more smooth) concept of environment 2/10(its just pain to watch). And also i know how hard is to make games but im just giving you perspective of a gamer who is giving 2-3k for a game.For last optimize your game from the start and keep testing your game on a average gamer pc",
    "super_thanks_amount": ""
  },
  {
    "author": "@brownzoomer",
    "comment": "please don't present the game with this art style and setting. The whole point of souls-like is a fantasy setting. india has great mythology and fantasy literature that you can pull from. The semi-realistic setting you made for the game you looks very janky and comedic, rather than serious",
    "super_thanks_amount": ""
  },
  {
    "author": "@MrDecom002",
    "comment": "This is actually pretty good. Like sekiro.",
    "super_thanks_amount": ""
  },
  {
    "author": "@StrikerShot11",
    "comment": "Title is changed",
    "super_thanks_amount": ""
  },
  {
    "author": "@amanpatnekar123",
    "comment": "This is going to crash and burn so badly..omg wow",
    "super_thanks_amount": ""
  },
  {
    "author": "@gamernerd7139",
    "comment": "By the way you guys should target game content reviewers like Asmongold to get some traction once you reach a cohesive game play implementation likely beta. Could push more interest in the global gaming community!",
    "super_thanks_amount": ""
  },
  {
    "author": "@thelunatiK",
    "comment": "Good Quality But plot story Like using Avtaar for \"Gali ke Gunde\" feeled like forced",
    "super_thanks_amount": ""
  },
  {
    "author": "@STAFIN_1",
    "comment": "That's crazy",
    "super_thanks_amount": ""
  },
  {
    "author": "@rickyjohnson1342",
    "comment": "It's a great project i look forward for it being released. read the words in caps to get a ummary\nBut i want to point out SOUND DESIGN \nI think that really needs work. The slash doesn't feel impactful the gun sounds very good but the other weapons not so much . I think best sound design in a game is sifu(of a similar genre) \nIn seikiro, hear the metal cling sound when you parry perfectly and I see a lot of seikro in it but i think the target lock in a person needs to be toggle switch like in jedi fallen order. By default target lock should be off.\n\nThe environment is great but the AMBIANCE feels all over the place ,(just check sifu, each level  has a theme even with respect to colours too(if I'm not wrong they use Analogous colors in each level) \nLies of p colour is blue with a dark environment\nRight now from what you showed it looks like a mundane day in India. Lastly CHARACTER MODELS especially the mc NEED WORK.\n\nI still wish you ALL THE BEST.",
    "super_thanks_amount": ""
  },
  {
    "author": "@nitishtripathi3838",
    "comment": "Good now make it run on a Mobile",
    "super_thanks_amount": ""
  },
  {
    "author": "@TusharSharma-xc7rz",
    "comment": "This game is giving so much alike vibes of sekiro i guess the mechanics and base game idea is same but to be honestly everything is just like sekiro just watch it's gameplay you will know but kudos even doing this take time and effort no hate please make some different thing out of it and not just like sekiro...looking forward with the storyline and environment and world building stories...Guys who played sekiro will get it please back me up here...",
    "super_thanks_amount": ""
  },
  {
    "author": "@piyushbhargav1940",
    "comment": "Great effort. Graphic and gameplay looks good but ....... WHY SLUMS.",
    "super_thanks_amount": ""
  },
  {
    "author": "@SidwinOrig",
    "comment": "08:28 that's really cool. What about a wink? Would that be too much maybe?",
    "super_thanks_amount": ""
  },
  {
    "author": "@RamiT_DeY",
    "comment": "The transformation at 8:59 was B E A U tiful..",
    "super_thanks_amount": ""
  },
  {
    "author": "@pratikray7542",
    "comment": "Stop focusing on fidelity for now. Try to build better animations and combat that makes you feel the hits you take or make. Fidelity can come later, game play is what matters. Also don't just do what lies of P or other soulslike games have already done. Try to innovate new mechanics that suit our Indian culture. That is easy to say and hard to do but just my thoughts.",
    "super_thanks_amount": ""
  },
  {
    "author": "@_Jatin_sharma",
    "comment": "Bro ho sake toh try karna ki isko gta jesa open world game bana sako",
    "super_thanks_amount": ""
  },
  {
    "author": "@LootVortex",
    "comment": "Fake nothing  just grafix hone se game accha nehi banta",
    "super_thanks_amount": ""
  },
  {
    "author": "@55dXY",
    "comment": "Just focus on the story and the gameplay bruhh lets just not focus on the graphics first",
    "super_thanks_amount": ""
  },
  {
    "author": "@Herobrine-fk5cv",
    "comment": "See first of all you need to optimise the game and capture the motion fluidity of the game secondly the npc and the main character looks emothionless.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Bombay_wali_clips",
    "comment": "Religion based games suck I can see this failing",
    "super_thanks_amount": ""
  },
  {
    "author": "@sskamble6758",
    "comment": "What Raji isn't first?",
    "super_thanks_amount": ""
  },
  {
    "author": "@dashtar",
    "comment": "The character in the game does not look good. I mean there are better looking Indians.",
    "super_thanks_amount": ""
  },
  {
    "author": "@arvindmack2718",
    "comment": "Bro what a quality gg",
    "super_thanks_amount": ""
  },
  {
    "author": "@aditya1043",
    "comment": "sekiro but in slums",
    "super_thanks_amount": ""
  },
  {
    "author": "@rakshitsihag6471",
    "comment": "Bro ye Black myth wukong ki copy lag rhi h. Character ke movement aur vo checkpoint , Checkpoint ka UI, it also progresses like black myth wukong: first some weak opponents then a boss fight.\n[But end part of the trailer was impressive. 9:02 ]",
    "super_thanks_amount": ""
  },
  {
    "author": "@as_records_17",
    "comment": "Very exited for this",
    "super_thanks_amount": ""
  },
  {
    "author": "@PrafullaKhilar",
    "comment": "8:28  wow that slow motion cut",
    "super_thanks_amount": ""
  },
  {
    "author": "@vishaldeepak2538",
    "comment": "This looks really good",
    "super_thanks_amount": ""
  },
  {
    "author": "@yashodhangupta3742",
    "comment": "This is crazy ️‍",
    "super_thanks_amount": ""
  },
  {
    "author": "@AmeenThecoolguy",
    "comment": "bruh don't hipe it with word and disappoints us on launch , it better to just act than talk",
    "super_thanks_amount": ""
  },
  {
    "author": "@DarSik10",
    "comment": "gameplay feels like sekiro like. nice",
    "super_thanks_amount": ""
  },
  {
    "author": "@anigame-kun",
    "comment": "Bro likh ka lalo agar is ma thoda s aur kam vagina to yah game ghost of Sushma Jaisa Ban Sakta Hai Thoda Aur open world karne ki jarurat hai aur stories add karne ki Shayad game Mein To story Hogi jahan tak hai but apart from these side the game is still awesome I can't believe this is made in India",
    "super_thanks_amount": ""
  },
  {
    "author": "@RicckDennis",
    "comment": "Hope it doesn't turns something like MUMBAI GULLIES (a fake promise).",
    "super_thanks_amount": ""
  },
  {
    "author": "@kjd4053",
    "comment": "would love to be a beta tester :)",
    "super_thanks_amount": ""
  },
  {
    "author": "@arjun-mavonic",
    "comment": "I Love RPG games, the 3rd asset looks realistic. I don't like too much Indian mythology. I am a fan of The Wither 3 and Cyberpunk. I guess this is built on Unreal Engine.",
    "super_thanks_amount": ""
  },
  {
    "author": "@DivjyotSinghsaini-xe8cc",
    "comment": "All the things are crazy but the is this what we really are a\n south Indian movie plot btw game seems great",
    "super_thanks_amount": ""
  },
  {
    "author": "@OccupyMars_1",
    "comment": "Amazing",
    "super_thanks_amount": ""
  },
  {
    "author": "@Nevermind-k5r",
    "comment": "This game is completely trash looks like a 2005 game lol.",
    "super_thanks_amount": ""
  },
  {
    "author": "@HarshRajan-k7l",
    "comment": "really great work very exited.....but i think that even if you slightly decrease the graphic quality n improve the games mechanics and emotions on character's face it would become way better......still i am just stunned by this",
    "super_thanks_amount": ""
  },
  {
    "author": "@Hades-t9t",
    "comment": "if this is souls-like game whare ios the stamina bar",
    "super_thanks_amount": ""
  },
  {
    "author": "@r.b.609",
    "comment": "Wait its inspired from Sekiro one of my favs :D",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheAlgorithmMM",
    "comment": "Or bhai sekiro se inspired lag rae??",
    "super_thanks_amount": ""
  },
  {
    "author": "@RK_Khushal",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@aluu2778",
    "comment": "indian sekiro?",
    "super_thanks_amount": ""
  },
  {
    "author": "@vmwsree",
    "comment": "looks from 2019",
    "super_thanks_amount": ""
  },
  {
    "author": "@Omgadage07",
    "comment": "Game must be bug free",
    "super_thanks_amount": ""
  },
  {
    "author": "@subratakumarmalik123",
    "comment": "Thank you so much",
    "super_thanks_amount": ""
  },
  {
    "author": "@hypersuman2925",
    "comment": "Please change those anti characters they don’t look good at all and also those police men.. The way these opponents are standing in a queue fells like we are playing some old school Mario or something.. I mean the game is fabulous it’s awesome considering how it’s made but still these elements are making it a little dull.. I really want this game to succeed.. You can keep those villains a little gang members type instead of those halwai police and marathi  As a gamer I’m saying sir please change those and also the intensity of the game cause if I see even also an assassin’s creed in comparison our game looks too simple and kiddish",
    "super_thanks_amount": ""
  },
  {
    "author": "@mohitchauhan3255",
    "comment": "Just normal day in slums of India",
    "super_thanks_amount": ""
  },
  {
    "author": "@shyamchauhan3527",
    "comment": "Ye puri duniya ko dikhana chahte hai ki india me only jhopdi hi hai... I don't know the motive for this 2 rupees ghatiya aur colourless game.. but itna pta chalta hai ki in logo ne delhi city gurgaon city nhi dekha ye chahte hain ki game ke through log ye dekhe ki india kitna garib hai hai... Even some anime aur cartoon bhi ye nhi dikhate jo ye dikha rhe hain trailer me... I know tech aur morden india dikhana inke bas ki nhi hai so lets hope ki utna ghatiya game na ho jitna trailer me dikhaya gya hai..",
    "super_thanks_amount": ""
  },
  {
    "author": "@Clasher-ops",
    "comment": "This game is not looks like 60-70% complete, creating hype before release it,..adat si hogyi sari Indian developers ki...Bhai game ka mechanism mei dhyan do graphic k naam par sriff game nhi chalega,aur aya game mobile jhel sakta ki nhi woh alaga doubt ... although I'm not hate this game,just saying game mechanics badhiya honi chahiye, * ak jaga character ko lag rha hai aur blood nikal rha hai kisi aur jaga se* best of luck...",
    "super_thanks_amount": ""
  },
  {
    "author": "@yashberiwal7877",
    "comment": "Looks like a college project.  LOL!",
    "super_thanks_amount": ""
  },
  {
    "author": "@Blacknight28791",
    "comment": "now Ai is in danger",
    "super_thanks_amount": ""
  },
  {
    "author": "@yuggstudio",
    "comment": "Another just talks .. thing ! Bewakoof banaao.. abhiyaan",
    "super_thanks_amount": ""
  },
  {
    "author": "@IND_train_SIM_STUDIO",
    "comment": "Biggest challenges optimise",
    "super_thanks_amount": ""
  },
  {
    "author": "@cyberakyplays5094",
    "comment": "wow I came after trailer review from Zassar and the things that he said and other youtubers ohhhhhhhhh get ready for some backlash and good luck your game need some luck cause its running out of it . Youtubers soon address you as the next Nikhil Malankar who scammed all the gamers of India and forgot about international purchases if this is the scenario.",
    "super_thanks_amount": ""
  },
  {
    "author": "@retros.pection",
    "comment": "this is very risky, a team of new indian devs trying to make such a game, trying to bring indian myth to light\ni want to see it succeed, but\nit's very very rough right now, so i hope you don’t deny the criticisms coming your way\n\nthe animations, first up, very clunky, not impactful at all\nsound design doesn’t help either\ncharacter movement looks like it’s trying to copy bmwk, but it’s just not there yet\nthe riposte animation too, yeah, doesn’t look great\nthe boss just seemed to repeat attacks too, which isn't great\n\nart direction, the environment looks good in parts, but some elements feel inconsistent\ncolors are weird, washed out in one place, oversaturated in another\natmosphere/ambience is just... missing\nlevel design too, kind of lackluster\n\nvoice acting? needs heavy work\n\ni can’t offer any solutions, i’m not a dev (yet) but i’ve been playing games since forever,\nand ngl, i wouldn’t enjoy what i’m seeing in the alpha right now\nhoping it evolves from here, into an actual good game\nprops to the devs, goodluck",
    "super_thanks_amount": ""
  },
  {
    "author": "@MasterXender",
    "comment": "Sekiro with mods",
    "super_thanks_amount": ""
  },
  {
    "author": "@Akira_drafts",
    "comment": "Animations are bad and i understand its a \"pre alpha build\", but why is it feeling like a SEKIRO copy. Make it feel original in terms of gameplay cause alot of indian games just focus of graphics.",
    "super_thanks_amount": ""
  },
  {
    "author": "@announcing_reality",
    "comment": "11:09 sahu tea centre is personal",
    "super_thanks_amount": ""
  },
  {
    "author": "@kavyar6465",
    "comment": "Bahi  elden Ring ki indian copy hai",
    "super_thanks_amount": ""
  },
  {
    "author": "@CheesyParth",
    "comment": "Dude, this game looks like a 2nd hand copy of Sekiro, from the combat to even the finisher. Choppy gameplay to using trash character models. I hoped better from you Varun",
    "super_thanks_amount": ""
  },
  {
    "author": "@slappy_chimp",
    "comment": "hmm doesn't look high quality to me",
    "super_thanks_amount": ""
  },
  {
    "author": "@sameeersm",
    "comment": "Ai no ai doesn’t make a difference to end user",
    "super_thanks_amount": ""
  },
  {
    "author": "@SaurabhKumar-ee6dj",
    "comment": "8:59 #UPGRADING LVL 2",
    "super_thanks_amount": ""
  },
  {
    "author": "@KuldeepSingh-hv1vz",
    "comment": "Sorry to say but don't copy  please, it's not crazy and good enough for gamers , it's goona be troll tbh by your  sekiro fight scene, wukong temples for reset, and dark soul also involved, what are you want to do guys , there is no logic to making this type of illogical gameplay games!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@JoginderSingh-ko6fw",
    "comment": "body proportion of characters seem off to me. They are looking dwarf",
    "super_thanks_amount": ""
  },
  {
    "author": "@FRUSTRATEDATHARV8989",
    "comment": "what a game bro my mind blown's up",
    "super_thanks_amount": ""
  },
  {
    "author": "@ritaprasadsinha6554",
    "comment": "Lets goooooo",
    "super_thanks_amount": ""
  },
  {
    "author": "@SM-td4vz",
    "comment": "Why have you shown a brahmin as a villain?",
    "super_thanks_amount": ""
  },
  {
    "author": "@mindourown4604",
    "comment": "7:06 I like this one, death blow from SEKIRO",
    "super_thanks_amount": ""
  },
  {
    "author": "@unib4324",
    "comment": "Dude less talking more showing game footage",
    "super_thanks_amount": ""
  },
  {
    "author": "@p41n8",
    "comment": "lowkey badly reskinned sekiro wtf T.T",
    "super_thanks_amount": ""
  },
  {
    "author": "@Kartik-fv4vo",
    "comment": "Environments are great and I'm liking the Sekiro inspirations, but character models definitely need more work. I'm also a bit doubtful about the story's direction, since it seems to be yet another Kalki story, which can be executed well of course, but has become kind of overdone imo. Too early to make any big judgments just yet, though. I'm honestly surprised you got this far in just 8 months and have it slated for release next year already when typical development cycles take 4-5 years these days. I can clearly see a LOT of passion here, I just hope it's allowed to cook to perfection before we get to sink our teeth in. We're gamers, we'll wait!",
    "super_thanks_amount": ""
  },
  {
    "author": "@smitnemade685",
    "comment": "Tilak lagwa lo warna backlash aayega",
    "super_thanks_amount": ""
  },
  {
    "author": "@aryanthakur7657",
    "comment": "GREAT GOING",
    "super_thanks_amount": ""
  },
  {
    "author": "@riteshk9879",
    "comment": "₹1000.   Is it free to play",
    "super_thanks_amount": ""
  },
  {
    "author": "@Ins0mniacGamer",
    "comment": "bros just tryna be souls gta creed. nahhhhh make something simpler on unity rather than UE asset flips that are hardly gonna run on anyone's machine.",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhiwabhi",
    "comment": "This is gonna be amazing",
    "super_thanks_amount": ""
  },
  {
    "author": "@sanju.2541",
    "comment": "It's  amazing",
    "super_thanks_amount": ""
  },
  {
    "author": "@pajamagod_yt3694",
    "comment": "thank u dude",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheASDGamingYT",
    "comment": "Really? 12:46",
    "super_thanks_amount": ""
  },
  {
    "author": "@premvishwakarma5947",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@AdityaKumar-py2fd",
    "comment": "8:27 that was so freaking crazy",
    "super_thanks_amount": ""
  },
  {
    "author": "@cyrus2306",
    "comment": "The setting doesn't feel very soulslike. It's like you're making this game for the sake of making a game, there is no real passion it looks very forced. You could've used an ancient indian setting with so many mythologies just lying around you could've used some as a starting point. I don't want to fight policemen and then goons right after lol",
    "super_thanks_amount": ""
  },
  {
    "author": "@aminsyedwww",
    "comment": "While China developed Wukong, here we have this shit.\n\nTo top it off, they had to make it such an obvious and cheap knockoff of Souls/Elden Ring. Do something original ffs! Individual modders have developed better mods for games than this piece of crap. It's DOA already.",
    "super_thanks_amount": ""
  },
  {
    "author": "@AnitaKanwar-uh8bp",
    "comment": "Only one weapon in this game",
    "super_thanks_amount": ""
  },
  {
    "author": "@genuineprofit5107",
    "comment": "11:13 it’s not a Game it’s Real",
    "super_thanks_amount": ""
  },
  {
    "author": "@GamingBooDance",
    "comment": "Kya baat h",
    "super_thanks_amount": "₹449.00"
  },
  {
    "author": "@Footy_Facts1",
    "comment": "mocked techburner",
    "super_thanks_amount": ""
  },
  {
    "author": "@cesar95790",
    "comment": "Huge respect from Pakistan",
    "super_thanks_amount": ""
  },
  {
    "author": "@yuitrigger",
    "comment": "No a.i.! Let's go!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@ArSa-qx5dr",
    "comment": "I don't like the sound effect",
    "super_thanks_amount": ""
  },
  {
    "author": "@Shyamal_desai",
    "comment": "Excited",
    "super_thanks_amount": ""
  },
  {
    "author": "@YASHXd",
    "comment": "Sekiro ??? Mumbai ????",
    "super_thanks_amount": ""
  },
  {
    "author": "@HistoryLover-q1l",
    "comment": "How is it a soul's like game ? The enemies are using guns and the environment is modern era , and you plan to launch in 2026 ?? And you tell us 1 year before ?? Please stop telling until you really ready to launch the game ...bcz before you there were several so called indian games which were announced in 2020 but still not launched ...they scammed us ...somehow it looks like prince of Persia copy ... Do better ...I am a hard core gamer and i am still not impressed...need multiplayer souls like Indian game based on mediaeval on ancient theme not modern theme and single player ..no no no !",
    "super_thanks_amount": ""
  },
  {
    "author": "@Achieve_NEET",
    "comment": "Keep shining",
    "super_thanks_amount": ""
  },
  {
    "author": "@kidocreates",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@swiss8943",
    "comment": "zassar ki video mat dekh lena galti se",
    "super_thanks_amount": ""
  },
  {
    "author": "@agenthitman4779",
    "comment": "Well I hope this doesn't dissapoint like the mumbai gullies shit",
    "super_thanks_amount": ""
  },
  {
    "author": "@ooogabooga5111",
    "comment": "making money out of religion, got it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@aidenpierce1731",
    "comment": "Hey brother I can also help u out in this game development if u need it!",
    "super_thanks_amount": ""
  },
  {
    "author": "@SujalWaghdhare",
    "comment": "Bhai Super",
    "super_thanks_amount": ""
  },
  {
    "author": "@Casualhaibhidu",
    "comment": "Varun️️️️",
    "super_thanks_amount": ""
  },
  {
    "author": "@theculturedman049",
    "comment": "use the mythos of india like wunkong did for china",
    "super_thanks_amount": ""
  },
  {
    "author": "@aashishchandra7468",
    "comment": "desi sekiro",
    "super_thanks_amount": ""
  },
  {
    "author": "@spidy3540",
    "comment": "souls like mmmmmmmmmmm very good choices",
    "super_thanks_amount": ""
  },
  {
    "author": "@stalintondale1009",
    "comment": "Omg this looks sooo good",
    "super_thanks_amount": ""
  },
  {
    "author": "@m.i.bcastel5285",
    "comment": "JAKE NULL KA TRAILER DEKH",
    "super_thanks_amount": ""
  },
  {
    "author": "@techheaven4531",
    "comment": "I love this game release date please",
    "super_thanks_amount": ""
  },
  {
    "author": "@Smokey_aep",
    "comment": "So Black Myth Wukong but Indian nice try but you're gonna get sued",
    "super_thanks_amount": ""
  },
  {
    "author": "@abdullahrashid6460",
    "comment": "A+ for effort",
    "super_thanks_amount": ""
  },
  {
    "author": "@kjd4053",
    "comment": "Marvelous...",
    "super_thanks_amount": ""
  },
  {
    "author": "@The_last_hindu_nation",
    "comment": "clean kick",
    "super_thanks_amount": ""
  },
  {
    "author": "@hemantchaudhary6654",
    "comment": "Incredible!",
    "super_thanks_amount": ""
  },
  {
    "author": "@rbvlogs1844",
    "comment": "Finally",
    "super_thanks_amount": ""
  },
  {
    "author": "@arjun-mavonic",
    "comment": "I'll defiantly buy it even though I don't like too much Indian bollywood shit. But I'll buy to support Indian Game Making companies. I did buy Raji. I'll buy this one too.",
    "super_thanks_amount": ""
  },
  {
    "author": "@ro_ohitt",
    "comment": "Wish you all the best for the game and hope it is as good as you say it is. But the thing is a game is not only about its graphics. A game is so much more. The gameplay, the story, the character, the locations, the atmosphere, and much more. The game play feels very lacking. You keep talking about how much efforts went into making the assets and scaning them n etc but truthfully no one cares. You are making a game not creating a animation studio or something like that all games do it. Heck there are games that have hand drawn graphics and those games are really good and millions of people play them. So focus more on making a polished bug free game with unique combat mechanics. Also dont go about saying we worked so hard on this we did this n that so many sleepless nights wagera wagera. No one cares. All gaming studious are doing what you are doing. It is not something that is new. Also the ui really sucks and so does the sound design.",
    "super_thanks_amount": ""
  },
  {
    "author": "@techhassan1964",
    "comment": "Graphics are awesome but combat, need to much working",
    "super_thanks_amount": ""
  },
  {
    "author": "@aakashprat",
    "comment": "Realistic?\nWhere are gutkha stains",
    "super_thanks_amount": ""
  },
  {
    "author": "@eternaldharma108",
    "comment": "Remove all the hindu symbols from the villains, or make sure to have a healthy balance of islamic and christian symbolled villains too. If you are hoping to create controversy using them for more reach, trust me, it will all backfire. The game is dead on water at this point. And ramayana? seriously? with chhapri moves like we just saw? Another Adi Purush in the making.",
    "super_thanks_amount": ""
  },
  {
    "author": "@science5576",
    "comment": "Want battle royale.",
    "super_thanks_amount": ""
  },
  {
    "author": "@tajruturajjagat6179",
    "comment": "Awesome",
    "super_thanks_amount": ""
  },
  {
    "author": "@Manga-w5q",
    "comment": "ahh...i can see many defaults in game like you can add many things and i have many many ideas i love to share with you just ask here if u interested and its unlikely u find me in 5489 comments but i hope if you find my message i love to share my creativity because i have many ideas and many improvement to share",
    "super_thanks_amount": ""
  },
  {
    "author": "@xzorn2981",
    "comment": "Another game farming Indian audience. Why not try to make an actual good game which doesn't need India in its name to appeal to audience",
    "super_thanks_amount": ""
  },
  {
    "author": "@abhishekchawla7633",
    "comment": "If this took 40 \" really skilled \" people to make.. then this is just a waste of time sob story presentation ...",
    "super_thanks_amount": ""
  },
  {
    "author": "@Fritzedits09",
    "comment": "The combat style is copied from a very famous souls game it's non other than sekiro",
    "super_thanks_amount": ""
  },
  {
    "author": "@adityadas6638",
    "comment": "Looks bland swords in modern setting",
    "super_thanks_amount": ""
  },
  {
    "author": "@hmm1142",
    "comment": "Sorry to say, the Indian Government will ban it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@Cgbp14",
    "comment": "Looks like tech demo, tbh. And its gonna release in 1 year . Things dont look good.",
    "super_thanks_amount": ""
  },
  {
    "author": "@naimKhan-xx9ei",
    "comment": "Is it free or paid ??????",
    "super_thanks_amount": ""
  },
  {
    "author": "@paperslayer5888",
    "comment": "is this a barebones  sekiro ??   i like it but ill be honest this whole vid is all about graphics and 3d this 3d that.    its a gameplay talk about the gameplay more. no one cares about the tample or whatever if the game itself isnt fun.   it looks alright seems funish but remember the vast mejority of india cant even run it.",
    "super_thanks_amount": ""
  },
  {
    "author": "@sangamo38",
    "comment": "I love that we are making games in India. But this one just looks Cheap Lies of P IMO.",
    "super_thanks_amount": ""
  },
  {
    "author": "@agcrgaming7275",
    "comment": "@VarunMayya you are doing great brother but i will recommend that you change the fighting mechanism and add more mechanism to match global standards. It looks amazing but might make a little darker environment for souls like vibe . The movement can be refined too. But the textures are good . But the high polygan models gonna take alot of resources... And might keep the death body there rather then make them disappear in thin air . And you can add kicks and other weapons. The hero is stiff looking... Might make him look agile for a different vibe. \n\nThe graphics is amazing  great job\nI didn't complain but said some idea that I think might help u improving it",
    "super_thanks_amount": ""
  },
  {
    "author": "@dundun73",
    "comment": "slums dark soul, what a shame!",
    "super_thanks_amount": ""
  },
  {
    "author": "@reesun6621",
    "comment": "Total sekiro and dark soul copy, not interested. Do something new",
    "super_thanks_amount": ""
  },
  {
    "author": "@animeboii5086",
    "comment": "But whats new in this its like a choppy version of souls like games , like the attack is landing somehwere blood is coming from somewhere else , so why play this over games like elden ring s",
    "super_thanks_amount": ""
  },
  {
    "author": "@39a_siddharthdesai31",
    "comment": "great work",
    "super_thanks_amount": ""
  },
  {
    "author": "@hitanshus",
    "comment": "dil khush ho gya",
    "super_thanks_amount": ""
  },
  {
    "author": "@Pokesharpop",
    "comment": "Respect 🫡",
    "super_thanks_amount": ""
  },
  {
    "author": "@krishnarajbhosale5796",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@vinayakmishra6445",
    "comment": "IF I DONT WHO WILL  4:12",
    "super_thanks_amount": ""
  },
  {
    "author": "@Anshutabahi811",
    "comment": "Abbe youtuber log thoda paisa toh dedo audience hi itna derahi",
    "super_thanks_amount": ""
  },
  {
    "author": "@ShoeBun",
    "comment": "Nikhil malanlar ko dikhao ye",
    "super_thanks_amount": ""
  },
  {
    "author": "@lakshyasharma9718",
    "comment": "10:10 he problem is that a way you are representing in the video that others did not have courage , did  have the vision I have brought all this, that is why I will make India's first first super high quality game, , that is problematic, by building it high  like this your also  undermining the good work done till now eg -Raji: An Ancient Epic , KAMLA .  being a developer this type of statement feels bad , work on optimization and gameplay of game ( by the way best of luck your project )",
    "super_thanks_amount": ""
  },
  {
    "author": "@the420Messiah",
    "comment": "fraud.... he only used the front around environment models to fake the whole game.. this can be made under a day LOL",
    "super_thanks_amount": ""
  },
  {
    "author": "@Purnojit",
    "comment": "Uptill now Game mechanics are garbage, please don't try to compete with AAA they are at thier oen level . Try to make something far better then them",
    "super_thanks_amount": ""
  },
  {
    "author": "@sumitsingh6107",
    "comment": "LESSSSSS GOOOOO!!!!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@ValorantClipperSuke-tx2sw",
    "comment": "FUCK IT DAWG YOU'RE SO FUCKING GOATED",
    "super_thanks_amount": ""
  },
  {
    "author": "@AmanYadav__98",
    "comment": "Crazyyy",
    "super_thanks_amount": ""
  },
  {
    "author": "@DrJohar-y9u",
    "comment": "Proud of u",
    "super_thanks_amount": ""
  },
  {
    "author": "@tronix2x",
    "comment": "Wtf is this shit? Why is it in the slums?",
    "super_thanks_amount": ""
  },
  {
    "author": "@RootAccess",
    "comment": "why did you have to hire people to write code just do it using AI",
    "super_thanks_amount": ""
  },
  {
    "author": "@root6025",
    "comment": "Good but it's not having indian touch",
    "super_thanks_amount": ""
  },
  {
    "author": "@mayursah8132",
    "comment": "can upgrade gui it is felting old \nand some off vibes",
    "super_thanks_amount": ""
  },
  {
    "author": "@DeepakKumar-pl9nx",
    "comment": "Give tamil also bro",
    "super_thanks_amount": ""
  },
  {
    "author": "@erik-thespitz1776",
    "comment": "Needs more development, gameplay mechanics look pretty basic and the game is clunky",
    "super_thanks_amount": ""
  },
  {
    "author": "@adwik625",
    "comment": "Huge W man",
    "super_thanks_amount": ""
  },
  {
    "author": "@shagun.sharma",
    "comment": "Solid!",
    "super_thanks_amount": ""
  },
  {
    "author": "@deusex2823",
    "comment": "Wtf is this shit lol",
    "super_thanks_amount": ""
  },
  {
    "author": "@frnexgaming8402",
    "comment": "Jada fek mat..pese leneka tarika thora casual hai tera..",
    "super_thanks_amount": ""
  },
  {
    "author": "@ramvignesh3565",
    "comment": "Wukong?",
    "super_thanks_amount": ""
  },
  {
    "author": "@envee_ee",
    "comment": "please just publish  a trailer only vid so that we can repost it on subreddits of popular gaming streamers n other reactors for more awareness because this is the first game from India I've seen that i feel like is a game and not a collage of assets  and models and animations from the marketplace!!!!! all the very best for your success people, as a games enthusiast and a learning game developer i love people like you who are just doing what you love and not asking others to !!!",
    "super_thanks_amount": ""
  },
  {
    "author": "@ranjitbharajgaming",
    "comment": "Too Much Lagg Looks like 20 fps But Graphics Are Good",
    "super_thanks_amount": ""
  },
  {
    "author": "@jaykishantankodra6399",
    "comment": "amazing",
    "super_thanks_amount": ""
  },
  {
    "author": "@GAMINGXLIFE-z2t",
    "comment": "11:08 Blue Drums ️️",
    "super_thanks_amount": ""
  },
  {
    "author": "@hitanshus",
    "comment": "badhiya bhai",
    "super_thanks_amount": ""
  },
  {
    "author": "@VectorgamingYT0",
    "comment": "Amazing Bhaiii.. Proud of you",
    "super_thanks_amount": ""
  },
  {
    "author": "@DannyJoseph",
    "comment": "Seems like a mod for sekiro shadows die twice game, I fail to see any originality",
    "super_thanks_amount": ""
  },
  {
    "author": "@souvikgayen3560",
    "comment": "These developers come and go no proper results",
    "super_thanks_amount": ""
  },
  {
    "author": "@swarnadipmitra1095",
    "comment": "Subbed",
    "super_thanks_amount": ""
  },
  {
    "author": "@cooldjk",
    "comment": "It's great",
    "super_thanks_amount": ""
  },
  {
    "author": "@artificial_gaming12",
    "comment": "slum??",
    "super_thanks_amount": ""
  },
  {
    "author": "@bholu619",
    "comment": "The sanatan souls of India\nGraphics are cool,combat is boring,low density of plants and grappling hook is absent so no point in building a map which u can't explore(for every game in world).\nNever ever thought it to make u rich in India,it'd have to be released worldwide,in India it'd be downloaded somehow without spending a penny.\nMaybe the Indians and their goddamn obsession with their thought-to-be-superior-mythology can make u next president, if it gets released before the elections.\nAlso include deeds of Indra,the Vajra one, he is the bigeda beta of indian mythology,writes essays n goes on rampage again.",
    "super_thanks_amount": ""
  },
  {
    "author": "@drazenbita",
    "comment": "Lies of P but indian?",
    "super_thanks_amount": ""
  },
  {
    "author": "@BaddyPlays",
    "comment": "संकट",
    "super_thanks_amount": ""
  },
  {
    "author": "@G4_Gokul",
    "comment": "7:07 that looks like sekiro",
    "super_thanks_amount": ""
  },
  {
    "author": "@Damnboi47",
    "comment": "Bro our nepali pc high quality game gauley is 1000 times better then this lol",
    "super_thanks_amount": ""
  },
  {
    "author": "@reallyliberal2655",
    "comment": "Damnnn",
    "super_thanks_amount": ""
  },
  {
    "author": "@envee_ee",
    "comment": "please add baked in or realtime shadows to your grass and other props on ground lever thatr would boost ur realism to the next 10 percent cuz your assests are well photoreal and your landscape is good but ur grass and props dont feel lived in because of them not having shadows or not having any sense of connection to the world built around it imo",
    "super_thanks_amount": ""
  },
  {
    "author": "@visible_beasttt",
    "comment": "this is",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheAlgorithmMM",
    "comment": "Jhut mut ma bhai asha humey dete hue saram nhi h bhai",
    "super_thanks_amount": ""
  },
  {
    "author": "@Jesseplaysforfun",
    "comment": "reused asset pack game with no soul in it. nothing new just re used texture game",
    "super_thanks_amount": ""
  },
  {
    "author": "@owasikabaap5231",
    "comment": "Gives lies of p vibes",
    "super_thanks_amount": ""
  },
  {
    "author": "@jacob.pallath91",
    "comment": "legend",
    "super_thanks_amount": ""
  },
  {
    "author": "@PayalShukla-tt9ic",
    "comment": "Good",
    "super_thanks_amount": ""
  },
  {
    "author": "@TheAlgorithmMM",
    "comment": "Bhai humey v gawar. Samjhe ho ka thmhar trh",
    "super_thanks_amount": ""
  },
  {
    "author": "@puru0",
    "comment": "as game dev the game mechanics are terrible and even graphics are terrible you only focused on materials but what about lighting . the game lighting ( one scene you have shown) is looking like u just placed a directional light and left it like that",
    "super_thanks_amount": ""
  },
  {
    "author": "@Being_adnan444",
    "comment": "India gaming community bas fund karwa lo in sai game tati he banayenge ye log",
    "super_thanks_amount": ""
  },
  {
    "author": "@godblessbharat708",
    "comment": "I'm playing witcher 3 from 2015 and this game looks shit compared to it",
    "super_thanks_amount": ""
  },
  {
    "author": "@K_OS_Gaming",
    "comment": "And hopefully you remove those stupid south movie scenes... such a dumb thing to add",
    "super_thanks_amount": ""
  },
  {
    "author": "@s0ul26_YT",
    "comment": "️",
    "super_thanks_amount": ""
  },
  {
    "author": "@ritiksaini147",
    "comment": "mind blowing",
    "super_thanks_amount": ""
  },
  {
    "author": "@pg1122-r7p",
    "comment": "Road class game.",
    "super_thanks_amount": ""
  },
  {
    "author": "@KrunalParmar-d1o",
    "comment": "Sir tak time but give best",
    "super_thanks_amount": ""
  },
  {
    "author": "@Issop96",
    "comment": "W work",
    "super_thanks_amount": ""
  },
  {
    "author": "@Bombay_wali_clips",
    "comment": "Religion based games suck I can see this failing",
    "super_thanks_amount": ""
  },
  {
    "author": "@PiyushKumar-hr6rg",
    "comment": "Wukong mechanics",
    "super_thanks_amount": ""
  },
  {
    "author": "@nadeemshaikh8209",
    "comment": "Goooooooommmmmmmm.....",
    "super_thanks_amount": ""
  },
  {
    "author": "@Bruhgaming-zb6ip",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@hardikkumar1575",
    "comment": "no one playing this",
    "super_thanks_amount": ""
  },
  {
    "author": "@User-57846",
    "comment": "Holy fuck dude wtf",
    "super_thanks_amount": ""
  },
  {
    "author": "@Udot2",
    "comment": "sick",
    "super_thanks_amount": ""
  },
  {
    "author": "@liloz9080",
    "comment": "thats so cool",
    "super_thanks_amount": ""
  },
  {
    "author": "@Aloo-Intelligence",
    "comment": "This is awesome. I only played GTA Vice City a long time ago, but I know that creating a game takes a hell of a lot of resources. Hats off to you for making it possible in India. Right now, I don’t have a gaming PC, but surely in 2026—and I’ll definitely buy your game. Really looking forward to the game's full story!",
    "super_thanks_amount": ""
  },
  {
    "author": "@বোকা_বাঘ",
    "comment": "nice",
    "super_thanks_amount": ""
  },
  {
    "author": "@souravsingh9856",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@ordinarywork",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@I_R_W_GAMING",
    "comment": "8:59",
    "super_thanks_amount": ""
  },
  {
    "author": "@MayankYadav-eh6eg",
    "comment": "This is pretty good for 40 people. The character animations can be cleaned up a little. \n\nAlso AAA companies use a lot of photogrammetry. Idk if any indian studios have but it's very heavily used. \n\nAnyway pretty good work. Will be looking out",
    "super_thanks_amount": ""
  },
  {
    "author": "@Illuminatiking55r",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@subha_roy2512",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@Achieve_NEET",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@Akshaypatil-y7o",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@Krsnaaa-e1d",
    "comment": "Soo excited loved it ️",
    "super_thanks_amount": ""
  },
  {
    "author": "@sagnikdas7472",
    "comment": "NGL ITS KINDA SHIT",
    "super_thanks_amount": ""
  },
  {
    "author": "@FRZgaming2025",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@mayanksolanki3483",
    "comment": "It looks like copied",
    "super_thanks_amount": ""
  },
  {
    "author": "@jacksparrowbp",
    "comment": "11:13 its unreal",
    "super_thanks_amount": ""
  },
  {
    "author": "@johnmax4272",
    "comment": "Abhi India ke game Or games se bht jada pecche hn",
    "super_thanks_amount": ""
  },
  {
    "author": "@AlifHasan-bx1ew",
    "comment": "A very very very cheap version of sekiro",
    "super_thanks_amount": ""
  },
  {
    "author": "@Ujjwalsharma4u",
    "comment": "8:30 Rizz...",
    "super_thanks_amount": ""
  },
  {
    "author": "@xyzgggf",
    "comment": "Wow bruh",
    "super_thanks_amount": ""
  },
  {
    "author": "@HarshKumar-gh9uc",
    "comment": "13:54 indian core",
    "super_thanks_amount": ""
  },
  {
    "author": "@SagarSingh-e7m",
    "comment": "Combat looks bad .",
    "super_thanks_amount": ""
  },
  {
    "author": "@pmkgamer",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@abdurrehman4142",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@RonakSharma2525",
    "comment": "w varun",
    "super_thanks_amount": ""
  },
  {
    "author": "@rsk2002",
    "comment": "#GameChanger",
    "super_thanks_amount": ""
  },
  {
    "author": "@ankits9791",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@rahulpatilrgp",
    "comment": "good game",
    "super_thanks_amount": ""
  },
  {
    "author": "@shuvendudas3404",
    "comment": "It is copy of sekiro game",
    "super_thanks_amount": ""
  },
  {
    "author": "@mario-me1",
    "comment": "wtf is that",
    "super_thanks_amount": ""
  },
  {
    "author": "@thomasthetrain007",
    "comment": "Sekiro wukong ki copy paste mardi bhai ne",
    "super_thanks_amount": ""
  },
  {
    "author": "@chandanpanigrahi252",
    "comment": "🫡",
    "super_thanks_amount": ""
  },
  {
    "author": "@Beelzebub_10",
    "comment": "AAA GAME ?",
    "super_thanks_amount": ""
  },
  {
    "author": "@DestroyerWolfFenrir",
    "comment": "Wtf is this",
    "super_thanks_amount": ""
  },
  {
    "author": "@dhruvgulati1667",
    "comment": "Farcry 2 -3 se bakar lag raha.\n\nFarcry nepal was so much better.\nIts a decade old game almost.\nWith all this AI.\nThis shitty product gameplay.",
    "super_thanks_amount": ""
  },
  {
    "author": "@pessimistkai5569",
    "comment": "Boring",
    "super_thanks_amount": ""
  },
  {
    "author": "@_CAZZUAL_",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@AbinashChaudhary-u8q",
    "comment": "4:24",
    "super_thanks_amount": ""
  },
  {
    "author": "@cctvgaming7651",
    "comment": "i didnt like it",
    "super_thanks_amount": ""
  },
  {
    "author": "@swaraj.jagdale",
    "comment": "fye",
    "super_thanks_amount": ""
  },
  {
    "author": "@animcold",
    "comment": "dammmmmmmm",
    "super_thanks_amount": ""
  },
  {
    "author": "@bsaiashish5853",
    "comment": "Sekiro",
    "super_thanks_amount": ""
  },
  {
    "author": "@Im_sonu1",
    "comment": "Op",
    "super_thanks_amount": ""
  },
  {
    "author": "@IND_train_SIM_STUDIO",
    "comment": "Only show off",
    "super_thanks_amount": ""
  },
  {
    "author": "@murshidaazad1305",
    "comment": "Broooooooo",
    "super_thanks_amount": ""
  },
  {
    "author": "@Inner_Issin",
    "comment": "What trash",
    "super_thanks_amount": ""
  },
  {
    "author": "@AJ_Inder",
    "comment": "this game is fire",
    "super_thanks_amount": ""
  },
  {
    "author": "@naimurX",
    "comment": "trash: graphics doesn't matter",
    "super_thanks_amount": ""
  },
  {
    "author": "@ARTs896",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@33connorkenway33",
    "comment": "Cringe 8:27",
    "super_thanks_amount": ""
  },
  {
    "author": "@debojitsen6250",
    "comment": "Rubbish",
    "super_thanks_amount": ""
  },
  {
    "author": "@yogitabaraskar-cb5oo",
    "comment": "In a mobile please",
    "super_thanks_amount": ""
  },
  {
    "author": "@Zantok_Editz",
    "comment": "",
    "super_thanks_amount": ""
  },
  {
    "author": "@adityadeshpande5769",
    "comment": "Loved it",
    "super_thanks_amount": ""
  },
  {
    "author": "@chantelsopio5826",
    "comment": "Bwhahahahah",
    "super_thanks_amount": ""
  },
  {
    "author": "@devipboy137",
    "comment": "Is this game is inspire by some game from china",
    "super_thanks_amount": ""
  },
  {
    "author": "@notshloke",
    "comment": "Rockstar Games have been a real quiet since this came out",
    "super_thanks_amount": ""
  },
  {
    "author": "@CreatorToonzShort",
    "comment": "Crazy",
    "super_thanks_amount": ""
  },
  {
    "author": "@osiris9356",
    "comment": "i wont say game is bad but this game being a soulslike is very bad as soulslike games have dark themes, was there anything dark stuff there? lets not count the blood, if this game released for soulslike i will just say its mid for soulslike totally not suitable for it, better yet just make it some rpg or linear rpg game. i played all souls games and almost all soulslikes games and i have only one word for this game if it came as soulslike - trash.",
    "super_thanks_amount": ""
  },
  {
    "author": "@yogitabaraskar-cb5oo",
    "comment": "Open world",
    "super_thanks_amount": ""
  },
  {
    "author": "@ooogabooga5111",
    "comment": "btw eat something, you look very sick. take care of ur health.",
    "super_thanks_amount": ""
  }
]